{
  "metadata" : {
    "size" : "74"
  },
  "items" : [ {
    "termCode" : "2016FA",
    "subjectId" : "9.24",
    "academicYear" : "2016",
    "title" : "Disorders and Diseases of the Nervous System",
    "cluster" : null,
    "prerequisites" : "9.00, 9.01, 9.09",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Topics examined include regional functional anatomy of the CNS; brain systems and circuits; neurodevelopmental disorders including autism; neuropsychiatric disorders such as schizophrenia; neurodegenerative diseases such as Parkinson's and Alzheimer's; autoimmune disorders such as multiple sclerosis; gliomas. Emphasis on diseases for which a molecular mechanism is understood. Diagnostic criteria, clinical and pathological findings, genetics, model systems, pathophysiology, and treatment are discussed for individual disorders and diseases.",
    "instructors" : "M. Sur"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.26",
    "academicYear" : "2016",
    "title" : "Principles and Applications of Genetic Engineering for Biotechnology and Neuroscience",
    "cluster" : "(Same subject as 20.205J)",
    "prerequisites" : "7.28, 7.32, or 20.020; 9.01 or 9.09",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers principles underlying current and future genetic engineering approaches, ranging from single cellular organisms to whole animals. Focuses on development and invention of technologies for engineering biological systems at the genomic level, and applications of engineered biological systems for medical and biotechnological needs, with particular emphasis on genetic manipulation of the nervous system. Design projects by students.",
    "instructors" : "F. Zhang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.015",
    "academicYear" : "2016",
    "title" : "Molecular and Cellular Neuroscience Core I",
    "cluster" : "(Same subject as 7.65J)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Survey and primary literature review of major topic areas in molecular and cellular neurobiology. Covers neurogenomics, nervous system formation, axonal pathfinding, cytoskeletal regulation, synapse formation, neurotransmitter release, and cellular neurophysiology. Includes lectures and weekly paper write-ups, together with student presentations and discussion of primary literature. A final two-page research write-up is also due at the end of the term.",
    "instructors" : "J. T. Littleton, H. Sive, F. Gertler"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.UR",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.URG",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Individual participation in an ongoing research project.",
    "instructors" : "Consult Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.00",
    "academicYear" : "2016",
    "title" : "Introduction to Psychological Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "4-0-8 HASS-S",
    "optional" : null,
    "description" : "A survey of the scientific study of human nature, including how the mind works, and how the brain supports the mind.  Topics include the mental and neural bases of perception, emotion, learning, memory, cognition, child development, personality, psychopathology, and social interaction.  Consideration of how such knowledge relates to debates about nature and nurture, free will, consciousness, human differences, self, and society.",
    "instructors" : "J. D. Gabrieli"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.01",
    "academicYear" : "2016",
    "title" : "Introduction to Neuroscience",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR) or permission of instructor",
    "units" : "4-0-8 REST",
    "optional" : null,
    "description" : "Introduction to the mammalian nervous system, with emphasis on the structure and function of the human brain. Topics include the function of nerve cells, sensory systems, control of movement, learning and memory, and diseases of the brain.",
    "instructors" : "M. Bear"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.011",
    "academicYear" : "2016",
    "title" : "Systems Neuroscience",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "6-0-12",
    "optional" : null,
    "description" : "Survey of brain and behavioral studies. Examines principles underlying the structure and function of the nervous system, with a focus on systems approaches. Topics include development of the nervous system and its connections, sensory systems of the brain, the motor system, higher cortical functions, and behavioral and cellular analyses of learning and memory. Preference to first-year graduate students in BCS.",
    "instructors" : "M. Wilson, E. K. Miller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.012",
    "academicYear" : "2016",
    "title" : "Cognitive Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "6-0-12",
    "optional" : null,
    "description" : "Intensive survey of cognitive science. Topics include visual perception, language, memory, cognitive architecture, learning, reasoning, decision-making, and cognitive development. Topics covered from behavioral, computational, and neural perspectives.",
    "instructors" : "E. Gibson, P. Sinha, J. Tenenbaum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.013",
    "academicYear" : "2016",
    "title" : "Molecular and Cellular Neuroscience Core II",
    "cluster" : "(Same subject as 7.68J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Survey and primary literature review of major areas in molecular and cellular neurobiology. Covers genetic neurotrophin signaling, adult neurogenesis, G-protein coupled receptor signaling, glia function, epigenetics, neuronal and homeostatic plasticity, neuromodulators of circuit function, and neurological/psychiatric disease mechanisms. Includes lectures and exams, and involves presentation and discussion of primary literature. 9.015 recommended, though the core subjects can be taken in any sequence.",
    "instructors" : "G. Feng, L.-H. Tsai, Y. Lin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.04",
    "academicYear" : "2016",
    "title" : "Sensory Systems",
    "cluster" : null,
    "prerequisites" : "9.01 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the neural bases of sensory perception. Focuses on physiological and anatomical studies of the mammalian nervous system as well as behavioral studies of animals and humans. Topics include visual pattern, color and depth perception, auditory responses and sound localization, olfactory and somatosensory perception.",
    "instructors" : "P. H. Schiller, M. C. Brown"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.09",
    "academicYear" : "2016",
    "title" : "Cellular and Molecular Neurobiology",
    "cluster" : "(Same subject as 7.29J)",
    "prerequisites" : "7.05 or 9.01",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 7.29J.",
    "instructors" : "W. G. Quinn, T. Littleton"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.10",
    "academicYear" : "2016",
    "title" : "Cognitive Neuroscience",
    "cluster" : null,
    "prerequisites" : "9.01",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores the cognitive and neural processes that support attention, vision, language, social cognition, music understanding, emotion, motor control, and memory. Begins with the fundamental behavioral phenomena, then progresses to models based on brain systems in humans and animals, and ultimately models based on populations of neurons. Includes examples of clinical conditions and case studies in patients. Students prepare presentations summarizing journal articles.",
    "instructors" : "R. Desimone, E. K. Miller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.14",
    "academicYear" : "2016",
    "title" : "Brain Structure and its Origins",
    "cluster" : null,
    "prerequisites" : "9.01",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides an introduction to functional neuroanatomy with a focus on mammals, aided by studies of comparative neuroanatomy and evolution and of brain development. Topics include early steps to a central nervous system, basic patterns of brain and spinal cord connections, regional development and differentiation, regeneration, motor and sensory pathways and structures, systems underlying motivations, innate action patterns, formation of habits, and various cognitive functions. Review of lab techniques. Optional brain dissections.",
    "instructors" : "G. E. Schneider"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.15",
    "academicYear" : "2016",
    "title" : "Neural Circuits, Neuromodulatory, and Neuroendocrine Systems",
    "cluster" : null,
    "prerequisites" : "9.01 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the brain from a neuropharmacological perspective, specifically interactions governed by catecholamines, monoamines, neuropeptides, and more. Covers the functional contribution of neuromodulatory systems to both health and disease, and their influence on behaviors relevant to appetite and feeding, social behavior, reward and motivation, anxiety and fear, as well as how drugs alter neural activity.",
    "instructors" : "K. Tye"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.181",
    "academicYear" : "2016",
    "title" : "Developmental Neurobiology",
    "cluster" : "(Same subject as 7.69J)\n(Subject meets with 7.49J, 9.18J)",
    "prerequisites" : "9.011 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Considers molecular control of neural specification, formation of neuronal connections, construction of neural systems, and the contributions of experience to shaping brain structure and function. Topics include: neural induction and pattern formation, cell lineage and fate determination, neuronal migration, axon guidance, synapse formation and stabilization, activity-dependent development and critical periods, development of behavior. In addition to final exam, analysis and presentation of  research papers required for final grade. Students taking graduate version complete additional assignments.",
    "instructors" : "E. Nedivi, M. Heiman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.301",
    "academicYear" : "2016",
    "title" : "Neural Plasticity in Learning and Memory",
    "cluster" : "(Same subject as 7.98J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Examination of the role of neural plasticity during learning and memory of invertebrates and mammals. Detailed critical analysis of the current literature of molecular, cellular, genetic, electrophysiological, and behavioral studies. Student-directed presentations and discussions of original papers supplemented by introductory lectures. Juniors and seniors require instructor's permission.",
    "instructors" : "S. Tonegawa, W. Quinn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.322",
    "academicYear" : "2016",
    "title" : "Genetic Methods in Neurobiology",
    "cluster" : "(Same subject as 7.67J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Presents selected topics in which genetic analysis informs neurobiological issues, including action potential conduction and synaptic release in Drosophila, axon guidance in nematodes and Drosophila, olfaction and orienting behavior in nematodes. Studies hippocampal and cortical circuitry and function in mice, as well as genetically-determined and genetically-influenced human traits and diseases. Reviews methods such as mutagenesis, gene knockouts and transgene constructs, tissue-specific expression vectors, optically, chemically and thermally-inducible gene activation and inactivation.",
    "instructors" : "W. G. Quinn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.35",
    "academicYear" : "2016",
    "title" : "Perceptual Systems",
    "cluster" : null,
    "prerequisites" : "9.00, 9.01; or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Studies how the senses work and how physical stimuli are transformed into signals in the nervous system. Examines how the brain uses those signals to make inferences about the world, and uses illusions and demonstrations gain insight into those inferences. Emphasizes audition and vision, with some discussion of touch, taste, and smell. Provides experience with psychophysical methods.",
    "instructors" : "J. McDermott"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.357",
    "academicYear" : "2016",
    "title" : "Current Topics in Vision Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-7",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced seminar on issues of current interest in human and machine vision. Topics vary from year to year. Participants discuss current literature as well as their ongoing research.",
    "instructors" : "E. H. Adelson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.50",
    "academicYear" : "2016",
    "title" : "Research in Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "9.00, permission of instructor",
    "units" : "0-12-0",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory research in brain and cognitive science, using physiological, anatomical, pharmacological, developmental, behavioral, and computational methods. Each student carries out an experimental study under the direction of a member of the faculty. Project must be approved in advance by the faculty supervisor and the Director of the Undergraduate Program. Written presentation of results is required.",
    "instructors" : "Consult L. Schulz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.520",
    "academicYear" : "2016",
    "title" : "Statistical Learning Theory and Applications",
    "cluster" : null,
    "prerequisites" : "6.867, 6.041, 18.06, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides students with the knowledge needed to use and develop advanced machine learning solutions to challenging problems. Covers foundations and recent advances of machine learning in the framework of statistical learning theory. Focuses on regularization techniques key to high-dimensional supervised learning. Starting from classical methods such as regularization networks and support vector machines, addresses state-of-the-art techniques based on principles such as geometry or sparsity, and discusses a variety of algorithms for supervised learning, feature selection, structured prediction, and multitask learning. Also focuses on unsupervised learning of data representations, with an emphasis on hierarchical (deep) architectures.",
    "instructors" : "T. Poggio, L. Rosasco"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.59",
    "academicYear" : "2016",
    "title" : "Laboratory in Psycholinguistics",
    "cluster" : "(Same subject as 24.905J)",
    "prerequisites" : "9.00 or 24.900",
    "units" : "3-3-6 Institute LAB",
    "optional" : null,
    "description" : "Hands-on experience designing, conducting, analyzing, and presenting experiments on the structure and processing of human language. Focuses on constructing, conducting, analyzing, and presenting an original and independent experimental project of publishable quality. Develops skills in reading and writing scientific research reports in cognitive science, including evaluating the methods section of a published paper, reading and understanding graphical displays and statistical claims about data, and evaluating theoretical claims based on experimental data.  Instruction and practice in oral and written communication provided.",
    "instructors" : "E. Gibson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.601",
    "academicYear" : "2016",
    "title" : "Language Acquisition I",
    "cluster" : "(Same subject as 24.949J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Lectures, reading, and discussion of current theory and data concerning the psychology and biology of language acquisition. Emphasizes learning of syntax, semantics, and morphology, together with some discussion of phonology, and especially research relating grammatical theory and learnability theory to empirical studies of children.",
    "instructors" : "M. Hackl"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.611",
    "academicYear" : "2016",
    "title" : "Natural Language and the Computer Representation of Knowledge",
    "cluster" : "(Same subject as 6.863J)",
    "prerequisites" : "6.034",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "See description under subject 6.863J.",
    "instructors" : "R. C. Berwick"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.65",
    "academicYear" : "2016",
    "title" : "Cognitive Processes",
    "cluster" : null,
    "prerequisites" : "9.00",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Introduction to human information processing and learning. Topics include the nature of mental representation and processing, memory and learning, pattern recognition, attention, imagery and mental codes, concepts and prototypes, as well as reasoning and problem-solving.",
    "instructors" : "M. C. Potter"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.71",
    "academicYear" : "2016",
    "title" : "Functional MRI Investigations of the Human Brain",
    "cluster" : null,
    "prerequisites" : "9.40; 9.35, 9.65, or 9.66; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers design and interpretation of fMRI experiments, and the relationship between fMRI and other techniques. Focuses on localization of cognitive function in the human brain. Students write papers and give presentations, explain and critique published papers, and design but do not conduct their own fMRI experiments. Upon completion, students should be able to understand and critique published fMRI papers and have a good grasp of what is known about localization of cognitive function from fMRI. Instruction and practice in written and oral communication provided. Limited to 12.",
    "instructors" : "N. G. Kanwisher"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.91",
    "academicYear" : "2016",
    "title" : "Independent Study in Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "9.00 and any other two subjects in Brain and Cognitive Sciences; permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Individual study of a topic under the direction of a member of the faculty.",
    "instructors" : "Consult Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.919",
    "academicYear" : "2016",
    "title" : "Teaching Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "For teaching assistants in Brain and Cognitive Sciences, in cases where teaching assignment is approved for academic credit by the department.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.921",
    "academicYear" : "2016",
    "title" : "Research in Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Guided research under the sponsorship of individual members of the faculty. Ordinarily restricted to candidates for the doctoral degree in Course 9.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.941",
    "academicYear" : "2016",
    "title" : "Graduate Thesis Proposal",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Students submit written proposals for thesis according to stated deadlines.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.THG",
    "academicYear" : "2016",
    "title" : "Graduate Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of a Ph.D. thesis; to be arranged by the student and an appropriate MIT faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.12",
    "academicYear" : "2016",
    "title" : "Experimental Molecular Neurobiology",
    "cluster" : null,
    "prerequisites" : "9.01, Biology (GIR)",
    "units" : "2-4-6 Institute LAB",
    "optional" : null,
    "description" : "Experimental techniques in cellular and molecular neurobiology. Designed for students without previous experience in techniques of cellular and molecular biology. Experimental approaches include DNA manipulation, molecular clonging, protein biochemistry, dissection and culture of brain cells, synaptic protein analysis, immunocytochemistry, and fluorescent microscopy. One lab session plus one paper review session per week. Instruction and practice in written communication provided. Enrollment limited.",
    "instructors" : "Y. Lin, G. Choi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.660",
    "academicYear" : "2016",
    "title" : "Computational Cognitive Science",
    "cluster" : "(Subject meets with 6.804J, 9.66J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to computational theories of human cognition. Focuses on principles of inductive learning and inference, and the representation of knowledge. Computational frameworks include Bayesian and hierarchical Bayesian models, probabilistic graphical models, nonparametric statistical models and the Bayesian Occam's razor, sampling algorithms for approximate learning and inference, and probabilistic models defined over structured representations such as first-order logic, grammars, or relational schemas. Applications to understanding core aspects of cognition, such as concept learning and categorization, causal reasoning, theory formation, language acquisition, and social inference. Graduate students complete a final project.",
    "instructors" : "J. Tenenbaum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.422",
    "academicYear" : "2016",
    "title" : "Principles of Neuroengineering",
    "cluster" : "(Same subject as 20.452J, MAS.881J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject MAS.881J.",
    "instructors" : "E. S. Boyden, III"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.455",
    "academicYear" : "2016",
    "title" : "Revolutionary Ventures: How to Invent and Deploy Transformative Technologies",
    "cluster" : "(Same subject as 15.128J, 20.454J, MAS.883J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "See description under subject MAS.883J.",
    "instructors" : "J. Bonsen, E. S. Boyden, J. Jacobson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.073",
    "academicYear" : "2016",
    "title" : "Statistics for Neuroscience Research",
    "cluster" : "(Same subject as HST.460J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A survey of statistical methods for neuroscience research. Core topics include introductions to the theory of point processes, the generalized linear model, Monte Carlo methods, Bayesian methods, multivariate methods, time-series analysis, spectral analysis and state-space modeling. Emphasis on developing a firm conceptual understanding of the statistical paradigm and statistical methods primarily through analyses of actual experimental data.",
    "instructors" : "E. N. Brown"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.272",
    "academicYear" : "2016",
    "title" : "Topics in Neural Signal Processing",
    "cluster" : "(Same subject as HST.576J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents signal processing and statistical methods used to study neural systems and analyze neurophysiological data. Topics include state-space modeling formulated using the Bayesian Chapman-Kolmogorov system, theory of point processes, EM algorithm, Bayesian and sequential Monte Carlo methods. Applications include dynamic analyses of neural encoding, neural spike train decoding, studies of neural receptive field plasticity, algorithms for neural prosthetic control, EEG and MEG source localization. Students should know introductory probability theory and statistics. Alternate years.",
    "instructors" : "E. N. Brown"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.472",
    "academicYear" : "2016",
    "title" : "Neuroimaging Cells and Circuits",
    "cluster" : "(Same subject as 20.472J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Offers an introduction to imaging methods at the forefront of modern neurobiology.  Emphasis is placed on <i>in vivo</i> imaging in the context of neural systems research.  Specific topics covered include classical optics, fluorescence and fluorescent dyes, multiphoton microscopy, reflectance-based imaging methods, functional and anatomical magnetic resonance imaging, and molecular neuroimaging. Both applications and underlying principles are discussed, and lectures are supplemented by demonstrations of imaging techniques in the laboratory. Limited to 15.",
    "instructors" : "A. Jasanoff, P. T. So"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.20",
    "academicYear" : "2016",
    "title" : "Animal Behavior",
    "cluster" : null,
    "prerequisites" : "9.00",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Reviews studies of animal behavior to stress major ideas and principles, with emphasis on concepts developed in ethology and sociobiology. Examines foraging and feeding, defensive and aggressive behavior, courtship and reproduction, migration and navigation, as well as various social activities and communication. Considers inherited abilities, motivational systems and motor patterns, together with influences of various types of learning. Reviews both field and laboratory studies, and considers human behavior in the context of primate studies.",
    "instructors" : "G. E. Schneider"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.173",
    "academicYear" : "2016",
    "title" : "Noninvasive Imaging in Biology and Medicine",
    "cluster" : "(Same subject as 20.483J, 22.56J, HST.561J)",
    "prerequisites" : "18.03, 8.03, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 22.56J.",
    "instructors" : "A. Jasanoff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.285",
    "academicYear" : "2016",
    "title" : "Neural Coding and Perception of Sound",
    "cluster" : "(Same subject as HST.723J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "See description under subject HST.723J.",
    "instructors" : "B. Delgutte, M. C. Brown, J. J. Guinan, J. McDermott, J. Melcher, D. Polley"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.56",
    "academicYear" : "2016",
    "title" : "Abnormal Language",
    "cluster" : "(Same subject as 24.907J)",
    "prerequisites" : "24.900 or permission of instructor",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Introduction to the linguistic study of language pathology, concentrating on experimental approaches and theoretical explanations. Discussion of Specific Language Impairment, Down syndrome, William's syndrome, autism, normal aging, Parkinson's disease, Alzheimer's disease, hemispherectomy, and aphasia. Focuses on the comparison of linguistic abilities among these syndromes, while drawing clear comparisons with first- and second-language acquisition. Topics include the lexicon, morphology, syntax, semantics, and pragmatics. Relates the lost linguistic abilities in these syndromes to properties of the brain.",
    "instructors" : "K. Wexler"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.31",
    "academicYear" : "2016",
    "title" : "Neurophysiology of Learning and Memory",
    "cluster" : null,
    "prerequisites" : "9.01",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Surveys the mechanisms supporting plasticity in neurons, focusing on how it contributes to learning in several systems. Examines cellular forms of associative plasticity, including long-term potentiation and depression, metaplasticity, homeostatic plasticity, and depotentiation. Relates these phenomena to associative memory in animal systems and humans. Completion of 9.09 recommended.",
    "instructors" : "K. Goosens"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.41",
    "academicYear" : "2016",
    "title" : "Research and Communication in Neuroscience and Cognitive Science",
    "cluster" : null,
    "prerequisites" : "9.URG, permission of instructor",
    "units" : "2-12-4",
    "optional" : null,
    "description" : "Emphasizes research and scientific communication. Instruction and practice in written and oral communication provided. Based on results of his/her UROP research, each student creates a full-length paper and a poster as part of an oral presentation at the end of the term. Other assignments include peer editing and reading/critiquing published research papers. Prior to starting class, students must have collected enough data from their UROP research projects to write a paper. Limited to juniors and seniors.",
    "instructors" : "S. Jhaveri, L. Schulz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.66",
    "academicYear" : "2016",
    "title" : "Computational Cognitive Science",
    "cluster" : "(Same subject as 6.804J)\n(Subject meets with 9.660)",
    "prerequisites" : "9.40, 18.05, 18.600, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to computational theories of human cognition. Focus on principles of inductive learning and inference, and the representation of knowledge. Computational frameworks covered include Bayesian and hierarchical Bayesian models; probabilistic graphical models; nonparametric statistical models and the Bayesian Occam's razor; sampling algorithms for approximate learning and inference; and probabilistic models defined over structured representations such as first-order logic, grammars, or relational schemas. Applications to understanding core aspects of cognition, such as concept learning and categorization, causal reasoning, theory formation, language acquisition, and social inference. Graduate students complete a final project.",
    "instructors" : "J. Tenenbaum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.85",
    "academicYear" : "2016",
    "title" : "Infant and Early Childhood Cognition",
    "cluster" : null,
    "prerequisites" : "9.00",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Introduction to cognitive development focusing on childrens' understanding of objects, agents, and causality. Develops a critical understanding of experimental design. Discusses how developmental research might address philosophical questions about the origins of knowledge, appearance and reality, and the problem of other minds.  Provides instruction and practice in written communication as necessary to research in cognitive science (including critical reviews of journal papers, a literature review and an original research proposal), as well as instruction and practice in oral communication in the form of a poster presentation of a journal paper.",
    "instructors" : "L. Schulz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.77",
    "academicYear" : "2016",
    "title" : "Computational Perception",
    "cluster" : null,
    "prerequisites" : "9.00, 9.40; 9.35 or 9.65",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Begins with a review of the experimental paradigms, findings and theories used to evaluate the capabilities and limits of human visual perception. Assesses how knowledge of human perception may be used to guide machine vision systems. Second part of the subject focuses on models in computational perception. Describes how computer vision systems can perform image analysis and synthesis; face, object and scene perception; texture synthesis, segmentation, and navigation. Introduces various simulation methods. A MATLAB-based project in computational perception is required. Limited to 8.",
    "instructors" : "E. Adelson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.48",
    "academicYear" : "2016",
    "title" : "Philosophical Issues in Brain Science",
    "cluster" : "(Same subject as 24.08J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-H; CI-H",
    "optional" : null,
    "description" : "See description under subject 24.08J.",
    "instructors" : "A. Byrne"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.S92",
    "academicYear" : "2016",
    "title" : "Special Subject in Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "9.00",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Undergraduate study in brain and cognitive sciences; covers material not offered in regular curriculum.",
    "instructors" : "Consult Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.S99",
    "academicYear" : "2016",
    "title" : "Special Subject in Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "For undergraduate study in brain and cognitive sciences during Independent Activities Period; covers material not offered in regular curriculum. See IAP Guide for details.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.S52",
    "academicYear" : "2016",
    "title" : "Special Subject in Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "9.00 and any other two subjects in Brain and Cognitive Sciences",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Undergraduate study in brain and cognitive sciences; covers material not offered in regular curriculum.",
    "instructors" : "Consult Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.S917",
    "academicYear" : "2016",
    "title" : "Special Subject in Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced graduate study in brain and cognitive sciences; covers material not offered in regular curriculum. 9.S911 is graded P/D/F.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.S51",
    "academicYear" : "2016",
    "title" : "Special Subject in Brain and Cognitive Sciences",
    "cluster" : null,
    "prerequisites" : "9.00 and any other two subjects in Brain and Cognitive Sciences",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Undergraduate study in brain and cognitive sciences; covers material not offered in regular curriculum.",
    "instructors" : "Consult Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.18",
    "academicYear" : "2016",
    "title" : "Developmental Neurobiology",
    "cluster" : "(Same subject as 7.49J)\n(Subject meets with 7.69J, 9.181J)",
    "prerequisites" : "9.01, 7.03, 7.05, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.63",
    "academicYear" : "2016",
    "title" : "Laboratory in Visual Cognition",
    "cluster" : null,
    "prerequisites" : "9.00, 9.40, or permission of instructor",
    "units" : "2-1-9 Institute LAB",
    "optional" : null,
    "description" : "Teaches principles of experimental methods in human visual perception and attention, including how to design, conduct, analyze, and present experiments in visual cognition. Combines lectures and hands-on experimental exercises. Requires two experimental projects, at least one of which is conducted independently; the other may be done as part of a team. Assignments include individual reports on experimental designs, written articles, and presentations critiquing three team experiments observed in class. Instruction and practice in written and oral communication provided. Experience with MATLAB is recommended. Limited to 16.",
    "instructors" : "P. Sinha"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.16",
    "academicYear" : "2016",
    "title" : "Cellular Neurophysiology",
    "cluster" : null,
    "prerequisites" : "9.40",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Surveys the mechanisms of neuronal communication. Covers ion channels in excitable membrane, single cell computation, synaptic transmission, and synaptic plasticity. Correlates the properties of ion channels and synaptic transmission with their physiological function. Discusses the organizational principles for the formation of functional neural networks at synaptic and cellular levels. Involves discussion of primary literature.",
    "instructors" : "W. Xu"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.17",
    "academicYear" : "2016",
    "title" : "Systems Neuroscience Laboratory",
    "cluster" : null,
    "prerequisites" : "9.40; 18.05 or 18.600; or permission of instructor",
    "units" : "2-4-6 Institute LAB",
    "optional" : null,
    "description" : "Consists of a series of laboratories designed to give students experience with basic techniques for conducting systems neuroscience research. Includes sessions on anatomical, neurophysiological, and data acquisition and analysis techniques, and how these techniques are used to study nervous system function. Involves the use of experimental animals. Assignments include weekly preparation for lab sessions, two major lab reports and a series of basic computer programming tutorials (MATLAB). Instruction and practice in written communication provided. Enrollment limited.",
    "instructors" : "J. J. DiCarlo, M. Jazayeri, K. Tye"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.40",
    "academicYear" : "2016",
    "title" : "Introduction to Neural Computation",
    "cluster" : null,
    "prerequisites" : "6.0002, 9.01",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduces quantitative approaches to understanding brain and cognitive functions. Topics include mathematical description of neurons, the response of neurons to sensory stimuli, simple neuronal networks, statistical inference and decision making. Also covers foundational quantitative tools of data analysis in neuroscience: correlation, convolution, spectral analysis, principal components analysis. Mathematical concepts include simple differential equations and linear algebra.",
    "instructors" : "M. Fee"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.54",
    "academicYear" : "2016",
    "title" : "Computational Aspects of Biological Learning",
    "cluster" : null,
    "prerequisites" : "9.40",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Takes a computational approach to learning in the brain by neurons and synapses. Examines supervised and unsupervised learning as well as possible biological substrates, including Hebb synapses and the related topics of Oja flow and principal components analysis. Discusses hypothetical computational primitives in the nervous system, and the implications for unsupervised learning algorithms underlying the development of tuning properties of cortical neurons. Also focuses on a broad class of biologically plausible learning strategies.",
    "instructors" : "T. Poggio, S. Ullman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.97",
    "academicYear" : "2016",
    "title" : "Introduction to Neuroanatomy",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-0-0 [P/D/F]",
    "optional" : null,
    "description" : "Intensive introduction to neuroanatomy that consists of lectures, demonstrations, and interactive laboratories, including a brain dissection. No prior knowledge of neuroanatomy required, although general knowledge of brain structures is helpful. Pre-register on WebSIS; must attend first class. Limited to 100.",
    "instructors" : "R. Ellis-Behnke"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.46",
    "academicYear" : "2016",
    "title" : "Neuroscience of Morality",
    "cluster" : null,
    "prerequisites" : "9.00, 9.01; 9.10, 9.20, or 9.85",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Advanced seminar that covers both classic and cutting-edge primary literature from psychology and the neuroscience of morality. Addresses questions about how the human brain decides which actions are morally right or wrong (including neural mechanisms of empathy and self-control), how such brain systems develop over childhood and differ across individuals and cultures, and how they are affected by brain diseases (such as psychopathy, autism, tumors, or addiction). Instruction and practice in written and oral communication provided. Limited to 24.",
    "instructors" : "R. Saxe"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.822",
    "academicYear" : "2016",
    "title" : "Psychology and Economics",
    "cluster" : "(Same subject as 14.137J)",
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 14.137J.",
    "instructors" : "D. Prelec"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.901",
    "academicYear" : "2016",
    "title" : "Responsible Conduct in Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-0-1 [P/D/F]",
    "optional" : null,
    "description" : "Provides instruction and dialogue on practical ethical issues relating to the responsible conduct of human and animal research in the brain and cognitive sciences. Specific emphasis on topics relevant to young researchers including data handling, animal and human subjects, misconduct, mentoring, intellectual property, and publication. Preliminary assigned readings and initial faculty lecture followed by discussion groups of four to five students each. A short written summary of the discussions submitted at the end of each class. See IAP Guide for registration information.",
    "instructors" : "M. Wilson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.95",
    "academicYear" : "2016",
    "title" : "Research Topics in Neuroscience",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-0-0 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Lecture series that highlights faculty research in various fields of neuroscience. Each of the six lectures focuses on a specific area of brain research, delineating issues, methods, and findings pertinent to the topic. Exam administered during seventh and final class session. Pre-register on WebSIS; must attend first class.",
    "instructors" : "P. H. Schiller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.175",
    "academicYear" : "2016",
    "title" : "Robotics",
    "cluster" : "(Same subject as 2.165J)",
    "prerequisites" : "2.151 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.165J.",
    "instructors" : "J.-J. E. Slotine, H. Asada"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.28",
    "academicYear" : "2016",
    "title" : "Current Topics in Developmental Neurobiology",
    "cluster" : null,
    "prerequisites" : "None. <I>Coreq: 9.18</I>",
    "units" : "3-0-12",
    "optional" : null,
    "description" : "Considers recent advances in the field of developmental neurobiology based on primary research articles that address molecular control of neural specification, formation of neuronal connections, construction of neural systems, and the contributions of experience to shaping brain structure and function. Also considers new techniques and methodologies as applied to the field. Students critically analyze articles and prepare concise and informative presentations based on their content. Instruction and practice in written and oral communication provided. Requires class participation, presentations, and final exam.",
    "instructors" : "E. Nedivi, M. Heiman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.07",
    "academicYear" : "2016",
    "title" : "Statistics for Brain and Cognitive Science",
    "cluster" : null,
    "prerequisites" : "9.40",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Provides students with the basic tools for analyzing experimental data, properly interpreting statistical reports in the literature, and reasoning under uncertain situations. Topics organized around three key theories: probability, statistical, and the linear model. Probability theory covers axioms of probability, discrete and continuous probability models, law of large numbers, and the Central Limit Theorem. Statistical theory covers estimation, likelihood theory, Bayesian methods, bootstrap and other Monte Carlo methods, as well as hypothesis testing, confidence intervals, elementary design of experiments principles and goodness-of-fit. The linear model theory covers the simple regression model and the analysis of variance. Places equal emphasis on theory, data analyses, and simulation studies.",
    "instructors" : "E. N. Brown"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.34",
    "academicYear" : "2016",
    "title" : "Biomechanics and Neural Control of Movement",
    "cluster" : "(Same subject as 2.183J)\n(Subject meets with 2.184)",
    "prerequisites" : "2.004, 2.04A, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.183J.",
    "instructors" : "N. Hogan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.33",
    "academicYear" : "2016",
    "title" : "Your Brain: A User's Guide",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-E",
    "optional" : null,
    "description" : "Provides students with perspective on brain functions and behaviors of particular relevance to individuals their age. Using library databases, students conduct scholarly research and compare the attitudes conveyed in magazines and newspapers with facts from neurobiology textbooks, scientific reviews, and basic research articles. Each student presents and leads a discussion on a topic related to a behavior of his or her choosing. Preference to freshmen and non-Course 9 majors; limited to 17.",
    "instructors" : "M. Constantine-Paton"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.32",
    "academicYear" : "2016",
    "title" : "Genes, Circuits, and Behavior",
    "cluster" : null,
    "prerequisites" : "9.09, 9.10, 9.16, or 9.18",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on understanding molecular and cellular mechanisms of circuitry development, function and plasticity, and their relevance to normal and abnormal behaviors/psychiatric disorders. Highlights cutting-edge technologies for neuroscience research. Students build professional skills through presentations and critical evaluation of original research papers.",
    "instructors" : "G. Feng"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.523",
    "academicYear" : "2016",
    "title" : "Aspects of Computational Theory of Intelligence",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Integrates neuroscience, cognitive and computer science to explore the nature of intelligence, how it is produced by the brain, and how it can be replicated in machines. Discusses an array of current research connected through an overarching theme of how it contributes to a computational account of how humans analyze dynamic visual imagery to understand objects and actions in the world.",
    "instructors" : "T. Poggio, S. Ullman, E. Hildreth"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.123",
    "academicYear" : "2016",
    "title" : "Neurotechnology in Action",
    "cluster" : "(Same subject as 20.203J)",
    "prerequisites" : "Permission of instructors",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "Offers a fast-paced introduction to numerous laboratory methods at the forefront of modern neurobiology. Comprises a sequence of modules focusing on neurotechnologies that are developed and used by MIT research groups. Each module consists of a background lecture and 1-2 days of firsthand laboratory experience. Topics typically include optical imaging, optogenetics, high throughput neurobiology, MRI/fMRI, advanced electrophysiology, viral and genetic tools, and connectomics.",
    "instructors" : "A. Jasanoff, E. Boyden, M. Jonas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "9.583",
    "academicYear" : "2016",
    "title" : "Functional Magnetic Resonance Imaging: Data Acquisition and Analysis",
    "cluster" : "(Same subject as HST.583J)",
    "prerequisites" : "18.05; 18.06 or permission of instructor",
    "units" : "2-3-7",
    "optional" : null,
    "description" : "See description under subject HST.583J.",
    "instructors" : "S. Whitfield-Gabrieli, J. Polimeni, A. Yendiki"
  } ]
}