{
  "metadata" : {
    "size" : "116"
  },
  "items" : [ {
    "termCode" : "2016FA",
    "subjectId" : "3.053",
    "academicYear" : "2016",
    "title" : "Molecular, Cellular, and Tissue Biomechanics",
    "cluster" : "(Same subject as 2.797J, 6.024J, 20.310J)",
    "prerequisites" : "2.370 or 2.772J; 18.03 or 3.016; Biology (GIR)",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 20.310J.",
    "instructors" : "M. Bathe, A. J. Grodzinsky"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.35",
    "academicYear" : "2016",
    "title" : "Fracture and Fatigue",
    "cluster" : null,
    "prerequisites" : "3.032, permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Linear elastic and elastic-plastic fracture mechanics. Theory and asymptotic analysis of crack-tip fields. Experimental methods. Microstructural effects on fracture in metals, ceramics, polymers, thin films, biological materials, and composites. Toughening mechanisms. Crack growth resistance and creep fracture. Interface fracture mechanics. Fatigue damage and dislocation substructures in single crystals. Stress- and strain-life approach to fatigue. Fatigue crack growth models and mechanisms. Variable amplitude fatigue. Corrosion fatigue. Case studies of fracture and fatigue in structural, bioimplant, and microelectronic components. Limited to 10.",
    "instructors" : "M. Dao"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.UR",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.URG",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Extended participation in work of a research group. Independent study of literature, direct involvement in group's research (commensurate with student skills), and project work under an individual faculty member. See UROP coordinator for registration procedures.",
    "instructors" : "Information: DMSE Academic Office"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.THU",
    "academicYear" : "2016",
    "title" : "Undergraduate Thesis",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of an SB thesis; to be arranged by the student and an appropriate MIT faculty member. Instruction and practice in oral and written communication.",
    "instructors" : "Information: DMSE Academic Office"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.EPW",
    "academicYear" : "2016",
    "title" : "UPOP Engineering Practice Workshop",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.EPW, 2.EPW, 3.EPW, 6.EPW, 10.EPW, 16.EPW, 20.EPW, 22.EPW)",
    "prerequisites" : "None",
    "units" : "1-0-0 [P/D/F]",
    "optional" : null,
    "description" : "See description under subject 2.EPW.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.EPE",
    "academicYear" : "2016",
    "title" : "UPOP Engineering Practice Experience",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.EPE, 2.EPE, 3.EPE, 6.EPE, 10.EPE, 16.EPE, 22.EPE)",
    "prerequisites" : "2.EPW or permission of instructor",
    "units" : "0-0-1 [P/D/F]",
    "optional" : null,
    "description" : "See description under subject 2.EPE.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.037",
    "academicYear" : "2016",
    "title" : "Problems in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.04",
    "academicYear" : "2016",
    "title" : "Problems in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "For undergraduates desiring to carry on projects of their own choosing, which may be experimental, theoretical, or of a design nature. Also for undergraduate studies arranged by students or staff, which may consist of seminars, assigned reading, or laboratory projects. See UROP Coordinator for registration procedures.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.052",
    "academicYear" : "2016",
    "title" : "Nanomechanics of Materials and Biomaterials",
    "cluster" : null,
    "prerequisites" : "3.032 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Latest scientific developments and discoveries in the field of nanomechanics, i.e. the deformation of extremely tiny (10-9 meters) areas of synthetic and biological materials. Lectures include a description of normal and lateral forces at the atomic scale, atomistic aspects of adhesion, nanoindentation, molecular details of fracture, chemical force microscopy, elasticity of individual macromolecular chains, intermolecular interactions in polymers, dynamic force spectroscopy, biomolecular bond strength measurements, and molecular motors.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.063",
    "academicYear" : "2016",
    "title" : "Polymer Physics",
    "cluster" : "(Subject meets with 3.942)",
    "prerequisites" : "3.012",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "The mechanical, optical, electrical, and transport properties of polymers and other types of \"soft matter\" are presented with respect to the underlying physics and physical chemistry of polymers and colloids in solution, and solid states. Topics include how enthalpy and entropy determine conformation, molecular dimensions and packing of polymer chains and colloids and supramolecular materials. Examination of the structure of glassy, crystalline, and rubbery elastic states of polymers; thermodynamics of solutions, blends, crystallization; liquid crystallinity, microphase separation, and self-assembled organic-inorganic nanocomposites. Case studies of relationships between structure and function in technologically important polymeric systems. Students taking graduate version complete additional assignments.",
    "instructors" : "A. Alexander-Katz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.064",
    "academicYear" : "2016",
    "title" : "Polymer Engineering",
    "cluster" : null,
    "prerequisites" : "3.032, 3.044",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Overview of engineering analysis and design techniques for synthetic polymers. Treatment of materials properties selection, mechanical characterization, and processing in design of load-bearing and environment-compatible structures.",
    "instructors" : "N. Holten-Andersen"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.07",
    "academicYear" : "2016",
    "title" : "Introduction to Ceramics",
    "cluster" : null,
    "prerequisites" : "3.012",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Discusses structure-property relationships in ceramic materials. Includes hierarchy of structures from the atomic to microstructural levels. Defects and transport, solid-state electrochemical processes, phase equilibria, fracture and phase transformations are discussed in the context of controlling properties for various applications of ceramics. Numerous examples from current technology.",
    "instructors" : "Y. Chiang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.091",
    "academicYear" : "2016",
    "title" : "Introduction to Solid-State Chemistry",
    "cluster" : "(Subject meets with ES.3091)",
    "prerequisites" : "None",
    "units" : "5-0-7 CHEMISTRY",
    "optional" : "Credit cannot also be received for 5.111, 5.112, CC.5111, ES.5111, ES.5112",
    "description" : "Basic principles of chemistry and their application to engineering systems. The relationship between electronic structure, chemical bonding, and atomic order. Characterization of atomic arrangements in crystalline and amorphous solids: metals, ceramics, semiconductors, and polymers (including proteins). Topical coverage of organic chemistry, solution chemistry, acid-base equilibria, electrochemistry, biochemistry, chemical kinetics, diffusion, and phase diagrams. Examples from industrial practice (including the environmental impact of chemical processes), from energy generation and storage (e.g., batteries and fuel cells), and from emerging technologies  (e.g., photonic and biomedical devices).",
    "instructors" : "Fall: J. Grossman<br>Spring: N. Holten-Andersen, R. Macfarlane, D. Paul"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.094",
    "academicYear" : "2016",
    "title" : "Materials in Human Experience",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-3-4 HASS-S",
    "optional" : null,
    "description" : "Examines the ways in which people in ancient and contemporary societies have selected, evaluated, and used materials of nature, transforming them to objects of material culture. Some examples: glass in ancient Egypt and Rome; sounds and colors of powerful metals in Mesoamerica; cloth and fiber technologies in the Inca empire. Explores ideological and aesthetic criteria often influential in materials development. Laboratory/workshop sessions provide hands-on experience with materials discussed in class. Subject complements 3.091. Enrollment may be limited.",
    "instructors" : "H. N. Lechtman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.14",
    "academicYear" : "2016",
    "title" : "Physical Metallurgy",
    "cluster" : "(Subject meets with 3.40J, 22.71J)",
    "prerequisites" : "3.022, 3.032",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on the links between the processing, structure, and properties of metals and alloys. First, the physical bases for strength, stiffness, and ductility are discussed with reference to crystallography, defects, and microstructure.  Second, phase transformations and microstructural evolution are studied in the context of alloy thermodynamics and kinetics. Together, these components comprise the modern paradigm for designing metallic microstructures for optimized properties. Concludes with a focus on processing/microstructure/property relationships in structural engineering alloys, particularly steels and aluminum alloys. Students taking the graduate version explore the subject in greater depth.",
    "instructors" : "J. Li"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.15",
    "academicYear" : "2016",
    "title" : "Electrical, Optical, and Magnetic Materials and Devices",
    "cluster" : null,
    "prerequisites" : "3.024",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Explores the relationships between the performance of electrical, optical, and magnetic devices and the microstructural characteristics of the materials from which they are constructed. Features a device-motivated approach that places strong emphasis on emerging technologies.  Applications include diodes, transistors, photodetectors, solar cells (photovoltaics), displays, light emitting diodes, lasers, optical fibers and optical communications, photonic devices, magnetic data storage and spintronics.",
    "instructors" : "C. A. Ross"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.155",
    "academicYear" : "2016",
    "title" : "Micro/Nano Processing Technology",
    "cluster" : "(Same subject as 6.152J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-4-5",
    "optional" : null,
    "description" : "See description under subject 6.152J.",
    "instructors" : "L. A. Kolodziejski, J. Michel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.THG",
    "academicYear" : "2016",
    "title" : "Graduate Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of an SM, PhD, or ScD thesis; to be arranged by the student and an appropriate MIT faculty member.",
    "instructors" : "D. Sadoway"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.20",
    "academicYear" : "2016",
    "title" : "Materials at Equilibrium",
    "cluster" : null,
    "prerequisites" : "3.012, 3.014, 3.022, 3.024, 3.034, and 3.042; or permission of instructor",
    "units" : "5-0-10",
    "optional" : null,
    "description" : "Laws of thermodynamics: general formulation and applications to mechanical, electromagnetic and electrochemical systems, solutions, and phase diagrams. Computation of phase diagrams. Statistical thermodynamics and relation between microscopic and macroscopic properties, including ensembles, gases, crystal lattices, phase transitions.  Applications to phase stability and properties of mixtures.  Representations of chemical equilibria. Interfaces.",
    "instructors" : "A. Allanore"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.207",
    "academicYear" : "2016",
    "title" : "Innovation and Commercialization",
    "cluster" : "(Subject meets with 3.086)",
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Explores in depth projects on a particular materials-based technology. Investigates the science and technology of materials advances and their strategic value, explore potential applications for fundamental advances, and determine intellectual property related to the materials technology and applications. Students map progress with presentations, and are expected to create an end-of-term document enveloping technology, intellectual property, applications, and potential commercialization. Lectures cover aspects of technology, innovation, entrepreneurship, intellectual property, and commercialization of fundamental technologies.",
    "instructors" : "E. Fitzgerald"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.21",
    "academicYear" : "2016",
    "title" : "Kinetic Processes in Materials",
    "cluster" : null,
    "prerequisites" : "3.012, 3.022, 3.044, or permission of instructor",
    "units" : "5-0-10",
    "optional" : null,
    "description" : "Unified treatment of phenomenological and atomistic kinetic processes in materials. Provides the foundation for the advanced understanding of processing, microstructural evolution, and behavior for a broad spectrum of materials. Emphasis on analysis and development of rigorous comprehension of fundamentals. Topics include: irreversible thermodynamics; diffusion; nucleation; capillarity; grain growth; phase transformations;  and morphological instabilities; gas-solid, liquid-solid, and solid-solid reactions.",
    "instructors" : "C. Thompson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.22",
    "academicYear" : "2016",
    "title" : "Mechanical Behavior of Materials",
    "cluster" : null,
    "prerequisites" : "3.032",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Explores how the macroscale mechanical behavior of materials originates from fundamental, microscale mechanisms of elastic and inelastic deformation. Topics include: elasticity, viscoelasticity, plasticity, creep, fracture, and fatigue. Case studies and examples  are drawn from a variety of material classes: metals, ceramics, polymers, thin films, composites, and cellular materials.",
    "instructors" : "C. Tasan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.23",
    "academicYear" : "2016",
    "title" : "Electrical, Optical, and Magnetic Properties of Materials",
    "cluster" : null,
    "prerequisites" : "8.03, 18.03",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Origin of electrical, magnetic and optical properties of materials. Focus on the acquisition of quantum mechanical tools. Analysis of the properties of materials. Presentation of the postulates of quantum mechanics. Examination of the hydrogen atom, simple molecules and bonds, and the behavior of electrons in solids and energy bands. Introduction of the variation principle as a method for the calculation of wavefunctions. Investigation of how and why materials respond to different electrical, magnetic and electromagnetic fields and probes. Study of the conductivity, dielectric function, and magnetic permeability in metals, semiconductors, and insulators. Survey of common devices such as transistors, magnetic storage media, optical fibers.",
    "instructors" : "G. Beach"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.320",
    "academicYear" : "2016",
    "title" : "Atomistic Computer Modeling of Materials",
    "cluster" : null,
    "prerequisites" : "3.022, 3.20, 3.23 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Theory and application of atomistic computer simulations to model, understand, and predict the properties of real materials.  Energy models: from classical potentials to first-principles approaches.  Density-functional theory and the total-energy pseudopotential method.  Errors and accuracy of quantitative predictions.  Thermodynamic ensembles: Monte Carlo sampling and molecular dynamics simulations.  Free energies and phase transitions.  Fluctations and transport properties.  Coarse-graining approaches and mesoscale models.",
    "instructors" : "J. Grossman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.371",
    "academicYear" : "2016",
    "title" : "Selection and Processing of Structural Materials",
    "cluster" : "(Same subject as 2.821J)\n(Subject meets with 3.S171)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Discusses selection design and processing for structural materials, including casting, forging, rolling, drawing, extrusion, powder consolidation, welding, brazing, soldering, wear, corrosion, non-destructive testing and fracture. Emphasizes the underlying science of a given process rather than a detailed description of the technique or equipment. Presented in modules; repeatable for credit one time with permission of instructor, provided three different modules are selected the second term.",
    "instructors" : "T. Eagar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.40",
    "academicYear" : "2016",
    "title" : "Modern Physical Metallurgy",
    "cluster" : "(Same subject as 22.71J)\n(Subject meets with 3.14)",
    "prerequisites" : "3.022, 3.032",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines how the presence of 1-, 2- and 3-D defects and second phases control the mechanical, electromagnetic and chemical behavior of metals and alloys. Considers point, line and interfacial defects in the context of structural transformations including annealing, spinodal decomposition, nucleation, growth, and particle coarsening. Concentrates on structure-function relationships, and in particular how grain size, interstitial and substitutional solid solutions, and second-phase particles impact mechanical and other properties  Industrially relevant case studies illustrate lecture concepts. Students taking the graduate version explore the subject in greater depth.",
    "instructors" : "J. Li"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.42",
    "academicYear" : "2016",
    "title" : "Electronic Materials Design",
    "cluster" : null,
    "prerequisites" : "3.23",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Extensive and intensive examination of structure-processing-property correlations for a wide range of materials including metals, semiconductors, dielectrics, and optical materials.  Topics covered include defect equilibria; junction characteristics; photodiodes, light sources and displays; bipolar and field effect transistors; chemical, thermal and mechanical transducers; data storage.  Emphasis on materials design in relation to device performance.",
    "instructors" : "H. L. Tuller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.43",
    "academicYear" : "2016",
    "title" : "Integrated Microelectronic Devices",
    "cluster" : "(Same subject as 6.720J)",
    "prerequisites" : "6.012 or 3.42",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 6.720J.",
    "instructors" : "D. A. Antoniadis, J. A. del Alamo, H. L. Tuller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.44",
    "academicYear" : "2016",
    "title" : "Materials Processing for Micro- and Nano-Systems",
    "cluster" : null,
    "prerequisites" : "3.20, 3.21",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Processing of bulk, thin film, and nanoscale materials for applications in electronic, magnetic, electromechanical, and photonic devices and microsystems. Topics include growth of bulk, thin-film, nanoscale single crystals via vapor and liquid phase processes; formation, patterning and processing of thin films, with an emphasis on relationships among processing, structure, and properties; and processing of systems of nanoscale materials. Examples from materials processing for applications in high-performance integrated electronic circuits, integrated sensors, and data storage systems.",
    "instructors" : "C. V. Thompson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.45",
    "academicYear" : "2016",
    "title" : "Magnetic Materials",
    "cluster" : "(Subject meets with 3.152)",
    "prerequisites" : "3.23",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Foundation topics include magnetostatics, origin of magnetism in materials, magnetic domains and domain walls, magnetic anisotropy, reversible and irreversible magnetization processes; hard and soft magnetic materials and magnetic recording. Special topics are selected from magnetism at nanoscale (thin films, surfaces, particles); amorphous and nanocrystalline magnetic materials; electronic transport in ferromagnets including magnetoresistive, spin-valve and spin-tunnel junction sensors.",
    "instructors" : "C. Ross"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.46",
    "academicYear" : "2016",
    "title" : "Photonic Materials and Devices",
    "cluster" : "(Subject meets with 3.156)",
    "prerequisites" : "3.23",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Optical materials design for semiconductors, dielectrics and polymers. Ray optics, electromagnetic optics and guided wave optics. Physics of light-matter interactions.  Device design principles: LEDs, lasers, photodetectors, modulators, fiber and waveguide interconnects, optical filters, and photonic crystals. Device processing:  crystal growth, substrate engineering, thin film deposition, etching and process integration for dielectric, silicon and compound semiconductor materials. Microphotonic integrated circuits.  Telecom/datacom systems. Assignments include three design projects that emphasize materials, devices and systems applications. Students taking graduate version complete additional assignments.",
    "instructors" : "P. Anikeeva"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.53",
    "academicYear" : "2016",
    "title" : "Electrochemical Processing of Materials",
    "cluster" : null,
    "prerequisites" : "3.044",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Thermodynamic and transport properties of aqueous and nonaqueous electrolytes. The electrode/electrolyte interface. Kinetics of electrode processes. Electrochemical characterization: d.c. techniques (controlled potential, controlled current), a.c. techniques (voltametry and impedance spectroscopy). Applications: electrowinning, electrorefining, electroplating, and electrosynthesis, as well as electrochemical power sources (batteries and fuel cells).",
    "instructors" : "D. R. Sadoway"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.54",
    "academicYear" : "2016",
    "title" : "Corrosion: The Environmental Degradation of Materials",
    "cluster" : "(Same subject as 22.72J)",
    "prerequisites" : "3.012",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Applies thermodynamics and kinetics of electrode reactions to aqueous corrosion of metals and alloys. Application of advanced computational and modeling techniques to evaluation of materials selection and susceptibility of metal/alloy systems to environmental degradation in aqueous systems. Discusses materials degradation problems in marine environments, oil and gas production, and energy conversion and generation systems, including fossil and nuclear.",
    "instructors" : "R. G. Ballinger"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.60",
    "academicYear" : "2016",
    "title" : "Symmetry, Structure, and Tensor Properties of Materials",
    "cluster" : "(Subject meets with 3.072)",
    "prerequisites" : "3.016 or 18.03",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Addresses the structure of crystalline materials and the role of crystal symmetries in controlling their properties. Topics include lattices, point groups, space groups, and their properties; use of symmetry in tensor representation of crystal properties, including transport properties, piezoelectricity and elasticity; crystallographic texture, microstructure, and anisotropy; and design of microstructures comprising anisotropic crystals. Students taking graduate version complete additional assignments.",
    "instructors" : "E. Fitzgerald"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.699",
    "academicYear" : "2016",
    "title" : "Teaching Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory, tutorial, or classroom teaching under the supervision of a faculty member. Students selected by interview. Enrollment limited by availability of suitable teaching assignments.",
    "instructors" : "D. Sadoway"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.903",
    "academicYear" : "2016",
    "title" : "Seminar in Polymers and Soft Matter",
    "cluster" : "(Same subject as 10.960J)",
    "prerequisites" : "None",
    "units" : "2-0-0 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 10.960J.",
    "instructors" : "A. Alexander-Katz, R. E. Cohen, D. Irvine"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.91",
    "academicYear" : "2016",
    "title" : "Mechanical Behavior of Polymers",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Influence of processing and structure on mechanical properties of synthetic and natural polymers: Hookean and entropic elastic deformation,  linear viscoelasticity,  composite materials and laminates, yield and fracture. Introductory subjects in solid mechanics and polymers recommended, e.g. 3.032, 3.034.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.930",
    "academicYear" : "2016",
    "title" : "Internship Program",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "0-6-0 [P/D/F]",
    "optional" : null,
    "description" : "Provides academic credit for first approved materials science and engineering internship. For reporting requirements, consult the faculty internship program coordinator. Limited to Course 3 internship track majors.",
    "instructors" : "T. Eagar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.931",
    "academicYear" : "2016",
    "title" : "Internship Program",
    "cluster" : null,
    "prerequisites" : "3.930",
    "units" : "0-6-0",
    "optional" : null,
    "description" : "Provides academic credit for second approved materials science and engineering internship in the year following completion of 3.930. For reporting requirements consult the faculty internship program coordinator. Limited to Course 3 internship track majors.",
    "instructors" : "T. Eagar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.932",
    "academicYear" : "2016",
    "title" : "Industrial Practice",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Provides academic credit for graduate students for approved work assignments at companies.",
    "instructors" : "D. Sadoway"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.94",
    "academicYear" : "2016",
    "title" : "Morphology of Polymers",
    "cluster" : null,
    "prerequisites" : "3.063",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Structure of noncrystalline, crystalline, and liquid crystalline polymers, including polymers blends, and block copolymers. Texture development from processing operations, mechanical deformation, and applied electric and magnetic fields. Hybrid organic-inorganic nano and microcomposites. Phase transformations, including classical nucleation theory and spinodal decomposition. Use of morphological characterization methods such as wide- and small-angle x-ray scattering and scanning, transmission electron microscopy and atomic force microscopy are also covered.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.941",
    "academicYear" : "2016",
    "title" : "Statistical Mechanics of Polymers",
    "cluster" : "(Same subject as 10.668J)",
    "prerequisites" : "10.568 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 10.668J.",
    "instructors" : "G. C. Rutledge, A. Alexander-Katz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.961",
    "academicYear" : "2016",
    "title" : "Design of Medical Devices and Implants",
    "cluster" : "(Same subject as 2.782J, 20.451J, HST.524J)",
    "prerequisites" : "Chemistry (GIR), Biology (GIR), Physics I (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.782J.",
    "instructors" : "I. V. Yannas, M. Spector"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.97",
    "academicYear" : "2016",
    "title" : "Cell-Matrix Mechanics",
    "cluster" : "(Same subject as 2.785J, 20.411J, HST.523J)",
    "prerequisites" : "2.001, or 2.01 and 2.02A; Chemistry (GIR), Biology (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.785J.",
    "instructors" : "I. V. Yannas, M. Spector"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.98",
    "academicYear" : "2016",
    "title" : "Polymer Synthetic Chemistry",
    "cluster" : null,
    "prerequisites" : "One basic polymer chemistry subject",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "An examination of the fundamental reaction mechanisms and chemistry of polymerization reactions with an emphasis on the synthesis of new advanced polymers and their properties.",
    "instructors" : "M. F. Rubner"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.982",
    "academicYear" : "2016",
    "title" : "The Ancient Andean World",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-6 HASS-S",
    "optional" : null,
    "description" : "Examines development of Andean civilization which culminated in the extraordinary empire established by the Inka. Archaeological, ethnographic, and ethnohistorical approaches. Particular attention to the unusual topography of the Andean area, its influence upon local ecology, and the characteristic social, political, and technological responses of Andean people to life in a topographically \"vertical\" world. Characteristic cultural styles of prehistoric Andean life.",
    "instructors" : "H. N. Lechtman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.983",
    "academicYear" : "2016",
    "title" : "Ancient Mesoamerican Civilization",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-6 HASS-S",
    "optional" : null,
    "description" : "Examines origins, florescence and collapse of selected  civilizations of ancient Mesoamerica using archaeological and ethnohistorical evidence. Focus on Olmec, Maya, Teotihuacan and Aztec, considering key technological, environmental, social organizational and ideological variables. Investigates contacts between South America and Western Mexico. Limited to 10.",
    "instructors" : "D. Hosler"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.984",
    "academicYear" : "2016",
    "title" : "Materials in Ancient Societies: Ceramics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "Seminars and labs provide in-depth study of the technologies ancient societies used to produce objects from ceramic materials, including clays and mortars.  Seminars cover basic ceramic materials science and engineering and relate materials selection and processing to environment, exchange, political power, and cultural values.",
    "instructors" : "H. N. Lechtman, J. Meanwell"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.985",
    "academicYear" : "2016",
    "title" : "Archaeological Science",
    "cluster" : "(Same subject as 5.24J, 12.011J)",
    "prerequisites" : "Chemistry (GIR) or Physics I (GIR)",
    "units" : "3-1-5 HASS-S",
    "optional" : null,
    "description" : "Pressing issues in archaeology as an anthropological science. Stresses the natural science and engineering methods archaeologists use to address these issues. Reconstructing time, space, and human ecologies provides one focus; materials technologies that transform natural materials to material culture provide another. Topics include 14C dating, ice core and palynological analysis, GIS and other remote sensing techniques for site location, soil micromorphology and site formation, sourcing of metal artifacts, and microstructural and mechanical analyses of cementitious materials used in ancient monumental buildings.",
    "instructors" : "H. N. Lechtman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.986",
    "academicYear" : "2016",
    "title" : "The Human Past: Introduction to Archaeology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S; CI-H",
    "optional" : null,
    "description" : "Archaeology reconstructs ancient human activities and their environmental contexts. Examines these activities and the forces that shaped them, drawing on case studies in contrasting environmental settings from the Andes and Mesoamerica. Exposes students to various classes of archaeological data, such as stone, bone, and ceramics, that help reconstruct the past.",
    "instructors" : "K. Grossman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.987",
    "academicYear" : "2016",
    "title" : "Human Evolution: Data from Palaeontology, Archaeology, and Materials Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-6-3 HASS-S",
    "optional" : null,
    "description" : "Examines human physical and cultural evolution over the past five million years via lectures and labs that incorporate data from human palaeontology, archaeology, and materials science. Topics include the evolution of hominin morphology and adaptations; the nature and structure of bone and its importance in human evolution; and the fossil and archaeological evidence for human behavioral and cultural evolution, from earliest times through the Pleistocene. Laboratory sessions include study of stone technology, artifacts, and fossil specimens.",
    "instructors" : "K. Grossman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.989",
    "academicYear" : "2016",
    "title" : "Materials in Ancient Societies: Ceramics Laboratory",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "Laboratory analysis of archaeological artifacts of ceramics. Follows on 3.984.",
    "instructors" : "J. Meanwell"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.990",
    "academicYear" : "2016",
    "title" : "Seminar in Archaeological Method and Theory",
    "cluster" : null,
    "prerequisites" : "3.985, 3.986, 21A.00",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Designed for undergraduate seniors majoring in Archaeology and Materials. Critical analysis of major intellectual and methodological developments in American archaeology, including evolutionary theory, the \"New Archaeology,\" Marxism, formal and ideological approaches. Explores the use of science and engineering methods to reconstruct cultural patterns from archaeological data. Seminar format, with formal presentations by all students. Non-majors fulfilling all prerequisites may enroll by permission of instructors. Instruction and practice in oral and written communication provided.",
    "instructors" : "D. Hosler, H. Lechtman, H. Merrick"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.993",
    "academicYear" : "2016",
    "title" : "Archaeology of the Middle East",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-6 HASS-S",
    "optional" : null,
    "description" : "Focus on the rise of settled communities, cities, and empires and their technological achievements in various areas of the Middle East including Anatolia, the Levant, and Mesopotamia. Using archaeological and written sources, examines why such complex societies arose in this area. Considers the technological basis of these societies; the role of temples and religious hierarchies, of crafts and trade in luxury goods, of writing and bureaucracies, and of class stratification in the rise of early civilizations.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.054",
    "academicYear" : "2016",
    "title" : "Cellular Solids: Structure, Properties, Applications",
    "cluster" : "(Subject meets with 3.36)",
    "prerequisites" : "3.032",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Discusses processing and structure of cellular solids as they are created from polymers, metals, ceramics, glasses, and composites; derivation of models for the mechanical properties of honeycombs and foams; and how unique properties of honeycombs and foams are exploited in applications such as lightweight structural panels, energy absorption devices, and thermal insulation. Covers applications of cellular solids in medicine, such as increased fracture risk due to trabecular bone loss in patients with osteoporosis, the development of metal foam coatings for orthopedic implants, and designing porous scaffolds for tissue engineering that mimic the extracellular matrix. Includes modelling of cellular materials applied to natural materials and biomimicking. Students taking graduate version complete additional assignments.",
    "instructors" : "L. Gibson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.086",
    "academicYear" : "2016",
    "title" : "Innovation and Commercialization of Materials Technology",
    "cluster" : "(Subject meets with 3.207)",
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Covers the fundamental process of innovation through its implications on organizations and innovation ecosystems. Emphasizes historical and modern examples of innovation in materials and devices. Discusses the final implications for innovation ecosystems.",
    "instructors" : "E. Fitzgerald"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.035",
    "academicYear" : "2016",
    "title" : "Problems in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.691",
    "academicYear" : "2016",
    "title" : "Teaching Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "0-1-0 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Provides classroom or laboratory teaching experience under the supervision of faculty member(s). Students assist faculty by preparing instructional materials, leading discussion groups, and monitoring students' progress. Limited to Course 3 undergraduates selected by Teaching Assignments Committee.",
    "instructors" : "G. Beach"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.692",
    "academicYear" : "2016",
    "title" : "Teaching Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Provides classroom or laboratory teaching experience under the supervision of faculty member(s). Students assist faculty by preparing instructional materials, leading discussion groups, and monitoring students' progress. Credit arranged on a case-by-case basis and reviewed by the department. Limited to Course 3 undergraduates selected by Teaching Assignments Committee.",
    "instructors" : "G. Beach"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.004",
    "academicYear" : "2016",
    "title" : "Principles of Engineering Practice",
    "cluster" : "(Subject meets with 3.003)",
    "prerequisites" : "Physics I (GIR),Calculus I (GIR)",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Introduces students to the interdisciplinary nature of 21st-century engineering projects with three threads of learning: a technical toolkit, a social science toolkit, and a methodology for problem-based learning. Students encounter the social, political, economic and technological challenges of engineering practice via case studies and participation in engineering projects. Includes a six-stage term project in which student teams develop solutions through exercises in project planning, analysis, design, optimization, demonstration, reporting, and team building.",
    "instructors" : "L. Kimerling"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.942",
    "academicYear" : "2016",
    "title" : "Polymer Physics",
    "cluster" : "(Subject meets with 3.063)",
    "prerequisites" : "3.032 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "The mechanical, optical, electrical, and transport properties of polymers and other types of \"soft matter\" are presented with respect to the underlying physics and physical chemistry of polymers and colloids in solution, and solid states. Topics include how enthalpy and entropy determine conformation, molecular dimensions and packing of polymer chains and colloids and supramolecular materials. Examination of the structure of glassy, crystalline, and rubbery elastic states of polymers; thermodynamics of solutions, blends, crystallization; liquid crystallinity, microphase separation, and self-assembled organic-inorganic nanocomposites. Case studies of relationships between structure and function in technologically important polymeric systems. Students taking graduate version complete additional assignments.",
    "instructors" : "A. Alexander-Katz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.012",
    "academicYear" : "2016",
    "title" : "Fundamentals of Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "None. <I>Coreq: 18.03, 18.034, or 3.016</I>",
    "units" : "5-0-10 REST",
    "optional" : null,
    "description" : "Describes the fundamentals of structure and energetics that underpin materials science. Introduction to thermodynamic functions and laws governing equilibrium properties, relating macroscopic behavior to atomistic and molecular models of materials. Materials phenomena, such as heat capacities, phase transformations, multiphase equilibria, chemical reactions, and magnetism. Structure of noncrystalline, crystalline, and liquid-crystalline states. Symmetry and tensor properties of materials. Point, line, and surface imperfections in materials. Diffraction and structure determination. Real-world examples such as materials for fuel cells and batteries, engineered alloys, electronic and magnetic materials, ionic and network solids, polymers, and biomaterials.",
    "instructors" : "S. Grade&#269;ak, R. Jaramillo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.014",
    "academicYear" : "2016",
    "title" : "Materials Laboratory",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-4-7 Institute LAB",
    "optional" : null,
    "description" : "Experimental exploration of the connections between energetics, bonding and structure of materials, and application of these principles in instruments for materials characterization.  Demonstration of the wave-like nature of electrons.  Hands-on experience with techniques to quantify energy (DSC), bonding (XPS, AES, FTIR, UV/vis and force spectroscopy), and degree of order (x-ray scattering) in condensed matter. Investigation of structural transitions and structure-property relationships through practical materials examples. Practice in oral and written technical communication. It is strongly recommended that 3.012 and 3.014 are taken simultaneously.",
    "instructors" : "L. Kimerling, D. Sadoway"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.016",
    "academicYear" : "2016",
    "title" : "Mathematical Methods for Materials Scientists and Engineers",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR)",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Mathematical techniques necessary for materials science and  engineering topics such as energetics, materials structure and symmetry, materials response to applied fields, mechanics and physics of solids and soft materials. Mathematical concepts and materials-related problemsolving skills. Symbolic algebraic computational methods, programming, and visualization techniques. Topics include linear algebra, quadratic forms, tensor operations, symmetry operations, calculus of several variables, eigensystems, introduction to complex analysis, systems of ordinary and partial differential equations, phase plane analysis, beam theory,  resonance phenomena, special functions, numerical solutions,  statistical analysis, Fourier analysis, and random walks.",
    "instructors" : "W. C. Carter"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.022",
    "academicYear" : "2016",
    "title" : "Microstructural Evolution in Materials",
    "cluster" : null,
    "prerequisites" : "3.012",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Covers microstructures, defects, and structural evolution in all classes of materials. Topics include solution kinetics, interface stability, dislocations and point defects, diffusion, surface energetics, grains and grain boundaries, grain growth, nucleation and precipitation, and electrochemical reactions. Lectures illustrate a range of examples and applications based on metals, ceramics, electronic materials, polymers, and biomedical materials. Explores the evolution of microstructure through experiments involving optical and electron microscopy, calorimetry, electrochemical characterization, surface roughness measurements, and other characterization methods. Investigates structural transitions and structure-property relationships through practical materials examples.",
    "instructors" : "J. Hu, G. Beach, Y. Chiang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.024",
    "academicYear" : "2016",
    "title" : "Electronic, Optical and Magnetic Properties of Materials",
    "cluster" : null,
    "prerequisites" : "3.012",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Uses fundamental principles of quantum mechanics, solid state physics, electricity and magnetism to describe how the electronic, optical and magnetic properties of materials originate. Illustrates how these properties can be designed for particular applications, such as diodes, solar cells, optical fibers, and magnetic data storage. Involves experimentation using spectroscopy, resistivity, impedance and magnetometry measurements, behavior of light in waveguides, and other characterization methods. Uses practical examples to investigate structure-property relationships.",
    "instructors" : "P. Anikeeva, G. Beach, Y. Chiang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.153",
    "academicYear" : "2016",
    "title" : "Nanoscale Materials",
    "cluster" : null,
    "prerequisites" : "3.024",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Builds on concepts from quantum mechanics and electromagnetics to develop an understanding of the properties of materials on the nanoscale. Illustrates the promise and challenges facing the field through case studies and the survey of fabrication methods.",
    "instructors" : "Y. Fink"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.046",
    "academicYear" : "2016",
    "title" : "Thermodynamics of Materials",
    "cluster" : null,
    "prerequisites" : "18.03, 18.034, or 3.016",
    "units" : "4-0-8 REST",
    "optional" : null,
    "description" : "The laws of thermodynamics and their application to equilibrium and the properties of materials. Foundation to treat general phenomena in materials science and engineering, including chemical reactions, magnetism, polarizability, and elasticity. Relations pertaining to multiphase equilibria as determined by a treatment of solution thermodynamics. Graphical constructions that are essential for the interpretation of phase diagrams. Electrochemical equilibria and surface thermodynamics. Aspects of statistical thermodynamics as they relate to macroscopic equilibrium phenomena.",
    "instructors" : "R. Jaramillo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.032",
    "academicYear" : "2016",
    "title" : "Mechanical Behavior of Materials",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR); 3.016 or 18.03",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Basic concepts of solid mechanics and mechanical behavior of materials, stress-strain relationships, stress transformation, elasticity, plasticity and fracture. Case studies include materials selection for bicycle frames, stress shielding in biomedical implants; residual stresses in thin films; and ancient materials. Lab experiments and demonstrations give hands-on experience of the physical concepts at a variety of length scales. Use of facilities for measuring mechanical properties including standard mechanical tests, bubble raft models, atomic force microscopy and nanoindentation.",
    "instructors" : "L. Gibson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.034",
    "academicYear" : "2016",
    "title" : "Organic and Biomaterials Chemistry",
    "cluster" : null,
    "prerequisites" : "3.012",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Focuses on the chemistry and chemical structure-property relationships of soft synthetic and biologically derived materials. Topics include methods for preparing synthetic polymers by step and chain growth polymerizations; polymerization reaction kinetics; chemistry of proteins, nucleic acids, polysaccharides and lipids, and their incorporation into biomaterials and biosensors; enzymatic reactions and ligations; chemical modification and patterning of organic and inorganic surfaces using organosilane and self-assembled monolayer chemistries, radiation grafting, physisorption and microcontact printing; organic systems as templates for inorganic materials; sol gel syntheses, polymer precursor conversions, polymer vesicle naroreactors; chemical degradation of soft materials through readition, hydrolysis, and thermolysis; electroactive organic materials. Firsthand application of lecture topics through design-oriented experiments.",
    "instructors" : "M. F. Rubner"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.042",
    "academicYear" : "2016",
    "title" : "Materials Project Laboratory",
    "cluster" : null,
    "prerequisites" : "3.014, 3.032, or 3.044",
    "units" : "1-6-5",
    "optional" : null,
    "description" : "Student project teams design and fabricate a working prototype using materials processing technologies (e.g. solid works 3-D design software, computer numerical controlled mill, injection molding, thermoforming, investment casting, powder processing, three-dimensional printing, physical vapor deposition) appropriate for the materials and device of interest. Goals include using MSE fundamentals in a practical application; understanding trade-offs between design, processing, and performance and cost; and fabrication of a deliverable prototype. Emphasis on teamwork, project management, communications and computer skills, with extensive hands-on work using student and MIT laboratory shops. Teams document their progress and final results by means of written and oral communication. Limited to 25.",
    "instructors" : "M. Tarkanian"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.044",
    "academicYear" : "2016",
    "title" : "Materials Processing",
    "cluster" : null,
    "prerequisites" : "3.012, 3.022",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to materials processing science, with emphasis on heat transfer, chemical diffusion, and fluid flow. Uses an engineering approach to analyze industrial-scale processes, with the goal of identifying and understanding physical limitations on scale and speed. Covers materials of all classes, including metals, polymers, electronic materials, and ceramics. Considers specific processes, such as melt-processing of metals and polymers, deposition technologies (liquid, vapor, and vacuum), colloid and slurry processing, viscous shape forming, and powder consolidation.",
    "instructors" : "E. Olivetti"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.69",
    "academicYear" : "2016",
    "title" : "Teaching Fellows Seminar",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-1",
    "optional" : "Can be repeated for credit",
    "description" : "Provides instruction to help prepare students for teaching at an advanced level and for industry or academic career paths. Topics include preparing a syllabus, selecting a textbook, scheduling assignments and examinations, lecture preparation, \"chalk and talk\" vs. electronic presentations, academic honesty and discipline, preparation of examinations, grading practices, working with teaching assistants, working with colleagues, mentoring outside the classroom, pursuing academic positions, teaching through technical talks, and successful grant writing strategies.",
    "instructors" : "C. Schuh"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.074",
    "academicYear" : "2016",
    "title" : "Imaging of Materials",
    "cluster" : "(Subject meets with 3.34)",
    "prerequisites" : "3.024",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Principles and applications of imaging techniques for materials characterization including transmission and scanning electron microscopy and scanning probe microscopy. Topics include electron diffraction; image formation in transmission and scanning electron microscopy; diffraction and phase contrast; imaging of crystals and crystal imperfections; review of the most recent advances in electron microscopy for bio- and nanosciences; analysis of chemical composition and electronic structure at the atomic scale. Lectures, real-case studies and computer simulations.",
    "instructors" : "S. Grade&#269;ak"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.34",
    "academicYear" : "2016",
    "title" : "Imaging of Materials",
    "cluster" : "(Subject meets with 3.074)",
    "prerequisites" : "3.23 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Principles and applications of imaging techniques for materials characterization including transmission and scanning electron microscopy and scanning probe microscopy. Topics include electron diffraction; image formation in transmission and scanning electron microscopy; diffraction and phase contrast; imaging of crystals and crystal imperfections; review of the most recent advances in electron microscopy for bio- and nanosciences; analysis of chemical composition and electronic structure at the atomic scale. Lectures, real-case studies and computer simulations. Graduate students complete additional assignments.",
    "instructors" : "S. Grade&#269;ak"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.57",
    "academicYear" : "2016",
    "title" : "Materials Selection, Design, and Economics",
    "cluster" : "(Same subject as ESD.73J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "A survey of techniques for analyzing how the choice of materials, processes, and design determine properties, performance, and cost. Topics include production and cost functions, mathematical optimization, evaluation of single and multi-attribute utility, decision analysis, materials property charts, and performance indices. Students use analytical techniques to develop a plan for starting a new materials-related business.",
    "instructors" : "J. Clark"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.19",
    "academicYear" : "2016",
    "title" : "Sustainable Chemical Metallurgy",
    "cluster" : "(Subject meets with 3.50)",
    "prerequisites" : "3.022",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers principles of metal extraction processes. Provides a direct application of the fundamentals of thermodynamics and kinetics to the industrial production of metals from their ores, e.g., iron, aluminum, or reactive metals and silicon. Discusses the corresponding economics and global challenges. Addresses advanced techniques for sustainable metal extraction, particularly with respect to greenhouse gas emissions. Students taking graduate version complete additional assignments.",
    "instructors" : "A. Allanore"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.003",
    "academicYear" : "2016",
    "title" : "Principles of Engineering Practice",
    "cluster" : "(Subject meets with 3.004)",
    "prerequisites" : "Physics I (GIR), Calculus I (GIR)",
    "units" : "1-2-6",
    "optional" : null,
    "description" : "Introduces students to the interdisciplinary nature of 21st-century engineering projects with three threads of learning: a technical toolkit, a social science toolkit, and a methodology for problem-based learning. Students encounter the social, political, economic, and technological challenges of engineering practice by participating in actual engineering projects involving public transportation and information infrastructure with faculty and industry. Student teams create prototypes and mixed media reports with exercises in project planning, analysis, design, optimization, demonstration, reporting and team building. Preference to freshmen.",
    "instructors" : "L. Kimerling"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.997",
    "academicYear" : "2016",
    "title" : "Graduate Fieldwork in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of field research in materials science and engineering leading to the writing of an SM, PhD, or ScD thesis; to be arranged by the student and an appropriate MIT faculty member.",
    "instructors" : "H. Lechtman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.021",
    "academicYear" : "2016",
    "title" : "Introduction to Modeling and Simulation",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.021, 3.021, 10.333, 22.00)",
    "prerequisites" : "18.03, 3.016, or permission of instructor",
    "units" : "4-0-8 REST",
    "optional" : null,
    "description" : "Basic concepts of computer modeling and simulation in science and engineering. Uses techniques and software for simulation, data analysis and visualization. Continuum, mesoscale, atomistic and quantum methods used to study fundamental and applied problems in physics, chemistry, materials science, mechanics, engineering, and biology. Examples drawn from the disciplines above are used to understand or characterize complex structures and materials, and complement experimental observations.",
    "instructors" : "M. Buehler, R. Taylor"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.971",
    "academicYear" : "2016",
    "title" : "Molecular, Cellular, and Tissue Biomechanics",
    "cluster" : "(Same subject as 2.798J, 6.524J, 10.537J, 20.410J)",
    "prerequisites" : "Biology (GIR); 2.002, 2.006, 6.013, 10.301, or 10.302",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 20.410J.",
    "instructors" : "R. D. Kamm, K. Van Vliet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.96",
    "academicYear" : "2016",
    "title" : "Biomaterials: Tissue Interactions",
    "cluster" : "(Same subject as 2.79J, 20.441J, HST.522J)",
    "prerequisites" : "Chemistry (GIR), Biology (GIR), Physics I (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Principles of materials science and cell biology underlying the development and implementation of biomaterials for the fabrication of medical devices/implants, including artificial organs and matrices for tissue engineering and regenerative medicine. Employs a conceptual model, the \"unit cell process for analysis of the mechanisms underlying wound healing and tissue remodeling following implantation of biomaterials/devices in various organs, including matrix synthesis, degradation, and contraction. Methodology of tissue and organ regeneration. Discusses methods for biomaterials surface characterization and analysis of protein adsorption on biomaterials. Design of implants and prostheses based on control of biomaterials-tissue interactions. Comparative analysis of intact, biodegradable, and bioreplaceable implants by reference to case studies. Criteria for restoration of physiological function for tissues and organs.",
    "instructors" : "I. V. Yannas, M. Spector"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.048",
    "academicYear" : "2016",
    "title" : "Advanced Materials Processing",
    "cluster" : null,
    "prerequisites" : "3.022, 3.044",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Fundamentals of materials processing. Building engineering structures from the atomic- and nano-scales  to macroscopic levels. Case studies illustrating application of processing science to creation of modern metallic, ceramic, polymeric and biomaterials devices and components.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.072",
    "academicYear" : "2016",
    "title" : "Symmetry, Structure and Tensor Properties of Materials",
    "cluster" : "(Subject meets with 3.60)",
    "prerequisites" : "3.016 or 18.03",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Addresses the structure of crystalline materials and the role of crystal symmetries in controlling their properties. Topics include lattices, point groups, space groups, and their properties; use of symmetry in tensor representation of crystal properties, including transport properties, piezoelectricity and elasticity; crystallographic texture, microstructure, and anisotropy; and design of microstructures comprising anisotropic crystals. Students taking graduate version complete additional assignments.",
    "instructors" : "E. Fitzgerald"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.080",
    "academicYear" : "2016",
    "title" : "Economic and Environmental Materials Selection",
    "cluster" : null,
    "prerequisites" : "3.012, 3.014, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides a survey of methods for evaluating choice of material and explores the implications of that choice. Topics include choice of materials, manufacturing economics, and life-cycle environmental evaluation. Students carry out a group project selecting materials technology options based on economic and environmental characteristics.",
    "instructors" : "R. Kirchain"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.41",
    "academicYear" : "2016",
    "title" : "Colloids, Surfaces, Absorption, Capillarity, and Wetting Phenomena",
    "cluster" : null,
    "prerequisites" : "3.20, 3.21",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Integrates elements of physics and chemistry toward the study of material surfaces. Begins with classical colloid phenomena and the interaction between surfaces in different media. Discusses the mechanisms of surface charge generation as well as how dispersion forces are created and controlled. Continues with exploration of chemical absorption processes and surface design of inorganic and organic materials. Includes examples in which such surface design can be used to control critical properties of materials in applications. Addresses lastly how liquids interact with solids as viewed by capillarity and wetting phenomena. Studies how materials are used in processes and applications that are intended to control liquids, and how the surface chemistry and structure of those materials makes such applications possible.",
    "instructors" : "M. Cima"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S79",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "Covers advanced topics in Materials Science and Engineering that are not included in the permanent curriculum.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S75",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : null,
    "description" : "Covers advanced topics in Materials Science and Engineering that are not included in the permanent curriculum.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.055",
    "academicYear" : "2016",
    "title" : "Biomaterials Science and Engineering",
    "cluster" : "(Same subject as 20.363J)\n(Subject meets with 3.963J, 20.463J)",
    "prerequisites" : "3.034, 20.110, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 20.363J.",
    "instructors" : "D. Irvine, K. Ribbeck"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.963",
    "academicYear" : "2016",
    "title" : "Biomaterials Science and Engineering",
    "cluster" : "(Same subject as 20.463J)\n(Subject meets with 3.055J, 20.363J)",
    "prerequisites" : "3.034, 20.110, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 20.463J.",
    "instructors" : "D. Irvine, K. Ribbeck"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.36",
    "academicYear" : "2016",
    "title" : "Cellular Solids: Structure, Properties, Applications",
    "cluster" : "(Subject meets with 3.054)",
    "prerequisites" : "3.032 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Discusses processing and structure of cellular solids as they are created from polymers, metals, ceramics, glasses, and composites; derivation of models for the mechanical properties of honeycombs and foams; and how unique properties of honeycombs and foams are exploited in applications such as lightweight structural panels, energy absorption devices, and thermal insulation. Covers applications of cellular solids in medicine, such as increased fracture risk due to trabecular bone loss in patients with osteoporosis, the development of metal foam coatings for orthopedic implants, and designing porous scaffolds for tissue engineering that mimic the extracellular matrix. Includes modelling of cellular materials applied to natural materials and biomimicking. Students taking graduate version complete additional assignments.",
    "instructors" : "L. Gibson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.33",
    "academicYear" : "2016",
    "title" : "Defects in Materials",
    "cluster" : null,
    "prerequisites" : "3.21, 3.22",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines point, line, and surface defects in materials. Relates their properties to diffusion, deformation, radiation response, phase transformations, microstructure evolution, and corrosion in solids. Focuses on atomic defects in crystals, with special attention to optical properties, dislocation dynamics, and charged defects. Examples also drawn from other systems, e.g., disclinations in liquid crystals, domain walls in ferromagnets, and flaws in periodic network foams. Uses atomistic modeling to examine defect structure.",
    "instructors" : "M. Demkowicz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.70",
    "academicYear" : "2016",
    "title" : "Materials Science and Engineering of Clean Energy",
    "cluster" : "(Subject meets with 3.18)",
    "prerequisites" : "3.20, 3.23, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Develops the materials principles, limitations and challenges in clean energy technologies, including solar, energy storage, thermoelectrics, fuel cells, and novel fuels. Draws correlations between the limitations and challenges related to key figures of merit and the basic underlying thermodynamic, structural, transport, and physical principles, as well as to the means for fabricating devices exhibiting optimum operating efficiencies and extended life at reasonable cost. Students taking graduate version complete additional assignments.",
    "instructors" : "H. Tuller, K. Van Vliet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.152",
    "academicYear" : "2016",
    "title" : "Magnetic Materials",
    "cluster" : "(Subject meets with 3.45)",
    "prerequisites" : "3.024",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Topics include origin of magnetism in materials, magnetic domains and domain walls, magnetostatics, magnetic anisotropy, antiferro- and ferrimagnetism, magnetism in thin films and nanoparticles, magnetotransport phenomena, and magnetic characterization. Discusses a range of applications, including magnetic recording, spin-valves, and tunnel-junction sensors. Assignments include problem sets and a term paper on a magnetic device or technology. Students taking graduate version complete additional assignments.",
    "instructors" : "C. Ross"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.154",
    "academicYear" : "2016",
    "title" : "Materials Performance in Extreme Environments",
    "cluster" : "(Same subject as 22.054J)",
    "prerequisites" : "3.032, 3.044",
    "units" : "3-2-7",
    "optional" : null,
    "description" : "Studies the behavior of materials in extreme environments typical of those in which advanced energy systems (including fossil, nuclear, solar, fuel cells, and battery) operate. Takes both a science and engineering approach to understanding how current materials interact with their environment under extreme conditions. Explores the role of modeling and simulation in understanding material behavior and the design of new materials. Focuses on energy and transportation related systems.",
    "instructors" : "R. Ballinger"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.65",
    "academicYear" : "2016",
    "title" : "Experimental Mechanics of Soft Condensed Matter",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-4-5",
    "optional" : null,
    "description" : "Focuses on the design and execution of advanced experiments to quantify the mechanical behavior of extremely compliant, soft, and/or adhesive materials. These include engineered and natural polymers, cells and tissues, biological composites, and nanocomposites that may exist in bulk, thin-film, or individual fibers. First half of the term includes interactive lectures, demonstrations, and lab practicum sessions in which students gain experience in key experimental aspects of mechanical analysis via instrumented indentation, atomic force microscopy, and other advanced tools. Second half is project-based, where students work in small teams to put class topics in the context of thesis-related research. Includes group lab work, experimental design, and reporting online. Limited to 12.",
    "instructors" : "K. J. Van Vliet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.156",
    "academicYear" : "2016",
    "title" : "Photonic Materials and Devices",
    "cluster" : "(Subject meets with 3.46)",
    "prerequisites" : "3.016 or 18.03; 3.024",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Optical materials design for semiconductors, dielectrics, organic and nanostructured materials. Ray optics, electromagnetic optics and guided wave optics. Physics of light-matter interactions. Device design principles: LEDs, lasers, photodetectors, solar cells, modulators, fiber and waveguide interconnects, optical filters, and photonic crystals. Device processing: crystal growth, substrate engineering, thin film deposition, etching and process integration for dielectric, silicon and compound semiconductor materials. Micro- and nanophotonic systems. Organic, nanostructured and biological optoelectronics. Assignments include three design projects that emphasize materials, devices and systems applications. Students taking graduate version complete additional assignments.",
    "instructors" : "P. Anikeeva"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S04",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S07",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S08",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S01",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.081",
    "academicYear" : "2016",
    "title" : "Industrial Ecology of Materials",
    "cluster" : null,
    "prerequisites" : "3.012, 3.014, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers quantitative techniques to address principles of substitution, dematerialization and waste mining implementation in materials systems. Includes life-cycle and materials flow analysis of the impacts of materials extraction; processing; use; and recycling for materials, products, and services. Student teams undertake a case study regarding materials and technology selection using the latest methods of analysis and computer-based models of materials process.",
    "instructors" : "E. Olivetti"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.981",
    "academicYear" : "2016",
    "title" : "Communities of the Living and the Dead: the Archaeology of Ancient Egypt",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Examines the development of complex societies in Egypt over a 3000-year period. Uses archaeological and historical sources to determine how and why prehistoric communities coalesced into a long-lived and powerful state. Studies the remains of ancient settlements, tombs, and temples, exploring their relationships to one another and to the geopolitical landscape of Egypt and the Mediterranean world. Considers the development of advanced technologies, rise of social hierarchy, expansion of empire, role of writing, and growth of a complex economy.",
    "instructors" : "K. Grossman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.017",
    "academicYear" : "2016",
    "title" : "Modelling, Problem Solving, Computing, and Visualization",
    "cluster" : null,
    "prerequisites" : "3.016, 6.0001, 16.99, or 12.010; 3.014, 3.022, or 3.024; or permission of instructor",
    "units" : "2-2-8",
    "optional" : null,
    "description" : "Covers development and design of models for materials processes and structure-property relations. Emphasizes techniques for solving equations from models or simulating their behavior. Assesses methods for visualizing solutions and aesthetics of the graphical presentation of results. Topics include symmetry and structure, classical and statistical thermodynamics, solid state physics, mechanics, phase transformations and kinetics, statistics and presentation of data.",
    "instructors" : "W. C. Carter"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.071",
    "academicYear" : "2016",
    "title" : "Amorphous Materials",
    "cluster" : null,
    "prerequisites" : "3.024",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Discusses the fundamental material science behind amorphous solids (non-crystalline materials). Covers formation of amorphous solids; amorphous structures and their electrical and optical properties; and characterization methods and technical applications.",
    "instructors" : "J. Hu"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S02",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S03",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S09",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S171",
    "academicYear" : "2016",
    "title" : "Special Subject: Processing and Properties of Structural Materials",
    "cluster" : "(Subject meets with 2.821J, 3.371J)",
    "prerequisites" : "3.012, 3.014",
    "units" : "2-0-10",
    "optional" : "Can be repeated for credit",
    "description" : "Experimental subject that combines online and in-person lectures to discuss materials selection and design using structural materials, casting, deformation processes, welding and joining, non-destructive testing, codes, standards, and life assessment. Presented in modules; repeatable for credit one time with permission of instructor. To be proposed for permanent status as an undergraduate version of 3.371 in 2015-16.",
    "instructors" : "T. Eagar, A. Slocum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.18",
    "academicYear" : "2016",
    "title" : "Materials Science and Engineering of Clean Energy",
    "cluster" : "(Subject meets with 3.70)",
    "prerequisites" : "3.022, 3.024",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Develops the materials principles, limitations, and challenges of clean energy technologies, including solar, energy storage, thermoelectrics, fuel cells, and novel fuels. Draws correlations between the limitations and challenges related to key figures of merit and the basic underlying thermodynamic, structural, transport, and physical principles, as well as to the means for fabricating devices exhibiting optimum operating efficiencies and extended life at reasonable cost. Students taking graduate version complete additional assignments.",
    "instructors" : "H. Tuller, K. Van Vliet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.005",
    "academicYear" : "2016",
    "title" : "Passion Projects: Living in a Material World",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-2-6",
    "optional" : null,
    "description" : "Project-based seminar in which students formulate and answer questions about a material or object that interests and inspires them. Uses cutting-edge equipment to characterize the materials' structure in order to understand its role and functionality. Analyzes the lifecycle of the material to better understand the full use case. Culminates in the creation of a website, video, and final presentation in which students share the results of their research. Preference to freshmen; limited to 15.",
    "instructors" : "K. Van Vliet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S05",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : null,
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.S06",
    "academicYear" : "2016",
    "title" : "Special Subject in Materials Science and Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "Lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.50",
    "academicYear" : "2016",
    "title" : "Sustainable Chemical Metallurgy",
    "cluster" : "(Subject meets with 3.19)",
    "prerequisites" : "3.022 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers principles of metal extraction processes. Provides a direct application of the fundamentals of thermodynamics and kinetics to the industrial production of metals from their ores, e.g. iron, aluminum, or reactive metals and silicon. Discusses the corresponding economics and global challenges. Addresses advanced techniques for sustainable metal extraction, particularly with respect to greenhouse gas emissions. Students taking graduate version complete additional assignments.",
    "instructors" : "A. Allanore"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "3.31",
    "academicYear" : "2016",
    "title" : "Radiation Damage and Effects in Nuclear Materials",
    "cluster" : "(Same subject as 22.74J)",
    "prerequisites" : "22.14, 3.21, or permission of instructors",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 22.74J.",
    "instructors" : "M. Short"
  } ]
}