{
  "metadata" : {
    "size" : "283"
  },
  "items" : [ {
    "termCode" : "2016FA",
    "subjectId" : "6.902",
    "academicYear" : "2016",
    "title" : "Engineering Innovation and Design",
    "cluster" : "(Same subject as 2.723J, ESD.051J)",
    "prerequisites" : "None",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "Project-based seminar in innovative design thinking develops students' ability to conceive, implement, and evaluate successful projects in any engineering discipline. Lectures focus on the iterative design process and techniques to enhance creative analysis. Students use this process to design and implement robust voice recognition applications using a simple web-based system. They also give presentations and receive feedback to sharpen their communication skills for high emotional and intellectual impact. Guest lectures illustrate multidisciplinary approaches to design thinking.",
    "instructors" : "B. Kotelly"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.049",
    "academicYear" : "2016",
    "title" : "Evolutionary Biology:  Concepts, Models and Computation",
    "cluster" : "(Same subject as 7.33J)",
    "prerequisites" : "7.03; 6.0002, 6.01, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 7.33J.",
    "instructors" : "R. Berwick, D. Bartel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.878",
    "academicYear" : "2016",
    "title" : "Advanced Computational Biology: Genomes, Networks, Evolution",
    "cluster" : "(Same subject as HST.507J)\n(Subject meets with 6.047)",
    "prerequisites" : "6.006, 6.041, Biology (GIR); or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description for 6.047.  Additionally examines recent publications in the areas covered, with research-style assignments. A more substantial final project is expected, which can lead to a thesis and publication.",
    "instructors" : "M. Kellis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.207",
    "academicYear" : "2016",
    "title" : "Networks",
    "cluster" : "(Same subject as 14.15J)",
    "prerequisites" : "6.041 or 14.30",
    "units" : "4-0-8 HASS-S",
    "optional" : null,
    "description" : "See description under subject 14.15J.",
    "instructors" : "Consult D. Acemoglu, M. Dahleh"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.024",
    "academicYear" : "2016",
    "title" : "Molecular, Cellular, and Tissue Biomechanics",
    "cluster" : "(Same subject as 2.797J, 3.053J, 20.310J)",
    "prerequisites" : "2.370 or 2.772J; 18.03 or 3.016; Biology (GIR)",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 20.310J.",
    "instructors" : "M. Bathe, A. J. Grodzinsky"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.123",
    "academicYear" : "2016",
    "title" : "Bioinstrumentation Project Lab",
    "cluster" : "(Same subject as 20.345J)",
    "prerequisites" : "Biology (GIR), and 2.004 or 6.003; or 20.309; or permission of instructor",
    "units" : "2-7-3",
    "optional" : null,
    "description" : "See description under subject 20.345J.",
    "instructors" : "P. So, J. Bagnall, S. F. Nagle,  S. Wasserman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.0002",
    "academicYear" : "2016",
    "title" : "Introduction to Computational Thinking and Data Science",
    "cluster" : null,
    "prerequisites" : "6.0001 or permission of instructor",
    "units" : "2-3-1",
    "optional" : null,
    "description" : "Provides an introduction to using computation to understand real-world phenomena. Topics include plotting, stochastic programs, probability and statistics, random walks, Monte Carlo simulations, modeling data, optimization problems, and clustering. Combination of 6.0001 and 6.0002 counts as REST subject.",
    "instructors" : "J. V. Guttag"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.008",
    "academicYear" : "2016",
    "title" : "Introduction to Inference",
    "cluster" : null,
    "prerequisites" : "6.01 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduces probabilistic modeling for problems of inference and machine  learning from data, emphasizing analytical and computational aspects. Distributions, marginalization, conditioning, and structure; graphical representations.  Belief propagation, decision-making, classification,  estimation, and prediction.  Sampling methods and analysis.  Introduces asymptotic analysis and information measures, and applications.",
    "instructors" : "P. Golland, G. W. Wornell"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.814",
    "academicYear" : "2016",
    "title" : "Database Systems",
    "cluster" : "(Subject meets with 6.830)",
    "prerequisites" : "6.033; 6.046 or 6.006; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Topics related to the engineering and design of database systems, including data models; database and schema design; schema normalization and integrity constraints; query processing; query optimization and cost estimation; transactions; recovery; concurrency control; isolation and consistency; distributed, parallel and heterogeneous databases; adaptive databases; trigger systems; pub-sub systems; semi structured data and XML querying. Lecture and readings from original research papers. Semester-long project and paper. Students taking graduate version complete different assignments. Enrollment may be limited.  4 Engineering Design Points.",
    "instructors" : "S. R. Madden"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S084",
    "academicYear" : "2016",
    "title" : "Special Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Covers subject matter not offered in the regular curriculum. Consult department to learn of offerings for a particular term.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.777",
    "academicYear" : "2016",
    "title" : "Design and Fabrication of Microelectromechanical Systems",
    "cluster" : "(Same subject as 2.372J)\n(Subject meets with 2.374J, 6.717J)",
    "prerequisites" : "6.003 or 2.003, Physics II (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides an introduction to microsystem design. Covers material properties, microfabrication technologies, structural behavior, sensing methods, electromechanical actuation, thermal actuation and control, multi-domain modeling, noise, and microsystem packaging. Applies microsystem modeling, and manufacturing principles to the design and analysis a variety of microscale sensors and actuators (e.g., optical MEMS, bioMEMS, and inertial sensors). Emphasizes modeling and simulation in the design process. Students taking the graduate version complete additional assignments.  4 Engineering Design Points.",
    "instructors" : "D. Weinstein"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.801",
    "academicYear" : "2016",
    "title" : "Machine Vision",
    "cluster" : "(Subject meets with 6.866)",
    "prerequisites" : "6.003 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Deriving a symbolic description of the environment from an image. Understanding physics of image formation. Image analysis as an inversion problem. Binary image processing and filtering of images as preprocessing steps. Recovering shape, lightness, orientation, and motion. Using constraints to reduce the ambiguity. Photometric stereo and extended Gaussian sphere. Applications to robotics; intelligent interaction of machines with their environment. Students taking the graduate version complete different assignments.",
    "instructors" : "B. K. P. Horn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.803",
    "academicYear" : "2016",
    "title" : "The Human Intelligence Enterprise",
    "cluster" : "(Subject meets with 6.833)",
    "prerequisites" : "6.034 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Analyzes seminal work directed at the development of a computational understanding of human intelligence, such as work on learning, language, vision, event representation, commonsense reasoning, self reflection, story understanding, and analogy. Reviews visionary ideas of Turing, Minsky, and other influential thinkers. Examines the implications of work on brain scanning, developmental psychology, and cognitive psychology. Emphasis on discussion and analysis of original papers. Students taking graduate version complete additional assignments. Enrollment limited.",
    "instructors" : "P. H. Winston"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.823",
    "academicYear" : "2016",
    "title" : "Computer System Architecture",
    "cluster" : null,
    "prerequisites" : "6.004",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to the principles underlying modern computer architecture. Emphasizes the relationship among technology, hardware organization, and programming systems in the evolution of computer architecture. Topics include pipelined, out-of-order, and speculative execution; caches, virtual memory and exception handling, superscalar, very long instruction word (VLIW), vector, and multithreaded processors; on-chip networks, memory models, synchronization, and cache coherence protocols for multiprocessors.  4 Engineering Design Points.",
    "instructors" : "Arvind, J. S. Emer, D. Sanchez"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.824",
    "academicYear" : "2016",
    "title" : "Distributed Computer Systems Engineering",
    "cluster" : null,
    "prerequisites" : "6.033, permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Abstractions and implementation techniques for engineering distributed  systems: remote procedure call, threads and locking, client/server,  peer-to-peer, consistency, fault tolerance, and security.  Readings  from current literature. Individual laboratory assignments culminate  in the construction of a fault-tolerant and scalable network file  system. Programming experience with C/C++ required. Enrollment limited.  6 Engineering Design Points.",
    "instructors" : "R. T. Morris, M. F. Kaashoek"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.829",
    "academicYear" : "2016",
    "title" : "Computer Networks",
    "cluster" : null,
    "prerequisites" : "6.033 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Topics on the engineering and analysis of network protocols and architecture, including architectural principles for designing heterogeneous networks; transport protocols; Internet routing; router design; congestion control and network resource management; wireless networks; network security; naming; overlay and peer-to-peer networks. Readings from original research papers. Semester-long project and paper.  4 Engineering Design Points.",
    "instructors" : "H. Balakrishnan, D. Katabi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.833",
    "academicYear" : "2016",
    "title" : "The Human Intelligence Enterprise",
    "cluster" : "(Subject meets with 6.803)",
    "prerequisites" : "6.034",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Analyzes seminal work directed at the development of a computational understanding of human intelligence, such as work on learning, language, vision, event representation, commonsense reasoning, self reflection, story understanding, and analogy. Reviews visionary ideas of Turing, Minsky, and other influential thinkers. Examines the implications of work on brain scanning, developmental psychology, and cognitive psychology. Emphasis on discussion and analysis of original papers. Requires the completion of additional exercises and a substantial term project. Enrollment limited.",
    "instructors" : "P. H. Winston"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.834",
    "academicYear" : "2016",
    "title" : "Cognitive Robotics",
    "cluster" : "(Same subject as 16.412J)",
    "prerequisites" : "6.041, 6.042, or 16.09; 16.413 or 6.034",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 16.412J.",
    "instructors" : "B. C. Williams"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.837",
    "academicYear" : "2016",
    "title" : "Computer Graphics",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR), 6.005; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to computer graphics algorithms, software and hardware.  Topics include ray tracing, the graphics pipeline, transformations,  texture mapping, shadows, sampling, global illumination, splines,  animation and color.  6 Engineering Design Points.",
    "instructors" : "F. P. Durand, W. Matusik"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.838",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Computer Graphics",
    "cluster" : null,
    "prerequisites" : "6.837",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "In-depth study of an active research topic in computer graphics. Topics change each term. Readings from the literature, student presentations, short assignments, and a programming project.",
    "instructors" : "W. Matusik"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.841",
    "academicYear" : "2016",
    "title" : "Advanced Complexity Theory",
    "cluster" : "(Same subject as 18.405J)",
    "prerequisites" : "18.404",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 18.405J.",
    "instructors" : "D. Moshkovitz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.846",
    "academicYear" : "2016",
    "title" : "Parallel Computing",
    "cluster" : null,
    "prerequisites" : "6.004 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to parallel and multicore computer architecture and programming.  Topics include the design and implementation of multicore processors; networking, video, continuum, particle and graph applications for multicores; communication and synchronization algorithms and mechanisms; locality in parallel computations; computational models, including shared memory, streams, message passing, and data parallel; multicore mechanisms for synchronization, cache coherence, and multithreading.  Performance evaluation of multicores; compilation and runtime systems for parallel computing.  Substantial project required.  4 Engineering Design Points.",
    "instructors" : "A. Agarwal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.852",
    "academicYear" : "2016",
    "title" : "Distributed Algorithms",
    "cluster" : "(Same subject as 18.437J)",
    "prerequisites" : "6.046",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Design and analysis of concurrent algorithms, emphasizing those suitable for use in distributed networks. Process synchronization, allocation of computational resources, distributed consensus, distributed graph algorithms, election of a leader in a network, distributed termination, deadlock detection, concurrency control, communication, and clock synchronization. Special consideration given to issues of efficiency and fault tolerance. Formal models and proof methods for distributed computation.",
    "instructors" : "N. A. Lynch"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.854",
    "academicYear" : "2016",
    "title" : "Advanced Algorithms",
    "cluster" : "(Same subject as 18.415J)",
    "prerequisites" : "6.041, 6.042, or 18.600; 6.046",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "First-year graduate subject in algorithms. Emphasizes fundamental algorithms and advanced methods of algorithmic design, analysis, and implementation. Surveys a variety of computational models and the algorithms for them. Data structures, network flows, linear programming, computational geometry, approximation algorithms, online algorithms, parallel algorithms, external memory, streaming algorithms.",
    "instructors" : "A. Moitra, D. R. Karger"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.856",
    "academicYear" : "2016",
    "title" : "Randomized Algorithms",
    "cluster" : "(Same subject as 18.416J)",
    "prerequisites" : "6.854J, 6.041 or 6.042J",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Studies how randomization can be used to make algorithms simpler and more efficient via random sampling, random selection of witnesses, symmetry breaking, and Markov chains. Models of randomized computation. Data structures: hash tables, and skip lists. Graph algorithms: minimum spanning trees, shortest paths, and minimum cuts. Geometric algorithms: convex hulls, linear programming in fixed or arbitrary dimension. Approximate counting; parallel algorithms; online algorithms; derandomization techniques; and tools for probabilistic analysis of algorithms.",
    "instructors" : "D. R. Karger"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.857",
    "academicYear" : "2016",
    "title" : "Network and Computer Security",
    "cluster" : null,
    "prerequisites" : "6.033, 6.042J",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Emphasis on applied cryptography and may include: basic notion of systems security, crypotographic hash functions, symmetric crypotography (one-time pad, stream ciphers, block ciphers), cryptanalysis, secret-sharing, authentication codes, public-key cryptography (encryption, digital signatures), public-key attacks, web browser security, biometrics, electronic cash, viruses, electronic voting, Assignments include a group final project. Topics may vary year to year.",
    "instructors" : "R. L. Rivest"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.859",
    "academicYear" : "2016",
    "title" : "Integer Programming and Combinatorial Optimization",
    "cluster" : "(Same subject as 15.083J)",
    "prerequisites" : "15.081J or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 15.083J.",
    "instructors" : "D. J. Bertsimas, A. S. Schulz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.863",
    "academicYear" : "2016",
    "title" : "Natural Language and the Computer Representation of Knowledge",
    "cluster" : "(Same subject as 9.611J)",
    "prerequisites" : "6.034",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Explores the relationship between computer representation of knowledge and the structure of natural language. Emphasizes development of analytical skills necessary to judge the computational implications of grammatical formalisms, and uses concrete examples to illustrate particular computational issues. Efficient parsing algorithms for context-free grammars; Treebank grammars and statistical parsing. Question answering systems. Extensive laboratory work on building natural language processing systems.  8 Engineering Design Points.",
    "instructors" : "R. C. Berwick"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.866",
    "academicYear" : "2016",
    "title" : "Machine Vision",
    "cluster" : "(Subject meets with 6.801)",
    "prerequisites" : "6.003 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Intensive introduction to the process of generating a symbolic description of the environment from an image. Students expected to attend the 6.801 lectures as well as occasional seminar meetings on special topics. Material presented in 6.801 is supplemented by reading from the literature. Students required to prepare a paper analyzing research in a selected area.",
    "instructors" : "B. K. P. Horn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.867",
    "academicYear" : "2016",
    "title" : "Machine Learning",
    "cluster" : null,
    "prerequisites" : "6.041 or 18.600, 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Principles, techniques, and algorithms in machine learning from the point of view of statistical inference; representation, generalization, and model selection; and methods such as linear/additive models, active learning, boosting, support vector machines, non-parametric Bayesian methods, hidden Markov models, and Bayesian networks. Recommended prerequisite: 6.036.",
    "instructors" : "T. Jaakkola, L. P. Kaelbling"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.868",
    "academicYear" : "2016",
    "title" : "The Society of Mind",
    "cluster" : "(Same subject as MAS.731J)",
    "prerequisites" : "Must have read \"The Society of Mind\" and \"The Emotion Machine\"; permission of instructor",
    "units" : "2-0-10",
    "optional" : null,
    "description" : "Introduction to a theory that tries to explain how minds are made from collections of simpler processes. Treats such aspects of thinking as vision, language, learning, reasoning, memory, consciousness, ideals, emotions, and personality. Incorporates ideas from psychology, artificial intelligence, and computer science to resolve theoretical issues such as wholes vs. parts, structural vs. functional descriptions, declarative vs. procedural representations, symbolic vs. connectionist models, and logical vs. common-sense theories of learning. Enrollment limited.",
    "instructors" : "M. Minsky"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.872",
    "academicYear" : "2016",
    "title" : "Biomedical Computing",
    "cluster" : "(Same subject as HST.950J)",
    "prerequisites" : "6.034",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Analyzes computational needs of clinical medicine, reviews systems and approaches that have been used to support those needs, and the relationship between clinical data and gene and protein measurements. Topics: the nature of clinical data; architecture and design of healthcare information systems; privacy and security issues; medical expert systems; introduction to bioinformatics. Case studies and guest lectures describe contemporary systems and research projects. Term project using large clinical and genomic data sets integrates classroom topics.  6 Engineering Design Points.",
    "instructors" : "G. Alterovitz, P. Szolovits"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.875",
    "academicYear" : "2016",
    "title" : "Cryptography and Cryptanalysis",
    "cluster" : "(Same subject as 18.425J)",
    "prerequisites" : "6.046J",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A rigorous introduction to modern cryptography. Emphasis on the fundamental cryptographic primitives of public-key encryption, digital signatures, pseudo-random number generation, and basic protocols and their computational complexity requirements.",
    "instructors" : "S. Goldwasser, S. Micali"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.910",
    "academicYear" : "2016",
    "title" : "Independent Study in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for independent study at the undergraduate level under regular supervision by a faculty member. Projects require prior approval.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.921",
    "academicYear" : "2016",
    "title" : "6-A Internship",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "0-12-0 [P/D/F]",
    "optional" : null,
    "description" : "Provides academic credit for the first assignment of 6-A undergraduate students at companies affiliated with the department's 6-A internship program. Limited to students participating in the 6-A internship program.",
    "instructors" : "M. Zahn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.922",
    "academicYear" : "2016",
    "title" : "Advanced 6-A Internship",
    "cluster" : null,
    "prerequisites" : "6.921",
    "units" : "0-12-0 [P/D/F]",
    "optional" : null,
    "description" : "Provides academic credit for the second assignment of 6-A undergraduate students at companies affiliated with the department's 6-A internship program. Limited to students participating in the 6-A internship program.",
    "instructors" : "M. Zahn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.930",
    "academicYear" : "2016",
    "title" : "Management in Engineering",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 2.96, 6.930, 10.806, 16.653)",
    "prerequisites" : "None",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "See description under subject 2.96.",
    "instructors" : "H. S. Marcus, J.-H. Chun"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.946",
    "academicYear" : "2016",
    "title" : "Classical Mechanics: A Computational Approach",
    "cluster" : "(Same subject as 8.351J, 12.620J)",
    "prerequisites" : "Physics I (GIR), 18.03, permission of instructor",
    "units" : "3-3-6",
    "optional" : "Credit cannot also be received for 12.008",
    "description" : "See description under subject 12.620J.",
    "instructors" : "J. Wisdom, G. J. Sussman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.951",
    "academicYear" : "2016",
    "title" : "Graduate 6-A Internship",
    "cluster" : null,
    "prerequisites" : "6.921, 6.922, or 6.923",
    "units" : "0-12-0 [P/D/F]",
    "optional" : null,
    "description" : "Provides academic credit for a graduate assignment of graduate 6-A students at companies affiliated with the department's 6-A internship program. Limited to graduate students participating in the 6-A internship program.",
    "instructors" : "M. Zahn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.952",
    "academicYear" : "2016",
    "title" : "Graduate 6-A Internship",
    "cluster" : null,
    "prerequisites" : "6.951",
    "units" : "0-12-0 [P/D/F]",
    "optional" : null,
    "description" : "Provides academic credit for graduate students who require an additional term at the company to complete the graduate assignment of the department's 6-A internship program. This academic credit is for registration purposes only and cannot be used toward fulfilling the requirements of any degree program. Limited to graduate students participating in the 6-A internship program.",
    "instructors" : "M. Zahn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.961",
    "academicYear" : "2016",
    "title" : "Introduction to Research in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-0",
    "optional" : null,
    "description" : "Seminar on topics related to research leading to an SM, EE, ECS, PhD, or ScD thesis. Limited to first-year regular graduate students in EECS with a fellowship or teaching assistantship.",
    "instructors" : "L. A. Kolodziejski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.980",
    "academicYear" : "2016",
    "title" : "Teaching Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For qualified students interested in gaining teaching experience. Classroom, tutorial, or laboratory teaching under the supervision of a faculty member. Enrollment limited by availability of suitable teaching assignments.",
    "instructors" : "H. S. Lee, R. C. Miller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.981",
    "academicYear" : "2016",
    "title" : "Teaching Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For Teaching Assistants in Electrical Engineering and Computer Science, in cases where teaching assignment is approved for academic credit by the department.",
    "instructors" : "H. S. Lee, R. C. Miller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.991",
    "academicYear" : "2016",
    "title" : "Research in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For EECS MEng students who are Research Assistants in Electrical Engineering and Computer Science, in cases where the assigned research is approved for academic credit by the department. Hours arranged with research supervisor.",
    "instructors" : "A. R. Meyer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.820",
    "academicYear" : "2016",
    "title" : "Foundations of Program Analysis",
    "cluster" : null,
    "prerequisites" : "6.035",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents major principles and techniques for program analysis. Includes formal semantics, type systems and type-based program analysis, abstract interpretation and model checking and synthesis. Emphasis on Haskell and Ocaml, but no prior experience in these languages is assumed.  Student assignments include implementing of techniques covered in class, including building simple verifiers.",
    "instructors" : "A. Solar-Lezama"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.EPW",
    "academicYear" : "2016",
    "title" : "UPOP Engineering Practice Workshop",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.EPW, 2.EPW, 3.EPW, 6.EPW, 10.EPW, 16.EPW, 20.EPW, 22.EPW)",
    "prerequisites" : "None",
    "units" : "1-0-0 [P/D/F]",
    "optional" : null,
    "description" : "See description under subject 2.EPW.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.UR",
    "academicYear" : "2016",
    "title" : "Undergraduate Research in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Individual research project arranged with appropriate faculty member or approved supervisor.  Forms and instructions for the proposal and final report are available in the EECS Undergraduate Office.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.THG",
    "academicYear" : "2016",
    "title" : "Graduate Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of an  SM, EE, ECS, PhD, or ScD thesis; to be arranged by the student and an appropriate MIT faculty member.",
    "instructors" : "L. A. Kolodziejski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.267",
    "academicYear" : "2016",
    "title" : "Heterogeneous Networks: Architecture, Transport, Proctocols, and Management",
    "cluster" : null,
    "prerequisites" : "6.041 or 6.042",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to modern heterogeneous networks and the provision of heterogeneous services. Architectural principles, analysis, algorithmic techniques, performance analysis, and existing designs are developed and applied to understand current problems in network design and architecture. Begins with basic principles of networking. Emphasizes development of mathematical and algorithmic tools; applies them to understanding network layer design from the performance and scalability viewpoint. Concludes with network management and control, including the architecture and performance analysis of interconnected heterogeneous networks. Provides background and insight to understand current network literature and to perform research on networks with the aid of network design projects.  4 Engineering Design Points.",
    "instructors" : "V. W. S. Chan, R. G. Gallager"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.849",
    "academicYear" : "2016",
    "title" : "Geometric Folding Algorithms: Linkages, Origami, Polyhedra",
    "cluster" : null,
    "prerequisites" : "6.046 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers discrete geometry and algorithms underlying the reconfiguration of foldable structures, with applications to robotics, manufacturing, and biology. Linkages made from one-dimensional rods connected by hinges: constructing polynomial curves, characterizing rigidity, characterizing unfoldable versus locked, protein folding. Folding two-dimensional paper (origami): characterizing flat foldability, algorithmic origami design, one-cut magic trick. Unfolding and folding three-dimensional polyhedra: edge unfolding, vertex unfolding, gluings, Alexandrov's Theorem, hinged dissections.",
    "instructors" : "E. D. Demaine"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.073",
    "academicYear" : "2016",
    "title" : "Creating Video Games",
    "cluster" : "(Same subject as CMS.611J)",
    "prerequisites" : "6.01, CMS.301, or CMS.608",
    "units" : "3-3-6 HASS-A",
    "optional" : null,
    "description" : "See description under subject CMS.611J.",
    "instructors" : "P. Tan, S. Verrilli, R. Eberhardt"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.002",
    "academicYear" : "2016",
    "title" : "Circuits and Electronics",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR); <I>Coreq: 18.03</I>",
    "units" : "4-1-7 REST",
    "optional" : null,
    "description" : "Fundamentals of the lumped circuit abstraction. Resistive elements and networks, independent and dependent sources, switches and MOS devices, digital abstraction, amplifiers, and energy storage elements. Dynamics of first- and second-order networks; design in the time and frequency domains; analog and digital circuits and applications. Design exercises. Occasional laboratory.  4 Engineering Design Points.",
    "instructors" : "A. Agarwal, J. del Alamo, J. H. Lang, D. J. Perreault"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.003",
    "academicYear" : "2016",
    "title" : "Signals and Systems",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR), 18.03",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Presents the fundamentals of signal and system analysis. Topics include discrete-time and continuous-time signals, Fourier series and transforms, Laplace and Z transforms, and analysis of linear, time-invariant systems. Applications drawn broadly from engineering and physics, including audio and image processing, communications, and automatic control.  4 Engineering Design Points.",
    "instructors" : "D. M. Freeman, Q. Hu, J. S. Lim"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.004",
    "academicYear" : "2016",
    "title" : "Computation Structures",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR)",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduces architecture of digital systems, emphasizing structural principles common to a wide range of technologies. Multilevel implementation strategies; definition of new primitives (e.g., gates, instructions, procedures, and processes) and their mechanization using lower-level elements. Analysis of potential concurrency; precedence constraints and performance measures; pipelined and multidimensional systems. Instruction set design issues; architectural support for contemporary software structures.  4 Engineering Design Points.",
    "instructors" : "S. A. Ward, C. J. Terman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.011",
    "academicYear" : "2016",
    "title" : "Signals, Systems, and Inference",
    "cluster" : null,
    "prerequisites" : "6.003; 6.008, 6.041, or 18.600",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Covers signals, systems and inference in communication, control and signal processing. Topics include input-output and state-space models of linear systems driven by deterministic and random signals; time- and transform-domain representations in discrete and continuous time; and group delay. State feedback and observers. Probabilistic models; stochastic processes, correlation functions, power spectra, spectral factorization. Least-mean square error estimation; Wiener filtering. Hypothesis testing; detection; matched filters.",
    "instructors" : "A. V. Oppenheim, G. C. Verghese"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.012",
    "academicYear" : "2016",
    "title" : "Microelectronic Devices and Circuits",
    "cluster" : null,
    "prerequisites" : "6.002",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Microelectronic device modeling, and basic microelectronic circuit analysis and design. Physical electronics of semiconductor junction and MOS devices. Relating terminal behavior to internal physical processes, developing circuit models, and understanding the uses and limitations of different models. Use of incremental and large-signal techniques to analyze and design transistor circuits, with examples chosen from digital circuits, linear amplifiers, and other integrated circuits. Design project.  4 Engineering Design Points.",
    "instructors" : "A. I. Akinwande, D. A. Antoniadis, J. Kong, C. G. Sodini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.021",
    "academicYear" : "2016",
    "title" : "Cellular Biophysics and Neurophysiology",
    "cluster" : "(Same subject as 2.791J, 20.370J)\n(Subject meets with 2.794J, 6.521J, 20.470J, HST.541J)",
    "prerequisites" : "Physics II (GIR); 18.03; 2.005, 6.002, 6.003, 6.071, 10.301, 20.110, 20.111, or permission of instructor",
    "units" : "5-2-5",
    "optional" : null,
    "description" : "Integrated overview of the biophysics of cells from prokaryotes to neurons, with a focus on mass transport and electrical signal generation across cell membrane. First half of course focuses on mass transport through membranes: diffusion, osmosis, chemically mediated, and active transport. Second half focuses on electrical properties of cells: ion transport to action potentials in electrically excitable cells. Synaptic transmission. Electrical properties interpreted via kinetic and molecular properties of single voltage-gated ion channels. Laboratory and computer exercises illustrate the concepts. Provides instruction in written and oral communication. Students taking graduate version complete different assignments. Preference to juniors and seniors.  4 Engineering Design Points.",
    "instructors" : "J. Han, T. Heldt, J. Voldman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.022",
    "academicYear" : "2016",
    "title" : "Quantitative Systems Physiology",
    "cluster" : "(Same subject as 2.792J, 20.371J, HST.542J)\n(Subject meets with 2.796J, 6.522J, 20.471J)",
    "prerequisites" : "Physics II (GIR), 18.03, or permission of instructor",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Application of the principles of energy and mass flow to major human organ systems. Mechanisms of regulation and homeostasis. Anatomical, physiological and pathophysiological features of the cardiovascular, respiratory and renal systems. Systems, features and devices that are most illuminated by the methods of physical sciences. Laboratory work includes some animal studies. Students taking graduate version complete additional assignments.  2 Engineering Design Points.",
    "instructors" : "T. Heldt, R. G. Mark, C. M. Stultz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.033",
    "academicYear" : "2016",
    "title" : "Computer System Engineering",
    "cluster" : null,
    "prerequisites" : "6.004, 6.02",
    "units" : "5-1-6",
    "optional" : null,
    "description" : "Topics on the engineering of computer software and hardware systems: techniques for controlling complexity; strong modularity using client-server design, operating systems; performance, networks; naming; security and privacy; fault-tolerant systems, atomicity and coordination of concurrent activities, and recovery; impact of computer systems on society.  Case studies of working systems and readings from the current literature provide comparisons and contrasts.  Two design projects.  Students engage in extensive written communication exercises. Enrollment may be limited.  4 Engineering Design Points.",
    "instructors" : "K. LaCurts, M. F. Kaashoek, H. Balakrishnan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.034",
    "academicYear" : "2016",
    "title" : "Artificial Intelligence",
    "cluster" : null,
    "prerequisites" : "6.01",
    "units" : "4-3-5",
    "optional" : null,
    "description" : "Introduces representations, methods, and architectures used to build applications and to account for human intelligence from a computational point of view. Covers applications of rule chaining, constraint propagation, constrained search, inheritance, statistical inference, and other problem-solving paradigms. Also addresses applications of identification trees, neural nets, genetic algorithms, support-vector machines, boosting, and other learning paradigms. considers what separates human intelligence from that of other animals.  4 Engineering Design Points.",
    "instructors" : "P. H. Winston"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.035",
    "academicYear" : "2016",
    "title" : "Computer Language Engineering",
    "cluster" : null,
    "prerequisites" : "6.004 and 6.005",
    "units" : "4-4-4",
    "optional" : null,
    "description" : "Analyzes issues associated with the implementation of higher-level programming languages. Fundamental concepts, functions, and structures of compilers. The interaction of theory and practice. Using tools in building software. Includes a multi-person project on compiler design and implementation.  8 Engineering Design Points.",
    "instructors" : "M. C. Rinard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.041",
    "academicYear" : "2016",
    "title" : "Probabilistic Systems Analysis",
    "cluster" : "(Subject meets with 6.431)",
    "prerequisites" : "Calculus II (GIR)",
    "units" : "4-0-8 REST",
    "optional" : "Credit cannot also be received for 18.600",
    "description" : "An introduction to probability theory, and the modeling and analysis of probabilistic systems. Probabilistic models, conditional probability. Discrete and continuous random variables. Expectation and conditional expectation. Limit Theorems. Bernoulli and Poisson processes. Markov chains. Bayesian estimation and hypothesis testing. Elements of statistical inference. Meets with graduate subject 6.431, but assignments differ.",
    "instructors" : "D. P. Bertsekas, J. N. Tsitsiklis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.042",
    "academicYear" : "2016",
    "title" : "Mathematics for Computer Science",
    "cluster" : "(Same subject as 18.062J)",
    "prerequisites" : "Calculus I (GIR)",
    "units" : "5-0-7 REST",
    "optional" : null,
    "description" : "Elementary discrete mathematics for computer science and engineering. Emphasis on mathematical definitions and proofs as well as on applicable methods.  Topics: formal logic notation, proof methods; induction, well-ordering; sets, relations; elementary graph theory; integer congruences; asymptotic notation and growth of functions; permutations and combinations, counting principles; discrete probability.  Further selected topics such as: recursive definition and structural induction; state machines and invariants; recurrences; generating functions.",
    "instructors" : "F. T. Leighton, A. R. Meyer, A. Moitra"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.045",
    "academicYear" : "2016",
    "title" : "Automata, Computability, and Complexity",
    "cluster" : "(Same subject as 18.400J)",
    "prerequisites" : "6.042",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Provides an introduction to some of the central ideas of theoretical computer science, including circuits, finite automata, Turing machines and computability, efficient algorithms and reducibility, the P versus NP problem, NP-completeness, the power of randomness, cryptography, computational learning theory, and quantum computing. Examines the classes of problems that can and cannot be solved in various computational models.",
    "instructors" : "S. Aaronson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.046",
    "academicYear" : "2016",
    "title" : "Design and Analysis of Algorithms",
    "cluster" : "(Same subject as 18.410J)",
    "prerequisites" : "6.006",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Techniques for the design and analysis of efficient algorithms, emphasizing methods useful in practice. Topics include sorting; search trees, heaps, and hashing; divide-and-conquer; dynamic programming; greedy algorithms; amortized analysis; graph algorithms; and shortest paths. Advanced topics may include network flow; computational geometry; number-theoretic algorithms; polynomial and matrix calculations; caching; and parallel computing.",
    "instructors" : "E. Demaine, M. Goemans"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.050",
    "academicYear" : "2016",
    "title" : "Information, Entropy, and Computation",
    "cluster" : "(Same subject as 2.110J)",
    "prerequisites" : "Physics I (GIR)",
    "units" : "4-0-5",
    "optional" : null,
    "description" : "Explores the ultimate limits to communication and computation, with an emphasis on the physical nature of information and information processing. Topics include information and computation, digital signals, codes, and compression. Biological representations of information. Logic circuits, computer architectures, and algorithmic information. Noise, probability, and error correction. The concept of entropy applied to channel capacity and to the second law of thermodynamics. Reversible and irreversible operations and the physics of computation. Quantum computation.",
    "instructors" : "P. Penfield, Jr., S. Lloyd"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.061",
    "academicYear" : "2016",
    "title" : "Introduction to Electric Power Systems",
    "cluster" : "(Subject meets with 6.690)",
    "prerequisites" : "6.002, 6.013",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Electric circuit theory with application to power handling electric circuits. Modeling and behavior of electromechanical devices, including magnetic circuits, motors, and generators. Operational fundamentals of synchronous, induction and DC machinery. Interconnection of generators and motors with electric power transmission and distribution circuits. Power generation, including alternative and sustainable sources. Students taking graduate version complete additional assignments.  6 Engineering Design Points.",
    "instructors" : "J. L. Kirtley, Jr."
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.070",
    "academicYear" : "2016",
    "title" : "Electronics Project Laboratory",
    "cluster" : "(Same subject as EC.120J)",
    "prerequisites" : "None",
    "units" : "2-2-2",
    "optional" : null,
    "description" : "Intuition-based introduction to electronics, electronic components and test equipment such as oscilloscopes, meters (voltage, resistance inductance, capacitance, etc.), and signal generators. Emphasizes individual instruction and development of skills, such as soldering, assembly, and troubleshooting. Students design, build, and keep a small electronics project to put their new knowledge into practice. Intended for students with little or no previous background in electronics. Enrollment may be limited.",
    "instructors" : "J. Bales"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.100",
    "academicYear" : "2016",
    "title" : "Electrical Engineering and Computer Science Project",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Individual experimental work related to electrical engineering and computer science. Student must make arrangements with a project supervisor and file a proposal endorsed by the supervisor. Departmental approval required. Written report to be submitted upon completion of work.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.101",
    "academicYear" : "2016",
    "title" : "Introductory Analog Electronics Laboratory",
    "cluster" : null,
    "prerequisites" : "6.002 or 6.071",
    "units" : "2-9-1 Institute LAB",
    "optional" : null,
    "description" : "Introductory experimental laboratory explores the design, construction, and debugging of analog electronic circuits. Lectures and laboratory projects in the first half of the course investigate the performance characteristics of semiconductor devices (diodes, BJTs, and MOSFETs) and functional analog building blocks, including single-stage amplifiers, op amps, small audio amplifier, filters, converters, sensor circuits, and medical electronics (ECG, pulse-oximetry). Projects involve design, implementation, and presentation in an environment similar to that of industry engineering design teams. Instruction and practice in written and oral communication provided. Opportunity to simulate real-world problems and solutions that involve tradeoffs and the use of engineering judgment. Engineers from local companies help students with their design projects. 12 Engineering Design Points.",
    "instructors" : "G. Hom"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.111",
    "academicYear" : "2016",
    "title" : "Introductory Digital Systems Laboratory",
    "cluster" : null,
    "prerequisites" : "6.002, 6.071, or 16.004",
    "units" : "3-7-2 Institute LAB",
    "optional" : null,
    "description" : "Lectures and labs on digital logic, flip flops, PALs, FPGAs, counters, timing, synchronization, and finite-state machines prepare students for the design and implementation of a final project of their choice: games, music, digital filters, wireless communications, video, or graphics. Extensive use of Verilog  for describing and implementating digital logic designs. Students engage in extensive written and oral communication exercises. 12 Engineering Design Points.",
    "instructors" : "A. P. Chandrakasan, G. P. Hom"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.115",
    "academicYear" : "2016",
    "title" : "Microcomputer Project Laboratory",
    "cluster" : null,
    "prerequisites" : "6.002, 6.003, 6.004, or 6.007",
    "units" : "3-6-3 Institute LAB",
    "optional" : null,
    "description" : "Introduces the analysis and design of embedded systems. Microcontrollers  provide adaptation, flexibility, and real-time control. Emphasis placed on the construction of complete systems, including a five-axis robot arm, a fluorescent lamp ballast, a tomographic imaging station (e.g. a CAT scan), and a simple calculator. Introduces a wide range of basic tools, including software and development tools, peripheral components such as A/D converters, communication schemes, signal processing  techniques, closed-loop digital feedback control, interface and power electronics, and modeling of electromechanical systems. Includes a sequence of assigned projects, followed by a final project of the student's choice, emphasizing creativity and uniqueness. Final project may be expanded to satisfy a 6.UAP project.  Provides instruction in written and oral communication. 12 Engineering Design Points.",
    "instructors" : "S. B. Leeb"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.152",
    "academicYear" : "2016",
    "title" : "Micro/Nano Processing Technology",
    "cluster" : "(Same subject as 3.155J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-4-5",
    "optional" : null,
    "description" : "Introduces the theory and technology of micro/nano fabrication. Lectures and laboratory sessions on basic processing techniques such as vacuum processes, lithography, diffusion, oxidation, and pattern transfer. Students fabricate MOS capacitors, nanomechanical cantilevers, and microfluidic mixers. Emphasis on the interrelationships between material properties and processing, device structure, and the electrical, mechanical, optical, chemical  or biological behavior of devices. Provides background for thesis work in micro/nano fabrication. Students engage in extensive written and oral communication exercises.  6 Engineering Design Points.",
    "instructors" : "L. A. Kolodziejski, J. Michel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.161",
    "academicYear" : "2016",
    "title" : "Modern Optics Project Laboratory",
    "cluster" : "(Subject meets with 6.637)",
    "prerequisites" : "6.003",
    "units" : "3-5-4 Institute LAB",
    "optional" : null,
    "description" : "Lectures, laboratory exercises and projects on optical signal generation, transmission, detection, storage, processing and display. Topics include polarization properties of light; reflection and refraction; coherence and interference; Fraunhofer and Fresnel diffraction; holography; Fourier optics; coherent and incoherent imaging and signal processing systems; optical properties of materials; lasers and LEDs; electro-optic and acousto-optic light modulators; photorefractive and liquid-crystal light modulation; display technologies; optical waveguides and fiber-optic communication systems; photodetectors. Students may use this subject to find an advanced undergraduate project. Students engage in extensive oral and written communcation exercises. Recommended prerequisites: 6.007 or 8.03. 12 Engineering Design Points.",
    "instructors" : "C. Warde"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.163",
    "academicYear" : "2016",
    "title" : "Strobe Project Laboratory",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR) or permission of instructor",
    "units" : "2-8-2 Institute LAB",
    "optional" : null,
    "description" : "Application of electronic flash sources to measurement and   photography. First half covers fundamentals of photography and   electronic flashes, including experiments on application of electronic   flash to photography, stroboscopy, motion analysis, and high-speed   videography. Students write four extensive lab reports.  In the second half, students work in small groups to select, design,   and execute independent projects in measurement or photography that apply learned techniques. Project planning and execution skills are discussed and developed over the term.  Students engage in extensive written and oral communication exercises. Enrollment limited. 12 Engineering Design Points.",
    "instructors" : "J. K. Vandiver, J. W. Bales"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.182",
    "academicYear" : "2016",
    "title" : "Psychoacoustics Project Laboratory",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-6-3 Institute LAB",
    "optional" : null,
    "description" : "Introduces the methods used to measure human auditory abilities. Discusses auditory function, principles of psychoacoustic measurement, models for psychoacoustic performance, and experimental techniques. Project topics: absolute and differential auditory sensitivity, operating characteristics of human observers, span of auditory judgment, adaptive measurement procedures, and scaling sensory magnitudes. Knowledge of probability helpful. Students engage in extensive written and oral communication exercises. 12 Engineering Design Points.",
    "instructors" : "L. D. Braida"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.231",
    "academicYear" : "2016",
    "title" : "Dynamic Programming and Stochastic Control",
    "cluster" : null,
    "prerequisites" : "6.041 or 18.204; 18.100A, 18.100B, or 18.100C",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Sequential decision-making via dynamic programming. Unified approach to optimal control of stochastic dynamic systems and Markovian decision problems. Applications in linear-quadratic control, inventory control, resource allocation, scheduling, and planning. Optimal decision making under perfect and imperfect state information. Certainty equivalent, open loop-feedback control, rollout, model predictive control, aggregation, and other suboptimal control methods. Infinite horizon problems: discounted, stochastic shortest path, average cost, and semi-Markov models. Value and policy iteration. Abstract models in dynamic programming. Approximate/neurodynamic programming. Simulation based methods. Discussion of current research on the solution of large-scale problems.",
    "instructors" : "D. P. Bertsekas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.241",
    "academicYear" : "2016",
    "title" : "Dynamic Systems and Control",
    "cluster" : "(Same subject as 16.338J)",
    "prerequisites" : "6.003, 18.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Linear, discrete- and continuous-time, multi-input-output systems in control, related areas. Least squares and matrix perturbation problems. State-space models, modes, stability, controllability, observability, transfer function matrices, poles and zeros, and minimality. Internal stability of interconnected systems, feedback compensators, state feedback, optimal regulation, observers, and observer-based compensators. Measures of control performance, robustness issues using singular values of transfer functions. Introductory ideas on nonlinear systems. Recommended prerequisite: 6.302.",
    "instructors" : "M. A. Dahleh, A. Megretski, E. Frazzoli"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.242",
    "academicYear" : "2016",
    "title" : "Advanced Linear Control Systems",
    "cluster" : null,
    "prerequisites" : "18.06, 6.241",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to uncertain multivariable control systems, plus modeling assumptions and objectives. Stability of linear time invariant systems, coprime factorization, parametrization of all stabilizing compensators. Design using H<SUB>2</SUB>, H&infin; L<SUP>1</SUP> -optimization. Stability and performance robustness in the presence of structured uncertainty.",
    "instructors" : "M. A. Dahleh, A. Megretski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.245",
    "academicYear" : "2016",
    "title" : "Multivariable Control Systems",
    "cluster" : null,
    "prerequisites" : "6.241 or 16.31",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Computer-aided design methodologies for synthesis of multivariable feedback control systems. Performance and robustness trade-offs. Model-based compensators; Q-parameterization; ill-posed optimization problems; dynamic augmentation; linear-quadratic optimization of controllers; H-infinity controller design; Mu-synthesis; model and compensator simplification; nonlinear effects. Computer-aided (MATLAB) design homework using models of physical processes.  6 Engineering Design Points.",
    "instructors" : "A. Megretski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.251",
    "academicYear" : "2016",
    "title" : "Introduction to Mathematical Programming",
    "cluster" : "(Same subject as 15.081J)",
    "prerequisites" : "18.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to linear optimization and its extensions emphasizing both methodology and the underlying mathematical structures and geometrical ideas. Covers classical theory of linear programming as well as some recent advances in the field. Topics: simplex method; duality theory; sensitivity analysis; network flow problems; decomposition; integer programming; interior point algorithms for linear programming; and introduction to combinatorial optimization and NP-completeness.",
    "instructors" : "J. N. Tsitsiklis, D. Bertsimas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.252",
    "academicYear" : "2016",
    "title" : "Nonlinear Optimization",
    "cluster" : "(Same subject as 15.084J)",
    "prerequisites" : "18.06; 18.100A, 18.100B, or 18.100C",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Unified analytical and computational approach to nonlinear optimization problems. Unconstrained optimization methods include gradient, conjugate direction, Newton, sub-gradient and first-order methods. Constrained optimization methods include feasible directions, projection, interior point methods, and Lagrange multiplier methods. Convex analysis, Lagrangian relaxation, nondifferentiable optimization, and applications in integer programming. Comprehensive treatment of optimality conditions and Lagrange multipliers. Geometric approach to duality theory. Applications drawn from control, communications, power systems, and resource allocation problems.",
    "instructors" : "R. M. Freund, D. P. Bertsekas, G. Perakis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.262",
    "academicYear" : "2016",
    "title" : "Discrete Stochastic Processes",
    "cluster" : null,
    "prerequisites" : "6.041, 6.431 or 18.204",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Review of probability and laws of large numbers; Poisson counting process and renewal processes; Markov chains (including Markov decision theory), branching processes, birth-death processes, and semi-Markov processes; continuous-time Markov chains and reversibility; random walks, martingales, and large deviations; applications from queueing, communication, control, and operations research.",
    "instructors" : "R. G. Gallager, V. W. S. Chan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.263",
    "academicYear" : "2016",
    "title" : "Data-Communication Networks",
    "cluster" : "(Same subject as 16.37J)",
    "prerequisites" : "6.041 or 18.204",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides an introduction to data networks with an analytic perspective, using  telephone networks, wireless networks, optical networks, the Internet and data centers as primary applications. Presents basic tools for modeling and performance analysis accompanied by elementary, meaningful simulations. Develops insights for large networks by means of simple approximations. Draws upon concepts from queueing theory and optimization.",
    "instructors" : "E. Modiano, D. Shah"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.281",
    "academicYear" : "2016",
    "title" : "Logistical and Transportation Planning Methods",
    "cluster" : "(Same subject as 1.203J, 15.073J, 16.76J, ESD.216J)",
    "prerequisites" : "6.041",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.203J.",
    "instructors" : "R. C. Larson, A. I. Barnett"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.291",
    "academicYear" : "2016",
    "title" : "Seminar in Systems, Communications, and Control Research",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced topics in systems, communications, control, optimization, and signal processing. Topics selected according to student and instructor interest. See instructor for specific topics to be offered in a particular term.",
    "instructors" : "S. K. Mitter"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.301",
    "academicYear" : "2016",
    "title" : "Solid-State Circuits",
    "cluster" : null,
    "prerequisites" : "6.012",
    "units" : "3-2-7",
    "optional" : null,
    "description" : "Analysis and design of transistor circuits, based directly on the semiconductor physics and transistor circuit models developed in 6.012. High-frequency and low-frequency design calculations and simulation of multistage transistor circuits. Trans-linear circuits. Introduction to operational-amplifier design and application. Some previous laboratory experience assumed.  4 Engineering Design Points.",
    "instructors" : "H. S. Lee"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.302",
    "academicYear" : "2016",
    "title" : "Feedback Systems",
    "cluster" : null,
    "prerequisites" : "6.003, 2.003, or 16.004",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Introduction to design of feedback systems. Properties and advantages of feedback systems. Time-domain and frequency-domain performance measures. Stability and degree of stability. Nyquist criterion. Frequency-domain design. Root locus method. Compensation techniques. Application to a wide variety of physical systems. Some previous laboratory experience with electronic systems is assumed (6.002, 6.071, or 16.04).  4 Engineering Design Points.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.334",
    "academicYear" : "2016",
    "title" : "Power Electronics",
    "cluster" : null,
    "prerequisites" : "6.012",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "The application of electronics to energy conversion and control.  Modeling, analysis, and control techniques.  Design of power circuits including inverters, rectifiers, and dc-dc converters.  Analysis and design of magnetic components and filters.  Characteristics of power semiconductor devices.  Numerous application examples, such as motion control systems, power supplies, and radio-frequency power amplifiers.  6 Engineering Design Points.",
    "instructors" : "D. J. Perreault"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.336",
    "academicYear" : "2016",
    "title" : "Introduction to Numerical Simulation",
    "cluster" : "(Same subject as 2.096J, 16.910J)",
    "prerequisites" : "18.03 or 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to computational techniques for the simulation of a large variety of engineering and engineered systems. Applications drawn from aerospace, mechanical, electrical, and chemical engineering, biology, and materials science. Topics: mathematical formulations; network problems; sparse direct and iterative matrix solution techniques; Newton methods for nonlinear problems; discretization methods for ordinary, time-periodic and partial differential equations; fast methods for partial differential equations and integral equations, techniques for model order reduction of dynamical systems and approaches for molecular dynamics.",
    "instructors" : "L. Daniel, J. K. White"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.337",
    "academicYear" : "2016",
    "title" : "Introduction to Numerical Methods",
    "cluster" : "(Same subject as 18.335J)",
    "prerequisites" : "18.03 or 18.034; 18.06, 18.700, or 18.701",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 18.335J.",
    "instructors" : "W. Shin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.338",
    "academicYear" : "2016",
    "title" : "Parallel Computing",
    "cluster" : "(Same subject as 18.337J)",
    "prerequisites" : "18.06, 18.700, or 18.701",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 18.337J.",
    "instructors" : "A. Edelman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.341",
    "academicYear" : "2016",
    "title" : "Discrete-Time Signal Processing",
    "cluster" : null,
    "prerequisites" : "6.011",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Representation, analysis, and design of discrete time signals and systems. Decimation, interpolation, and sampling rate conversion. Noise shaping. Flowgraph structures for DT systems. Lattice filters. Time- and frequency-domain design techniques for IIR and FIR filters. Parametric signal modeling, linear prediction, and the relation to lattice filters. Discrete Fourier transform (DFT). Computation of the DFT including FFT algorithms. Short-time Fourier analysis and relation to filter banks.  Multirate techniques. Perfect reconstruction filter banks and their relation to wavelets.",
    "instructors" : "A. V. Oppenheim"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.344",
    "academicYear" : "2016",
    "title" : "Digital Image Processing",
    "cluster" : null,
    "prerequisites" : "6.003, 6.041",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Digital images as two-dimensional signals. Digital signal processing theories used for digital image processing, including one-dimensional and two-dimensional convolution, Fourier transform, discrete Fourier transform, and discrete cosine transform. Image processing basics. Image enhancement. Image restoration. Image coding and compression. Video processing including video coding and compression. Additional topics including digital high-definition television systems.",
    "instructors" : "J. S. Lim"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.374",
    "academicYear" : "2016",
    "title" : "Analysis and Design of Digital Integrated Circuits",
    "cluster" : null,
    "prerequisites" : "6.012, 6.004",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Device and circuit level optimization of digital building blocks. MOS device models including Deep Sub-Micron effects. Circuit design styles for logic, arithmetic, and sequential blocks. Estimation and minimization of energy consumption. Interconnect models and parasitics, device sizing and logical effort, timing issues (clock skew and jitter), and active clock distribution techniques. Memory architectures, circuits (sense amplifiers), and devices. Testing of integrated circuits. Extensive custom and standard cell layout and simulation in design projects and software labs.  4 Engineering Design Points.",
    "instructors" : "A. P. Chandrakasan, V. Sze, T. Xanthopoulos"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.376",
    "academicYear" : "2016",
    "title" : "Bioelectronics",
    "cluster" : null,
    "prerequisites" : "6.301",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Comprehensive introduction to analog microelectronic design with an emphasis on ultra-low-power electronics, biomedical electronics, and bio-inspired electronics. Device physics of the MOS transistor, including subthreshold operation and scaling to nanometer processes. Ultra-low-noise, RF, sensor, actuator, and feedback circuits. System examples vary from year to year and include implantable and noninvasive biomedical systems, circuits inspired by neurobiology or cell biology, micromechanical systems (MEMS), and biological sensing and actuating systems. Class project involves a complete design of a VLSI chip, including layout, verification, design-rule checking, and SPICE simulation.  8 Engineering Design Points.",
    "instructors" : "R. Sarpeshkar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.431",
    "academicYear" : "2016",
    "title" : "Applied Probability",
    "cluster" : "(Subject meets with 6.041)",
    "prerequisites" : "Calculus II (GIR)",
    "units" : "4-0-8",
    "optional" : "Credit cannot also be received for 18.600",
    "description" : "Meets with undergraduate subject 6.041. Requires the completion of additional advanced home problems.",
    "instructors" : "D. P. Bertsekas, J. N. Tsitsiklis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.435",
    "academicYear" : "2016",
    "title" : "System Identification",
    "cluster" : null,
    "prerequisites" : "6.241",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Mathematical models of systems from observations of their behavior. Time series, state-space, and input-output models. Model structures, parametrization, and identifiability. Nonparametric methods. Prediction error methods for parameter estimation, convergence, consistency, andasymptotic distribution. Relations to maximum likelihood estimation. Recursive estimation; relation to Kalman filters; structure determination; order estimation; Akaike criterion; and bounded but unknown noise models. Robustness and practical issues.",
    "instructors" : "M. A. Dahleh"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.441",
    "academicYear" : "2016",
    "title" : "Information Theory",
    "cluster" : null,
    "prerequisites" : "6.041",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Mathematical definitions of information measures, convexity, continuity, and variational properties. Lossless source coding; variable-length and block compression; Slepian-Wolf theorem; ergodic sources and Shannon-McMillan theorem. Hypothesis testing, large deviations and I-projection. Fundamental limits of block coding for noisy channels: capacity, dispersion, finite blocklength bounds. Coding with feedback. Joint source-channel problem. Rate-distortion theory, vector quantizers. Advanced topics include Gelfand-Pinsker problem, multiple access channels, broadcast channels  (depending on available time).",
    "instructors" : "M. Medard, Y. Polyanskiy, L. Zheng"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.450",
    "academicYear" : "2016",
    "title" : "Principles of Digital Communication",
    "cluster" : null,
    "prerequisites" : "6.011",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Communication sources and channels; data compression; entropy and the AEP; Lempel-Ziv universal coding; scalar and vector quantization; L2 waveforms; signal space and its representation by sampling and other expansions; aliasing; the Nyquist criterion; PAM and QAM modulation; Gaussian noise and random processes; detection and optimal receivers; fading channels and wireless communication; introduction to communication system design.",
    "instructors" : "M. Medard, L. Zheng"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.521",
    "academicYear" : "2016",
    "title" : "Cellular Biophysics",
    "cluster" : "(Same subject as 2.794J, 20.470J, HST.541J)\n(Subject meets with 2.791J, 6.021J, 20.370J)",
    "prerequisites" : "Physics II (GIR); 18.03; 2.005, 6.002, 6.003, 6.071, 10.301, 20.110, or permission of instructor",
    "units" : "5-2-5",
    "optional" : null,
    "description" : "Meets with undergraduate subject 6.021J. Requires the completion of more advanced home problems and/or an additional project.",
    "instructors" : "J. Han, T. Heldt, J. Voldman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.522",
    "academicYear" : "2016",
    "title" : "Quantitative Physiology: Organ Transport Systems",
    "cluster" : "(Same subject as 2.796J, 20.471J)\n(Subject meets with 2.792J, 6.022J, 20.371J, HST.542J)",
    "prerequisites" : "2.006 or 6.013; 6.021",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Application of the principles of energy and mass flow to major human organ systems. Mechanisms of regulation and homeostasis. Anatomical, physiological and pathophysiological features of the cardiovascular, respiratory and renal systems. Systems, features and devices that are most illuminated by the methods of physical sciences. Laboratory work includes some animal studies. Students taking graduate version complete additional assignments.",
    "instructors" : "T. Heldt, R. G. Mark, C. M. Stultz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.541",
    "academicYear" : "2016",
    "title" : "Speech Communication",
    "cluster" : "(Same subject as 24.968J, HST.710J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Survey of human speech communication with special emphasis on the sound patterns of natural languages. Acoustic theory of speech production; physiologic and acoustic descriptions of phonetic features, prosody, speech perception, speech respiration, and speech motor control. Applications to recognition and generation of speech by machine and to speech disorders. Recommended prerequisite: mathematical background equivalent to 6.003.",
    "instructors" : "L. D. Braida, S. S. Ghosh, R. E. Hillman, S. Shattuck-Hufnagel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.542",
    "academicYear" : "2016",
    "title" : "Laboratory on the Physiology, Acoustics, and Perception of Speech",
    "cluster" : "(Same subject as 24.966J, HST.712J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-2-8",
    "optional" : null,
    "description" : "Experimental investigations of speech processes. Topics: measurement of articulatory movements; measurements of pressures and airflows in speech production; computer-aided waveform analysis and spectral analysis of speech; synthesis of speech; perception and discrimination of speechlike sounds; speech prosody; models for speech recognition; speech development; and other topics. Recommended prerequisites: 6.002 or 18.03.  4 Engineering Design Points.",
    "instructors" : "L. D. Braida, S. Shattuck-Hufnagel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.552",
    "academicYear" : "2016",
    "title" : "Signal Processing by the Auditory System: Perception",
    "cluster" : "(Same subject as HST.716J)",
    "prerequisites" : "6.003; 6.041 or 6.431; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Studies information processing performance of the human auditory system in relation to current physiological knowledge. Examines mathematical models for the quantification of auditory-based behavior and the relation between behavior and peripheral physiology, reflecting the tono-topic organization and stochastic responses of the auditory system. Mathematical models of psychophysical relations, incorporating quantitative knowledge of physiological transformations by the peripheral auditory system.",
    "instructors" : "L. D. Braida"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.555",
    "academicYear" : "2016",
    "title" : "Biomedical Signal and Image Processing",
    "cluster" : "(Same subject as 16.456J, HST.582J)",
    "prerequisites" : "6.003, 2.004, 16.004, or 18.085",
    "units" : "3-4-5",
    "optional" : null,
    "description" : "See description under subject HST.582J.",
    "instructors" : "J. Greenberg, E. Adalsteinsson, W. Wells"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.630",
    "academicYear" : "2016",
    "title" : "Electromagnetics",
    "cluster" : null,
    "prerequisites" : "6.003 or 6.007",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Explores electromagnetic phenomena in modern applications, including wireless and optical communications, circuits, computer interconnects and peripherals, microwave communications and radar, antennas, sensors, micro-electromechanical systems, and power generation and transmission. Fundamentals include quasistatic and dynamic solutions to Maxwell's equations; waves, radiation, and diffraction; coupling to media and structures; guided and unguided waves; modal expansions; resonance; acoustic analogs; and forces, power, and energy.",
    "instructors" : "L. Daniel, M. R. Watts"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.631",
    "academicYear" : "2016",
    "title" : "Optics and Photonics",
    "cluster" : null,
    "prerequisites" : "6.013 or 8.07",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to fundamental concepts and techniques of optics, photonics, and fiber optics. Review of Maxwell's equations, light propagation, and reflection from dielectrics mirrors and filters. Interferometers, filters, and optical imaging systems.  Fresnel and Fraunhoffer diffraction theory. Propagation of Gaussian beams and laser resonator design. Optical waveguides and optical fibers. Optical waveguide and photonic devices.",
    "instructors" : "J. G. Fujimoto"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.632",
    "academicYear" : "2016",
    "title" : "Electromagnetic Wave Theory",
    "cluster" : null,
    "prerequisites" : "6.013, 6.630, or 8.07",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Solutions to Maxwell equations and physical interpretation. Topics include waves in media, equivalence principle, duality and complementarity, Huygens' principle, Fresnel and Fraunhofer diffraction, radiation and dyadic Green's functions, scattering, metamaterials, and plasmonics, mode theory, dielectric waveguides, and resonators. Examples deal with limiting cases of electromagnetic theory, multi-port elements, filters and antennas. Discusses current topics in microwave and photonic devices.",
    "instructors" : "M. R. Watts"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.634",
    "academicYear" : "2016",
    "title" : "Nonlinear Optics",
    "cluster" : "(Same subject as 8.431J)",
    "prerequisites" : "6.013 or 8.07",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Techniques of nonlinear optics with emphasis on fundamentals for research and engineering in optics, photonics, and spectroscopy. Electro optic modulators, harmonic generation, and frequency conversion devices. Nonlinear effects in optical fibers including self-phase modulation, nonlinear wave propagation, and solitons. Interaction of light with matter, laser operation, density matrix techniques, nonlinear spectroscopies, and femtosecond optics.",
    "instructors" : "J. G. Fujimoto"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.637",
    "academicYear" : "2016",
    "title" : "Optical Signals, Devices, and Systems",
    "cluster" : "(Subject meets with 6.161)",
    "prerequisites" : "6.003",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Principles of operation and applications of devices and systems for optical signal generation, transmission, detection, storage, processing and display. Topics include review of the basic properties of electromagnetic waves; coherence and interference; diffraction and holography; Fourier optics; coherent and incoherent imaging and signal processing systems; optical properties of materials; lasers and LEDs; electro-optic and acousto-optic light modulators; photorefractive and liquid-crystal light modulation; spatial light modulators and displays; optical waveguides and fiber-optic communication systems; photodetectors; 2-D and 3-D optical storage technologies; adaptive optical systems; role of optics in next-generation computers. Student research paper on a specific contemporary topic required. Recommended prerequisites: 6.007 or 8.03.",
    "instructors" : "C. Warde"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.652",
    "academicYear" : "2016",
    "title" : "Introduction to Plasma Physics II",
    "cluster" : "(Same subject as 8.614J, 22.612J)",
    "prerequisites" : "6.651J, 8.613J, or 22.611J",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 8.614J.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.673",
    "academicYear" : "2016",
    "title" : "Introduction to Numerical Simulation in Electrical Engineering",
    "cluster" : null,
    "prerequisites" : "6.012 or 6.013",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Selection of a simulation model and physical approximations. Solution of nonlinear coupled PDEs in 1-D through finite difference and finite element methods, Newton's method, and variants. Finite difference and finite element methods in 2-D and sparse matrix methods emphasizing conjugate gradient algorithms. Semiconductor devices used as primary examples; additional examples drawn from E&M modeling, nonlinear pulse propagation, and laser physics.",
    "instructors" : "P. L. Hagelstein"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.685",
    "academicYear" : "2016",
    "title" : "Electric Machines",
    "cluster" : null,
    "prerequisites" : "6.061 or 6.690; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Treatment of electromechanical transducers, rotating and linear electric machines. Lumped-parameter electromechanics. Power flow using Poynting's theorem, force estimation using the Maxwell stress tensor and Principle of virtual work.  Development of analytical techniques for predicting device  characteristics: energy conversion density, efficiency; and of system interaction characteristics: regulation, stability, controllability, and response. Use of electric machines in drive systems. Problems taken from current research.",
    "instructors" : "J. L. Kirtley, Jr."
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.720",
    "academicYear" : "2016",
    "title" : "Integrated Microelectronic Devices",
    "cluster" : "(Same subject as 3.43J)",
    "prerequisites" : "6.012 or 3.42",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Covers physics of microelectronic semiconductor devices for integrated circuit applications. Topics include semiconductor fundamentals, p-n junction, metal-oxide semiconductor structure, metal-semiconductor junction, MOS field-effect transistor, and bipolar junction transistor. Studies modern nanoscale devices, including electrostatic scaling, materials beyond Si, carrier transport from the diffusive to the ballistic regime. Emphasizes physical understanding of device operation through energy band diagrams and short-channel MOSFET device design. Includes device modeling exercises. Familiarity with MATLAB required.  2 Engineering Design Points.",
    "instructors" : "D. A. Antoniadis, J. A. del Alamo, H. L. Tuller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.728",
    "academicYear" : "2016",
    "title" : "Applied Quantum and Statistical Physics",
    "cluster" : null,
    "prerequisites" : "6.003, 18.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Elementary quantum mechanics and statistical physics. Introduces applied quantum physics. Emphasizes experimental basis for quantum mechanics. Applies Schrodinger's equation to the free particle, tunneling, the harmonic oscillator, and hydrogen atom. Variational methods. Elementary statistical physics; Fermi-Dirac, Bose-Einstein, and Boltzmann distribution functions. Simple models for metals, semiconductors, and devices such as electron microscopes, scanning tunneling microscope, thermonic emitters, atomic force microscope, and more.",
    "instructors" : "P. L. Hagelstein"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.730",
    "academicYear" : "2016",
    "title" : "Physics for Solid-State Applications",
    "cluster" : null,
    "prerequisites" : "6.013, 6.728",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Classical and quantum models of electrons and lattice vibrations in solids, emphasizing physical models for elastic properties, electronic transport, and heat capacity. Crystal lattices, electronic energy band structures, phonon dispersion relatons, effective mass theorem, semiclassical equations of motion, electron scattering and semiconductor optical properties. Band structure and transport properties of selected semiconductors. Connection of quantum theory of solids with quasi-Fermi levels and Boltzmann transport used in device modeling.",
    "instructors" : "Q. Hu, R. Ram"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.732",
    "academicYear" : "2016",
    "title" : "Physics of Solids",
    "cluster" : null,
    "prerequisites" : "6.730 or 8.231",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Continuation of 6.730 emphasizing applications-related physical issues in solids. Topics: electronic structure and energy band diagrams of semiconductors, metals, and insulators; Fermi surfaces; dynamics of electrons; classical diffusive transport phenomena such as electrical and thermal conduction and thermoelectric phenomena; quantum transport in tunneling and ballistic devices; optical properties of metals, semiconductors, and insulators; photon-lattice interactions; optical devices based on interband and intersubband transitions; magnetic properties of solids; exchange energy and magnetic ordering; magneto-oscillatory phenomena; quantum Hall effect; superconducting phenomena and simple models.",
    "instructors" : "Q. Hu"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.774",
    "academicYear" : "2016",
    "title" : "Physics of Microfabrication: Front End Processing",
    "cluster" : null,
    "prerequisites" : "6.152",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents advanced physical models and practical aspects of front-end microfabrication processes, such as oxidation, diffusion, ion implantation, chemical vapor deposition, atomic layer deposition, etching, and epitaxy. Covers topics relevant to CMOS, bipolar, and optoelectronic device fabrication, including high k gate dielectrics, gate etching, implant-damage enhanced diffusion, advanced metrology, stress effects on oxidation, non-planar and nanowire device fabrication, SiGe and fabrication of process-induced strained Si. Exposure to CMOS process integration concepts, and impacts of processing on device characteristics. Students use modern process simulation tools.",
    "instructors" : "J. L. Hoyt, L. R. Reif"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.775",
    "academicYear" : "2016",
    "title" : "CMOS Analog and Mixed-Signal Circuit Design",
    "cluster" : null,
    "prerequisites" : "6.301",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A detailed exposition of the principles involved in designing and optimizing analog and mixed-signal circuits in CMOS technologies. Small-signal and large-signal models. Systemic methodology for device sizing and biasing. Basic circuit building blocks. Operational amplifier design. Large signal considerations. Principles of switched capacitor networks including switched-capacitor and continuous-time integrated filters. Basic and advanced A/D and D/A converters, delta-sigma modulators, RF and other signal processing circuits. Design projects on op amps and subsystems are a required part of the subject.  4 Engineering Design Points.",
    "instructors" : "H. S. Lee, C. G. Sodini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.503",
    "academicYear" : "2016",
    "title" : "Foundations of Algorithms and Computational Techniques in Systems Biology",
    "cluster" : "(Subject meets with 6.581J, 20.482J)",
    "prerequisites" : "6.021, 6.034, 6.046, 6.336, 18.417, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Illustrates computational approaches to solving problems in systems biology. Uses a series of case studies to demonstrate how an effective match between the statement of a biological problem and the selection of an appropriate algorithm or computational technique can lead to fundamental advances. Covers several discrete and numerical algorithms used in simulation, feature extraction, and optimization for molecular, network, and systems models in biology. Students taking graduate version complete additional assignments.",
    "instructors" : "B. Tidor, J. K. White"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.580",
    "academicYear" : "2016",
    "title" : "Principles of Synthetic Biology",
    "cluster" : "(Same subject as 20.305J)\n(Subject meets with 6.589J, 20.405J)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 20.305J.",
    "instructors" : "R. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.933",
    "academicYear" : "2016",
    "title" : "Entrepreneurship in Engineering: The Founder's Journey",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Immerses students in the experience of an engineer who founds a start-up company. Examines leadership, innovation, and creativity through the lens of an entrepreneur. Suitable for students interested in transforming an idea into a business or other realization for wide-scale societal impact. Covers critical aspects of validating ideas and assessing personal attributes needed to activate and lead a growing organization. Teams explore the basics of new venture creation and experimentation. Emphasizes personal skills and practical experiences. No listeners.",
    "instructors" : "C. Chase"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.893",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Theoretical Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in theoretical computer science. Specific focus varies from year to year. Consult department for details.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.896",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Graphics and Human-Computer Interfaces",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in graphics and human-computer interfaces. Specific focus varies from year to year. Consult department for details.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.962",
    "academicYear" : "2016",
    "title" : "Independent Study in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for independent study under regular supervision by a faculty member. Projects require prior approval.",
    "instructors" : "L. A. Kolodziejksi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.02",
    "academicYear" : "2016",
    "title" : "Introduction to EECS II",
    "cluster" : null,
    "prerequisites" : "6.01; 18.03 or 18.06",
    "units" : "4-4-4 1/2 Institute LAB",
    "optional" : null,
    "description" : "Explores communication signals, systems and networks. Substantial laboratory experiments illustrate the role of abstraction and modularity in engineering design. Students gain practical experience in building reliable systems using imperfect components; selecting appropriate design metrics; choosing effective representations for information; and evaluating tradeoffs in complex systems. Topics include physical characterization and modeling of transmission systems in the time and frequency domains; analog and digital signaling; coding; detecting and correcting errors; relating information transmission rate to signal power, bandwidth and noise; and engineering of packet-switched networks.  6 Engineering Design Points.",
    "instructors" : "H. Balakrishnan, K. LaCurts, G. C. Verghese,"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.243",
    "academicYear" : "2016",
    "title" : "Dynamics of Nonlinear Systems",
    "cluster" : null,
    "prerequisites" : "6.241; <I>Coreq: 18.100A, 18.100B, or 18.100C</I>",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to nonlinear deterministic dynamical systems. Nonlinear ordinary differential equations. Planar autonomous systems. Fundamental theory: Picard iteration, contraction mapping theorem, and Bellman-Gronwall lemma. Stability of equilibria by Lyapunov's first and second methods. Feedback linearization. Application to nonlinear circuits and control systems.",
    "instructors" : "A. Megretski, M. Dahleh"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.641",
    "academicYear" : "2016",
    "title" : "Electromagnetic Fields, Forces, and Motion",
    "cluster" : null,
    "prerequisites" : "6.013",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Electric and magnetic quasistatic forms of Maxwell's equations applied to dielectric, conduction, and magnetization boundary value problems. Electromagnetic forces, force densities, and stress tensors, including magnetization and polarization. Thermodynamics of electromagnetic fields, equations of motion, and energy conservation. Applications to synchronous, induction, and commutator machines; sensors and transducers; microelectromechanical systems; propagation and stability of electromechanical waves; and charge transport phenomena.",
    "instructors" : "M. Zahn, J. H. Lang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.442",
    "academicYear" : "2016",
    "title" : "Optical Networks",
    "cluster" : null,
    "prerequisites" : "6.041, 6.042",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the fundamental and practical aspects of optical network technology, architecture, design and analysis tools and techniques.  The treatment of optical networks are from the architecture and system design points of view. Optical hardware technologies are introduced and characterized as fundamental network building blocks on which optical transmission systems and network architectures are based. Beyond the Physical Layer, the higher network layers (Media Access Control, Network and Transport Layers) are treated together as integral parts of network design. Performance metrics, analysis and optimization techniques are developed to help guide the creation of high performance complex optical networks.",
    "instructors" : "V. W. S. Chan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.454",
    "academicYear" : "2016",
    "title" : "Graduate Seminar in Area I",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Student-run advanced graduate seminar with focus on topics in  communications, control, signal processing, optimization. Participants give presentations outside of their own research to expose colleagues to topics not covered in the usual curriculum. Recent topics have included compressed sensing, MDL principle, communication complexity, linear programming decoding, biology in EECS, distributed hypothesis testing, algorithms for random satisfaction problems, and cryptogaphy.  Open to advanced students from all areas of EECS. Limited to 12.",
    "instructors" : "L. Zheng, D. Shah"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.339",
    "academicYear" : "2016",
    "title" : "Numerical Methods for Partial Differential Equations",
    "cluster" : "(Same subject as 2.097J, 16.920J)",
    "prerequisites" : "18.03 or 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 16.920J.",
    "instructors" : "Q. Wang, J. K. White"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.850",
    "academicYear" : "2016",
    "title" : "Geometric Computing",
    "cluster" : null,
    "prerequisites" : "6.046",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to the design and analysis of algorithms for geometric problems, in low- and high-dimensional spaces. Algorithms: convex hulls, polygon triangulation, Delaunay triangulation, motion planning, pattern matching. Geometric data structures: point location, Voronoi diagrams, Binary Space Partitions. Geometric problems in higher dimensions: linear programming, closest  pair problems. High-dimensional nearest neighbor search and low-distortion embeddings between metric spaces. Geometric algorithms for massive data sets: external memory and streaming algorithms. Geometric optimization.",
    "instructors" : "P. Indyk"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.870",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Computer Vision",
    "cluster" : null,
    "prerequisites" : "6.801, 6.869, or permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Seminar exploring advanced research topics in the field of computer vision; focus varies with lecturer. Typically structured around discussion of assigned research papers and presentations by students. Example research areas explored in this seminar include learning in vision, computational imaging techniques, multimodal human-computer interaction, biomedical imaging, representation and estimation methods used in modern computer vision.",
    "instructors" : "W. T. Freeman, P. Golland, B. K. P. Horn, A. Torralba"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.780",
    "academicYear" : "2016",
    "title" : "Control of Manufacturing Processes",
    "cluster" : "(Same subject as 2.830J, ESD.63J)",
    "prerequisites" : "2.008, 6.041, 6.152, or 15.064",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.830J.",
    "instructors" : "D. E. Hardt, D. S. Boning"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.456",
    "academicYear" : "2016",
    "title" : "Array Processing",
    "cluster" : null,
    "prerequisites" : "6.341; 2.687, or 6.011 and 18.06",
    "units" : "3-2-7",
    "optional" : null,
    "description" : "Adaptive and non-adaptive processing of signals received at arrays of sensors. Deterministic beamforming, space-time random processes, optimal and adaptive algorithms, and the sensitivity of algorithm performance to modeling errors and limited data. Methods of improving the robustness of algorithms to modeling errors and limited data are derived.  Advanced topics include an introduction to matched field processing and physics-based methods of estimating signal statistics. Homework exercises providing the opportunity to implement and analyze the performance of algorithms in processing data supplied during the course.",
    "instructors" : "J. Preisig"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.701",
    "academicYear" : "2016",
    "title" : "Introduction to Nanoelectronics",
    "cluster" : "(Subject meets with 6.719)",
    "prerequisites" : "6.003",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Transistors at the nanoscale. Quantization, wavefunctions, and Schrodinger's equation. Introduction to electronic properties of molecules, carbon nanotubes, and crystals. Energy band formation and the origin of metals, insulators and semiconductors. Ballistic transport, Ohm's law, ballistic versus traditional MOSFETs, fundamental limits to computation.",
    "instructors" : "M. A. Baldo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.005",
    "academicYear" : "2016",
    "title" : "Elements of Software Construction",
    "cluster" : null,
    "prerequisites" : "6.01; <I>Coreq: 6.042</I>",
    "units" : "4-0-8 REST",
    "optional" : null,
    "description" : "Introduces fundamental principles and techniques of software development, i.e., how to write software that is safe from bugs, easy to understand, and ready for change. Topics include specifications and invariants; testing, test-case generation, and coverage; abstract data types and representation independence; design patterns for object-oriented programming; concurrent programming, including message passing and shared concurrency, and defending against races and deadlock; and functional programming with immutable data and higher-order functions. Includes weekly programming exercises and larger group programming projects. 12 Engineering Design Points.",
    "instructors" : "D. N. Jackson, R. C. Miller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.006",
    "academicYear" : "2016",
    "title" : "Introduction to Algorithms",
    "cluster" : null,
    "prerequisites" : "6.01, 6.042",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to mathematical modeling of computational problems, as well as common algorithms, algorithmic paradigms, and data structures used to solve these problems. Emphasizes the relationship between algorithms and programming, and introduces basic performance measures and analysis techniques for these problems.",
    "instructors" : "R. L. Rivest, S. Devadas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.007",
    "academicYear" : "2016",
    "title" : "Electromagnetic Energy: From Motors to Solar Cells",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR); <I>Coreq: 18.03</I>",
    "units" : "5-1-6",
    "optional" : null,
    "description" : "Discusses applications of electromagnetic and equivalent quantum mechanical principles to classical and modern devices. Covers energy conversion and power flow in both macroscopic and quantum-scale electrical and electromechanical systems, including electric motors and generators, electric circuit elements, quantum tunneling structures and instruments. Studies photons as waves and particles and their interaction with matter in optoelectronic devices, including solar cells and displays.",
    "instructors" : "V. Bulovic, R. J. Ram"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.01",
    "academicYear" : "2016",
    "title" : "Introduction to EECS I",
    "cluster" : null,
    "prerequisites" : "None. <I>Coreq: Physics II (GIR)</I>",
    "units" : "2-4-6 1/2 Institute LAB",
    "optional" : null,
    "description" : "An integrated introduction to electrical engineering and computer science, taught using substantial laboratory experiments with mobile robots. Key issues in the design of engineered artifacts operating in the natural world: measuring and modeling system behaviors; assessing errors in sensors and effectors; specifying tasks; designing solutions based on analytical and computational models; planning, executing, and evaluating experimental tests of performance; refining models and designs. Issues addressed in the context of computer programs, control systems, probabilistic inference problems, circuits and transducers, which all play important roles in achieving robust operation of a large variety of engineered systems.  6 Engineering Design Points.",
    "instructors" : "D. M. Freeman, A. Hartz, L. P. Kaelbling, T. Lozano-Perez"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.556",
    "academicYear" : "2016",
    "title" : "Data Acquisition and Image Reconstruction in MRI",
    "cluster" : "(Same subject as HST.580J)",
    "prerequisites" : "6.011",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Applies analysis of signals and noise in linear systems, sampling, and Fourier properties to magnetic resonance (MR) imaging acquisition and reconstruction. Provides adequate foundation for MR physics to enable study of RF excitation design, efficient Fourier sampling, parallel encoding, reconstruction of non-uniformly sampled data, and the impact of hardware imperfections on reconstruction performance. Surveys active areas of MR research. Assignments include Matlab-based work with real data. Includes visit to a scan site for human MR studies.",
    "instructors" : "E. Adalsteinsson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.345",
    "academicYear" : "2016",
    "title" : "Automatic Speech Recognition",
    "cluster" : "(Same subject as HST.728J)",
    "prerequisites" : "6.003, 6.041, or permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Introduces the rapidly developing fields of automatic speech recognition and spoken language processing. Topics include acoustic theory of speech production and perception, acoustic-phonetics, signal representation, acoustic and language modeling, search, hidden Markov modeling, robustness, adaptation, discriminative and alternative approaches.  Lectures interspersed with theory and applications.  Assignments include problems, laboratory exercises, and a term project.  4 Engineering Design Points.",
    "instructors" : "V. W. Zue, J. R. Glass"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.960",
    "academicYear" : "2016",
    "title" : "Introductory Research in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Enrollment restricted to first-year graduate students in Electrical Engineering and Computer Science who are doing introductory research leading to an SM, EE, ECS, PhD, or ScD thesis. Opportunity to become involved in graduate research, under guidance of a staff member, on a problem of mutual interest to student and supervisor. Individual programs subject to approval of professor in charge.",
    "instructors" : "L. A. Kolodziejski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.835",
    "academicYear" : "2016",
    "title" : "Intelligent Multimodal User Interfaces",
    "cluster" : null,
    "prerequisites" : "6.034, 6.005, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Implementation and evaluation of intelligent multi-modal user interfaces, taught from a combination of hands-on exercises and papers from the original literature. Topics include basic technologies for handling speech, vision, pen-based interaction, and other modalities, as well as various techniques for combining modalities. Substantial readings and a term project, where students build an interface to illustrate one or more themes of the course.  8 Engineering Design Points.",
    "instructors" : "R. Davis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.781",
    "academicYear" : "2016",
    "title" : "Nanostructure Fabrication",
    "cluster" : "(Same subject as 2.391J)",
    "prerequisites" : "6.152, 6.161, or 2.710; or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Describes current techniques used to analyze and fabricate nanometer-length-scale structures and devices. Emphasizes imaging and patterning of nanostructures, including fundamentals of optical, electron (scanning, transmission, and tunneling), and atomic-force microscopy; optical, electron, ion, and nanoimprint lithography, templated self-assembly, and resist technology. Surveys substrate characterization and preparation, facilities, and metrology requirements for nanolithography. Addresses nanodevice processing methods, such as liquid and plasma etching, lift-off, electroplating, and ion-implant. Discusses applications in nanoelectronics, nanomaterials, and nanophotonics.",
    "instructors" : "H. I. Smith, G. Barbastathis, K. K. Berggren"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.828",
    "academicYear" : "2016",
    "title" : "Operating System Engineering",
    "cluster" : null,
    "prerequisites" : "6.005, 6.033",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "Fundamental design and implementation issues in the engineering of operating systems.  Lectures based on the study of a symmetric multiprocessor version of UNIX version 6 and research papers. Topics include virtual memory; file system; threads; context switches; kernels; interrupts; system calls; interprocess communication; coordination, and interaction between software and hardware. Individual laboratory assignments accumulate in the construction of a minimal operating system (for an x86-based personal computer) that implements the basic operating system abstractions and a shell. Knowledge of programming in the C language is a prerequisite.  6 Engineering Design Points.",
    "instructors" : "M. F. Kaashoek"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.265",
    "academicYear" : "2016",
    "title" : "Advanced Stochastic Processes",
    "cluster" : "(Same subject as 15.070J)",
    "prerequisites" : "6.431, 15.085J, 18.100A, 18.100B, or 18.100C",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 15.070J.",
    "instructors" : "D. Gamarnik, D. Shah"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.719",
    "academicYear" : "2016",
    "title" : "Nanoelectronics",
    "cluster" : "(Subject meets with 6.701)",
    "prerequisites" : "6.003",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Meets with undergraduate subject 6.701, but requires the completion of additional/different homework assignments and or projects. See subject description under 6.701.",
    "instructors" : "M. A. Baldo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.945",
    "academicYear" : "2016",
    "title" : "Large-scale Symbolic Systems",
    "cluster" : "(Subject meets with 6.905)",
    "prerequisites" : "6.034 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Concepts and techniques for the design and implementation of large software systems that can be adapted to uses not anticipated by the designer. Applications include compilers, computer-algebra systems, deductive systems, and some artificial intelligence applications. Covers means for decoupling goals from strategy, mechanisms for implementing additive data-directed invocation, work with partially-specified entities, and how to manage multiple viewpoints. Topics include combinators, generic operations, pattern matching, pattern-directed invocation, rule systems, backtracking, dependencies, indeterminacy, memoization, constraint propagation, and incremental refinement. Students taking graduate version complete additional assignments.",
    "instructors" : "G. J. Sussman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.438",
    "academicYear" : "2016",
    "title" : "Algorithms for Inference",
    "cluster" : null,
    "prerequisites" : "6.008 or 6.041 or 6.436; 18.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to statistical inference with probabilistic graphical models.  Directed and undirected graphical models, and factor graphs, over discrete and Gaussian distributions; hidden Markov models, linear dynamical systems.  Sum-product and junction tree algorithms; forward-backward algorithm, Kalman filtering and smoothing.  Min-sum and Viterbi algorithms.  Variational methods, mean-field theory, and loopy belief propagation.  Particle methods and filtering.  Building graphical models from data, including parameter estimation and structure learning; Baum-Welch and Chow-Liu algorithms.   Selected special topics.",
    "instructors" : "P. Golland, G. W. Wornell, D. Shah"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.865",
    "academicYear" : "2016",
    "title" : "Advanced Computational Photography",
    "cluster" : "(Subject meets with 6.815)",
    "prerequisites" : "Calculus II (GIR), 6.005",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents fundamentals and applications of hardware and software techniques used in digital and computational photography, with an emphasis on software methods. Provides sufficient background to implement solutions to photographic challenges and opportunities. Topics include cameras and image formation, image processing and image representations, high-dynamic-range imaging, human visual perception and color, single view 3-D model reconstruction, morphing, data-rich photography, super-resolution, and image-based rendering. Students taking graduate version complete additional assignments.",
    "instructors" : "F. P. Durand"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.935",
    "academicYear" : "2016",
    "title" : "Financial Market Dynamics and Human Behavior",
    "cluster" : "(Same subject as 15.481J)",
    "prerequisites" : "15.401, 15.414, or 15.415",
    "units" : "4-0-5",
    "optional" : null,
    "description" : "See description under subject 15.481J.",
    "instructors" : "A. Lo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.452",
    "academicYear" : "2016",
    "title" : "Principles of Wireless Communication",
    "cluster" : null,
    "prerequisites" : "6.450",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to design, analysis, and fundamental limits of wireless transmission systems.  Wireless channel and system models; fading and diversity; resource management and power control; multiple-antenna and MIMO systems; space-time codes and decoding algorithms; multiple-access techniques and multiuser detection; broadcast codes and precoding; cellular and ad-hoc network topologies; OFDM and ultrawideband systems; architectural issues.",
    "instructors" : "G. W. Wornell, L. Zheng"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.131",
    "academicYear" : "2016",
    "title" : "Power Electronics Laboratory",
    "cluster" : null,
    "prerequisites" : "6.002, 6.003, or 6.007",
    "units" : "3-6-3 Institute LAB",
    "optional" : null,
    "description" : "Introduces the design and construction of power electronic circuits and motor drives.  Laboratory exercises include the construction of drive circuitry for an electric go-cart, flash strobes, computer power supplies, three-phase inverters for AC motors, and resonant drives for lamp ballasts and induction heating. Basic electric machines introduced include DC, induction, and permanent magnet motors, with drive considerations. Final project may be expanded to serve as a 6.UAP project, with instructor permission.  Provides instruction in written and oral communication. 12 Engineering Design Points.",
    "instructors" : "S. B. Leeb"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.839",
    "academicYear" : "2016",
    "title" : "Advanced Computer Graphics",
    "cluster" : null,
    "prerequisites" : "18.06, 6.005, 6.837, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A graduate level course investigates computational problems in rendering, animation, and geometric modeling.  The course draws on advanced techniques from computational geometry, applied mathematics, statistics, scientific computing and other.  Substantial programming experience required.",
    "instructors" : "W. Matusik"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S08",
    "academicYear" : "2016",
    "title" : "Special Subject: Interconnected Embedded Systems",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-5-6 Institute LAB",
    "optional" : null,
    "description" : "Introduction to embedded systems in the context of connected devices, wearables and the \"Internet of Things\". Topics include microcontrollers, energy utilization, algorithmic efficiency, interfacing with sensors, networking, cryptography, local versus distributed computation, data analytics, and 3D printing. Students will design, make, and program an internet-connected wearable device. Final project where student teams will design and demo their own cloud-connected wearable system. Licensed for Spring 2016 by the Committee on Curricula. Enrollment limited; preference to first- and second-year students.",
    "instructors" : "J. Voldman, J. D. Steinmeyer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.UAP",
    "academicYear" : "2016",
    "title" : "Undergraduate Advanced Project",
    "cluster" : null,
    "prerequisites" : "6.UAT",
    "units" : "0-6-0",
    "optional" : "Can be repeated for credit",
    "description" : "Research project for those students completing the SB degree, to be arranged by the student and an appropriate MIT faculty member.  Students who register for this subject must consult the department undergraduate office. Students engage in extensive written communications exercises.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.UAT",
    "academicYear" : "2016",
    "title" : "Oral Communication",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "Provides instruction in aspects of effective technical oral presentations and exposure to communication skills useful in a workplace setting. Students create, give and revise a number of presentations of varying length targeting a range of different audiences.",
    "instructors" : "T. L. Eng"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.853",
    "academicYear" : "2016",
    "title" : "Topics in Algorithmic Game Theory",
    "cluster" : null,
    "prerequisites" : "6.006 or 6.046",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents research topics at the interface of computer science and game theory, with an emphasis on algorithms and computational complexity. Explores the types of game-theoretic tools that are applicable to computer systems, the loss in system performance due to the conflicts of interest of users and administrators, and the design of systems whose performance is robust with respect to conflicts of interest inside the system. Algorithmic focus is on algorithms for equilibria, the complexity of equilibria and fixed points, algorithmic tools in mechanism design, learning in games, and the price of anarchy.",
    "instructors" : "K. Daskalakis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.453",
    "academicYear" : "2016",
    "title" : "Quantum Optical Communication",
    "cluster" : null,
    "prerequisites" : "6.011, 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Quantum optics: Dirac notation quantum mechanics; harmonic oscillator quantization; number states, coherent states, and squeezed states; radiation field quantization and quantum field propagation; P-representation and classical fields. Linear loss and linear amplification: commutator preservation and the Uncertainty Principle; beam splitters; phase-insensitive and phase-sensitive amplifiers. Quantum photodetection: direct detection, heterodyne detection, and homodyne detection. Second-order nonlinear optics: phasematched interactions; optical parametric amplifiers; generation of squeezed states, photon-twin beams, non-classical fourth-order interference, and polarization entanglement. Quantum systems theory: optimum binary detection; quantum precision measurements; quantum cryptography; and quantum teleportation.",
    "instructors" : "J. H. Shapiro"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.THM",
    "academicYear" : "2016",
    "title" : "Master of Engineering Program Thesis",
    "cluster" : null,
    "prerequisites" : "6.UAT",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of an MEng thesis; to be arranged by the student and an appropriate MIT faculty member. Restricted to MEng students who have been admitted to the MEng program.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.253",
    "academicYear" : "2016",
    "title" : "Convex Analysis and Optimization",
    "cluster" : null,
    "prerequisites" : "18.06; 18.100A, 18.100B, or 18.100C",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Core analytical issues of continuous optimization, duality, and saddle point theory, and development using a handful of unifying principles that can be easily visualized and readily understood. Discusses in detail the mathematical theory of convex sets and functions which are the basis for an intuitive, highly visual, geometrical approach to the subject. Convex optimization algorithms focus on large-scale problems, drawn from several types of applications, such as resource allocation and machine learning. Includes batch and incremental subgradient, cutting plane, proximal, and bundle methods.",
    "instructors" : "D. P. Bertsekas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.882",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Artificial Intelligence",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.883",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Artificial Intelligence",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.884",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Artificial Intelligence",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in artificial intelligence. Specific focus varies from year to year. Consult department for details.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.581",
    "academicYear" : "2016",
    "title" : "Foundations of Algorithms and Computational Techniques in Systems Biology",
    "cluster" : "(Same subject as 20.482J)\n(Subject meets with 6.503)",
    "prerequisites" : "6.021, 6.034, 6.046, 6.336, 7.91, 18.417, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Illustrates computational approaches to solving problems in systems biology. Uses a series of case studies to demonstrate how an effective match between the statement of a biological problem and the selection of an appropriate algorithm or computational technique can lead to fundamental advances. Covers several discrete and numerical algorithms used in simulation, feature extraction, and optimization for molecular, network, and systems models in biology. Students taking graduate version complete additional assignments.",
    "instructors" : "B. Tidor, J. K. White"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.869",
    "academicYear" : "2016",
    "title" : "Advances in Computer Vision",
    "cluster" : "(Subject meets with 6.819)",
    "prerequisites" : "6.041 or 6.042; 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Advanced topics in computer vision with a focus on the use of machine learning techniques and applications in graphics and human-computer interface. Covers image representations, texture models, structure-from-motion algorithms, Bayesian techniques, object and scene recognition, tracking, shape modeling, and image databases. Applications may include face recognition, multimodal interaction, interactive systems, cinematic special effects, and photorealistic rendering. Covers topics complementary to 6.866. Students taking graduate version complete additional assignments.",
    "instructors" : "W. T. Freeman, A. Torralba"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.789",
    "academicYear" : "2016",
    "title" : "Organic Optoelectronics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "4-1-7",
    "optional" : null,
    "description" : "Examines optical and electronic processes in organic molecules and polymers that govern the behavior of practical organic optoelectronic devices. Electronic structure of a single organic molecule is used as a guide to the electronic behavior of organic aggregate structures. Emphasis on use of organic thin films in active organic devices including organic LEDs, solar cells, photodetectors, transistors, chemical sensors, memory cells, electrochromic devices, as well as xerography and organic nonlinear optics. Reaching the ultimate miniaturization limit of molecular electronics and related nanoscale patterning techniques of  organic materials are discussed. Laboratory sessions are conducted in a research laboratory environment with the goal of exposing students to material deposition and device testing techniques.",
    "instructors" : "V. Bulovic"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.651",
    "academicYear" : "2016",
    "title" : "Introduction to Plasma Physics I",
    "cluster" : "(Same subject as 8.613J, 22.611J)",
    "prerequisites" : "6.013 or 8.07; 18.04 or <I>Coreq: 18.075</I>",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 22.611J.",
    "instructors" : "A. White"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.434",
    "academicYear" : "2016",
    "title" : "Statistics for Engineers and Scientists",
    "cluster" : "(Same subject as 16.391J)",
    "prerequisites" : "Calculus II (GIR), 18.06, 6.431, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Rigorous introduction to fundamentals of statistics motivated by engineering applications. Topics include exponential families, order statistics, sufficient statistics, estimation theory, hypothesis testing, measures of performance, notions of optimality, analysis of variance (ANOVA), simple linear regression, and selected topics.",
    "instructors" : "M. Win, J. N. Tsitsiklis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.642",
    "academicYear" : "2016",
    "title" : "Continuum Electromechanics",
    "cluster" : null,
    "prerequisites" : "6.641 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Laws, approximations, and relations of continuum mechanics.  Mechanical and electromechanical transfer relations. Statics and dynamics of electromechanical systems having a static equilibrium. Electromechanical flows. Field coupling with thermal and molecular diffusion.  Electrokinetics. Streaming interactions. Application to materials processing, magnetohydrodynamic and electrohydrodynamic pumps and generators, ferrohydrodynamics, physiochemical systems, heat transfer, continuum feedback control, electron beam devices, and plasma dynamics.",
    "instructors" : "M. Zahn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.831",
    "academicYear" : "2016",
    "title" : "User Interface Design and Implementation",
    "cluster" : "(Subject meets with 6.813)",
    "prerequisites" : "6.005 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Examines human-computer interaction in the context of graphical user interfaces. Covers human capabilities, design principles, prototyping techniques, evaluation techniques, and the implementation of graphical user interfaces. Includes short programming assignments and a semester-long group project. Students taking the graduate version also have readings from current literature and additional assignments. Enrollment limited.  6 Engineering Design Points.",
    "instructors" : "R. C. Miller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.717",
    "academicYear" : "2016",
    "title" : "Design and Fabrication of Microelectromechanical Systems",
    "cluster" : "(Same subject as 2.374J)\n(Subject meets with 2.372J, 6.777J)",
    "prerequisites" : "6.003 or 2.003, Physics II (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides an introduction to microsystem design. Covers material properties, microfabrication technologies, structural behavior, sensing methods, electromechanical actuation, thermal actuation and control, multi-domain modeling, noise, and microsystem packaging. Applies microsystem modeling, and manufacturing principles to the design and analysis a variety of microscale sensors and actuators (e.g., optical MEMS, bioMEMS, and inertial sensors). Emphasizes modeling and simulation in the design process. Students taking the graduate version complete additional assignments.  4 Engineering Design Points.",
    "instructors" : "D. Weinstein"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.589",
    "academicYear" : "2016",
    "title" : "Principles of Synthetic Biology",
    "cluster" : "(Same subject as 20.405J)\n(Subject meets with 6.580J, 20.305J)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 20.405J.",
    "instructors" : "R. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.845",
    "academicYear" : "2016",
    "title" : "Quantum Complexity Theory",
    "cluster" : null,
    "prerequisites" : "6.045, 6.840, 18.435",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to quantum computational complexity theory, the study of the fundamental capabilities and limitations of quantum computers. Topics include complexity classes, lower bounds, communication complexity, proofs and advice, and interactive proof systems in the quantum world; classical simulation of quantum circuits. The objective is to bring students to the research frontier.",
    "instructors" : "S. Aaronson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.0001",
    "academicYear" : "2016",
    "title" : "Introduction to Computer Science Programming in Python",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-3-1",
    "optional" : null,
    "description" : "Introduction to computer science and programming for students with little or no programming experience. Students develop skills to program and use computational techniques to solve problems. Topics include the notion of computation, Python, simple algorithms and data structures, testing and debugging, and algorithmic complexity. Combination of 6.0001 and 6.0002 counts as REST subject.",
    "instructors" : "J. V. Guttag"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.437",
    "academicYear" : "2016",
    "title" : "Inference and Information",
    "cluster" : null,
    "prerequisites" : "6.008, 6.041, or 6.436",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to principles of Bayesian and non-Bayesian statistical inference. Hypothesis testing and parameter estimation, sufficient statistics; exponential families. EM agorithm. Log-loss inference criterion, entropy and model capacity.  Kullback-Leibler distance and information geometry. Asymptotic analysis and large deviations theory.  Model  order estimation; nonparametric statistics.  Computational issues and approximation techniques; Monte Carlo methods.  Selected special topics such as universal prediction and compression.",
    "instructors" : "P. Golland, G. W. Wornell"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.047",
    "academicYear" : "2016",
    "title" : "Computational Biology: Genomes, Networks, Evolution",
    "cluster" : "(Subject meets with 6.878J, HST.507J)",
    "prerequisites" : "6.006, 6.041, Biology (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers the algorithmic and machine learning foundations of computational biology, combining theory with practice. Principles of algorithm design, influential problems and techniques, and analysis of large-scale biological datasets. Topics include (a) genomes: sequence analysis, gene finding, RNA folding, genome alignment and assembly, database search; (b) networks: gene expression analysis, regulatory motifs, biological network analysis; (c) evolution: comparative genomics, phylogenetics, genome duplication, genome rearrangements, evolutionary theory.  These are coupled with fundamental algorithmic techniques including: dynamic programming, hashing, Gibbs sampling, expectation maximization, hidden Markov models, stochastic context-free grammars, graph clustering, dimensionality reduction, Bayesian networks.",
    "instructors" : "M. Kellis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.07",
    "academicYear" : "2016",
    "title" : "Projects in Microscale Engineering for the Life Sciences",
    "cluster" : "(Same subject as HST.410J)",
    "prerequisites" : "None",
    "units" : "2-4-3",
    "optional" : null,
    "description" : "See description under subject HST.410J.",
    "instructors" : "D. Freeman, M. Gray"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.141",
    "academicYear" : "2016",
    "title" : "Robotics: Science and Systems I",
    "cluster" : "(Same subject as 16.405J)",
    "prerequisites" : "1.00 or 6.0001; 2.003, 6.005, 6.006, or 16.004; or permission of instructor",
    "units" : "2-6-4 Institute LAB",
    "optional" : null,
    "description" : "Presents concepts, principles, and algorithms for sensing and computation related to the physical world. Topics include motion planning, geometric reasoning, kinematics and dynamics, state estimation, tracking, map building, manipulation, human-robot interaction, fault diagnosis, and embedded system development. Students specify and design a small-scale yet complex robot capable of real-time interaction with the natural world. Students may continue content in 6.142. Prior knowledge of one or more of the following areas would be useful: control (2.004, 6.302, or 16.30); software (1.00, 6.005, 6.0001, 6.0002, or 16.35); electronics (6.002, 6.070, 6.111, or 6.115); mechanical engineering (2.007); or independent experience in 6.146 competition or a relevant UROP. Students engage in extensive written and oral communication exercises. Enrollment limited. 12 Engineering Design Points.",
    "instructors" : "S. Karaman, D. Rus"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.142",
    "academicYear" : "2016",
    "title" : "Robotics: Science and Systems II",
    "cluster" : "(Same subject as 16.406J)",
    "prerequisites" : "6.141 or permission of instructor",
    "units" : "2-6-4",
    "optional" : null,
    "description" : "Implementation and operation of the embedded system designed in 6.141. Addresses open research issues such as sustained autonomy, situational awareness, and human interaction. Students carry out experiments to assess their design and deliver a final written report. Prior knowledge of one or more of the following areas would be useful: control (2.004, 6.302, or 16.30), software (1.00, 6.005, or 6.0001, 6.0002, 16.35), electronics (6.002, 6.070, 6.111, or 6.115), mechanical engineering (2.007), or independent experience (6.146 competitions or a UROP). 12 Engineering Design Points.",
    "instructors" : "D. Rus, N. Roy"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.832",
    "academicYear" : "2016",
    "title" : "Underactuated Robotics",
    "cluster" : null,
    "prerequisites" : "6.141, 2.12, 2.165, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers nonlinear dynamics and control of underactuated mechanical systems, with an emphasis on computational methods. Topics include nonlinear dynamics of passive robots (walkers, swimmers, flyers), motion planning, robust and optimal control, reinforcement learning/approximate optimal control, and the influence of mechanical design on control. Includes examples from biology and applications to legged locomotion, compliant manipulation, underwater robots, and flying machines.",
    "instructors" : "R. Tedrake"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.842",
    "academicYear" : "2016",
    "title" : "Randomness and Computation",
    "cluster" : null,
    "prerequisites" : "6.046, 6.840",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "The power and sources of randomness in computation. Connections and applications to computational complexity, computational learning theory, cryptography and combinatorics. Topics include: probabilistic proofs, uniform generation and approximate counting, Fourier analysis of Boolean functions, computational learning theory, expander graphs, pseudorandom generators, derandomization.",
    "instructors" : "R. Rubinfeld"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.815",
    "academicYear" : "2016",
    "title" : "Digital and Computational Photography",
    "cluster" : "(Subject meets with 6.865)",
    "prerequisites" : "Calculus II (GIR), 6.005",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents fundamentals and applications of hardware and software techniques used in digital and computational photography, with an emphasis on software methods. Provides sufficient background to implement solutions to photographic challenges and opportunities. Topics include cameras and image formation, image processing and image representations, high-dynamic-range imaging, human visual perception and color, single view 3-D model reconstruction, morphing, data-rich photography, super-resolution, and image-based rendering. Students taking graduate version complete additional assignments.  6 Engineering Design Points.",
    "instructors" : "F. P. Durand"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.256",
    "academicYear" : "2016",
    "title" : "Algebraic Techniques and Semidefinite Optimization",
    "cluster" : null,
    "prerequisites" : "6.251 or 6.255",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Theory and computational techniques for optimization problems involving polynomial equations and inequalities with particular, emphasis on the connections with semidefinite optimization. Develops algebraic and numerical approaches of general applicability, with a view towards methods that simultaneously incorporate both elements, stressing convexity-based ideas, complexity results, and efficient implementations. Examples from several engineering areas, in particular systems and control applications. Topics include semidefinite programming, resultants/discriminants, hyperbolic polynomials, Groebner bases, quantifier elimination, and sum of squares.",
    "instructors" : "P. Parrilo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.440",
    "academicYear" : "2016",
    "title" : "Essential Coding Theory",
    "cluster" : null,
    "prerequisites" : "6.006, 6.045",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the theory of error-correcting codes. Focuses on the essential results in the area, taught from first principles. Special focus on results of asymptotic or algorithmic significance. Principal topics include construction and existence results for error-correcting codes; limitations on the combinatorial performance of error-correcting codes; decoding algorithms; and applications to other areas of mathematics and computer science.",
    "instructors" : "M. Sudan, D. Moshkovitz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.608",
    "academicYear" : "2016",
    "title" : "Introduction to Particle Accelerators",
    "cluster" : "(Same subject as 8.277J)",
    "prerequisites" : "6.013 or 8.07; permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 8.277J.",
    "instructors" : "W. Barletta"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.920",
    "academicYear" : "2016",
    "title" : "Practical Work Experience",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "0-1-0 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For Course 6 students participating in curriculum-related off-campus work experiences in electrical engineering or computer science. Before enrolling, students must have an employment offer from a company or organization and must find an EECS supervisor. Upon completion of the work the student must submit a letter from the employer evaluating the work accomplished, a substantive final report from the student, approved by the MIT supervisor. Subject to departmental approval. Consult Department Undergraduate Office for details on procedures and restrictions.",
    "instructors" : "A. R. Meyer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.375",
    "academicYear" : "2016",
    "title" : "Complex Digital Systems Design",
    "cluster" : null,
    "prerequisites" : "6.004",
    "units" : "5-5-2",
    "optional" : null,
    "description" : "Introduction to the design and implementation of large-scale digital systems using hardware description languages and high-level synthesis tools in conjunction with standard commercial electronic design automation (EDA) tools. Emphasizes modular and robust designs, reusable modules, correctness by construction, architectural exploration, meeting area and timing constraints, and developing functional field-programmable gate array (FPGA) prototypes. Extensive use of CAD tools in weekly labs serve as preparation for a multi-person design project on multi-million gate FPGAs. Enrollment may be limited. 12 Engineering Design Points.",
    "instructors" : "Arvind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.013",
    "academicYear" : "2016",
    "title" : "Electromagnetics and Applications",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR), Physics II (GIR)",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Analysis and design of modern applications that employ electromagnetic phenomena, including signal and power transmission in guided communication systems and wireless and optical communications. Fundamentals include dynamic solutions to Maxwell's equations; electromagnetic power and energy, waves in media, guided waves, radiation, and diffraction; coupling to media and structures; resonance; and acoustic analogs.",
    "instructors" : "L. Daniel, M. R. Watts"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.888",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Computer Systems",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in computer systems. Specific focus varies from year to year. Consult department for details.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.023",
    "academicYear" : "2016",
    "title" : "Fields, Forces and Flows in Biological Systems",
    "cluster" : "(Same subject as 2.793J, 20.330J)",
    "prerequisites" : "Physics II (GIR); 2.005, 6.021, 20.320, or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 20.330J.",
    "instructors" : "J. Han, S. Manalis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.524",
    "academicYear" : "2016",
    "title" : "Molecular, Cellular, and Tissue Biomechanics",
    "cluster" : "(Same subject as 2.798J, 3.971J, 10.537J, 20.410J)",
    "prerequisites" : "Biology (GIR); 2.002, 2.006, 6.013, 10.301, or 10.302",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 20.410J.",
    "instructors" : "R. D. Kamm, K. Van Vliet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.561",
    "academicYear" : "2016",
    "title" : "Fields, Forces, and Flows in Biological Systems",
    "cluster" : "(Same subject as 2.795J, 10.539J, 20.430J)",
    "prerequisites" : "6.013, 2.005, 10.302, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 20.430J.",
    "instructors" : "M. Bathe, A. J. Grodzinsky"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.804",
    "academicYear" : "2016",
    "title" : "Computational Cognitive Science",
    "cluster" : "(Same subject as 9.66J)\n(Subject meets with 9.660)",
    "prerequisites" : "9.40, 18.05, 18.600, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 9.66J.",
    "instructors" : "J. Tenenbaum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.436",
    "academicYear" : "2016",
    "title" : "Fundamentals of Probability",
    "cluster" : "(Same subject as 15.085J)",
    "prerequisites" : "Calculus II (GIR)",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to probability theory. Probability spaces and measures. Discrete and continuous random variables. Conditioning and independence. Multivariate normal distribution. Abstract integration, expectation, and related convergence results. Moment generating and  characteristic functions. Bernoulli and Poisson process. Finite-state  Markov chains. Convergence notions and their relations. Limit theorems. Familiarity with elementary notions in probability and real analysis is desirable.",
    "instructors" : "J. N. Tsitsiklis, D. Gamarnik"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.851",
    "academicYear" : "2016",
    "title" : "Advanced Data Structures",
    "cluster" : null,
    "prerequisites" : "6.046",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "More advanced and powerful data structures for answering several queries on the same data. Such structures are crucial in particular for designing efficient algorithms. Dictionaries; hashing; search trees. Self-adjusting data structures; linear search; splay trees; dynamic optimality. Integer data structures; word RAM. Predecessor problem; van Emde Boas priority queues; y-fast trees; fusion trees. Lower bounds; cell-probe model; round elimination. Dynamic graphs; link-cut trees; dynamic connectivity. Strings; text indexing; suffix arrays; suffix trees. Static data structures; compact arrays; rank and select. Succinct data structures; tree encodings; implicit data structures. External-memory and cache-oblivious data structures; B-trees; buffer trees; tree layout; ordered-file maintenance. Temporal data structures; persistence; retroactivity.",
    "instructors" : "E. D. Demaine"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.830",
    "academicYear" : "2016",
    "title" : "Database Systems",
    "cluster" : "(Subject meets with 6.814)",
    "prerequisites" : "6.033; 6.046 or 6.006; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Topics related to the engineering and design of database systems, including data models; database and schema design; schema normalization and integrity constraints; query processing; query optimization and cost estimation; transactions; recovery; concurrency control; isolation and consistency; distributed, parallel and heterogeneous databases; adaptive databases; trigger systems; pub-sub systems; semi structured data and XML querying. Lecture and readings from original research papers. Semester-long project and paper. Students taking graduate version complete different assignments. Enrollment may be limited.  4 Engineering Design Points.",
    "instructors" : "S. R. Madden"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.731",
    "academicYear" : "2016",
    "title" : "Semiconductor Optoelectronics: Theory and Design",
    "cluster" : null,
    "prerequisites" : "6.728, 6.012",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on the physics of the interaction of photons with semiconductor materials. Uses the band theory of solids to calculate the absorption and gain of semiconductor media; and uses rate equation formalism to develop the concepts of laser threshold, population inversion, and modulation response. Presents theory and design for photodetectors, solar cells, modulators, amplifiers, and lasers. Introduces noise models for semiconductor devices, and applications of optoelectronic devices to fiber optic communications.",
    "instructors" : "R. J. Ram"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.690",
    "academicYear" : "2016",
    "title" : "Introduction to Electric Power Systems",
    "cluster" : "(Subject meets with 6.061)",
    "prerequisites" : "6.002, 6.013",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Electric circuit theory with application to power handling electric circuits. Modeling and behavior of electromechanical devices, including magnetic circuits, motors, and generators. Operational fundamentals of synchronous, induction and DC machinery. Interconnection of generators and motors with electric power transmission and distribution circuits. Power generation, including alternative and sustainable sources. Students taking graduate version complete additional assignments.",
    "instructors" : "J. L. Kirtley, Jr."
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.254",
    "academicYear" : "2016",
    "title" : "Game Theory with Engineering Applications",
    "cluster" : null,
    "prerequisites" : "6.041",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to fundamentals of game theory and mechanism design with motivations for each topic drawn from engineering applications (including distributed control of wireline/wireless communication networks, transportation networks, pricing). Emphasis on the foundations of the theory, mathematical tools, as well as modeling and the equilibrium notion in different environments. Topics include normal form games, supermodular games, dynamic games, repeated games, games with incomplete/imperfect information, mechanism design, cooperative game theory, and network games.",
    "instructors" : "A. Ozdaglar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.864",
    "academicYear" : "2016",
    "title" : "Advanced Natural Language Processing",
    "cluster" : "(Subject meets with 6.806)",
    "prerequisites" : "6.046 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the study of human language from a computational perspective, including syntactic, semantic and discourse processing models. Emphasizes machine learning methods and algorithms. Uses these methods and models in applications such as syntactic parsing, information extraction, statistical machine translation, dialogue systems, and summarization. Students taking graduate version complete additional assignments.",
    "instructors" : "R. A. Barzilay"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.255",
    "academicYear" : "2016",
    "title" : "Optimization Methods",
    "cluster" : "(Same subject as 15.093J)",
    "prerequisites" : "18.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 15.093J.",
    "instructors" : "D. Bertsimas, P. Parrilo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.EPE",
    "academicYear" : "2016",
    "title" : "UPOP Engineering Practice Experience",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.EPE, 2.EPE, 3.EPE, 6.EPE, 10.EPE, 16.EPE, 22.EPE)",
    "prerequisites" : "2.EPW or permission of instructor",
    "units" : "0-0-1 [P/D/F]",
    "optional" : null,
    "description" : "See description under subject 2.EPE.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.858",
    "academicYear" : "2016",
    "title" : "Computer Systems Security",
    "cluster" : null,
    "prerequisites" : "6.033, 6.005",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "Design and implementation of secure computer systems.  Lectures cover attacks that compromise security as well as techniques for achieving security, based on recent research papers.  Topics include operating system security, privilege separation, capabilities, language-based security, cryptographic network protocols, trusted hardware, and security in web applications and mobile phones.  Labs involve implementing and compromising a web application that sandboxes arbitrary code, and a group final project.  4 Engineering Design Points.",
    "instructors" : "N. B. Zeldovich"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.874",
    "academicYear" : "2016",
    "title" : "Computational Systems Biology",
    "cluster" : "(Same subject as HST.506J)\n(Subject meets with 6.802J, 7.36J, 7.91, 20.390J, 20.490J)",
    "prerequisites" : "Biology (GIR); 18.600 or 6.041",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents advanced machine learning and algorithmic approaches for contemporary problems in biology drawing upon recent advances in the literature.   Topics include biological discovery in heterogeneous cellular populations; single cell data analysis; regulatory factor binding; motif discovery; gene expression analysis; regulatory networks (discovery, validation, data integration, protein-protein interactions, signaling, chromatin accessibility analysis); predicting phenotype from genotype; and experimental design (model validation, interpretation of interventions).  Computational methods presented include deep learning, dimensionality reduction, clustering, directed and undirected graphical models, significance testing, Dirichlet processes, and topic models. Multidisciplinary team-oriented final research project.",
    "instructors" : "D. K. Gifford"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.695",
    "academicYear" : "2016",
    "title" : "Engineering, Economics and Regulation of the Electric Power Sector",
    "cluster" : "(Same subject as 15.032J, ESD.162J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject ESD.162J.",
    "instructors" : "I. Perez-Arriaga, C. Knittel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.813",
    "academicYear" : "2016",
    "title" : "User Interface Design and Implementation",
    "cluster" : "(Subject meets with 6.831)",
    "prerequisites" : "6.005 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Examines human-computer interaction in the context of graphical user interfaces. Covers human capabilities, design principles, prototyping techniques, evaluation techniques, and the implementation of graphical user interfaces.  Includes short programming assignments and a semester-long group project. Students taking the graduate version also have readings from current literature and additional assignments. Enrollment limited.  6 Engineering Design Points.",
    "instructors" : "R. C. Miller"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S192",
    "academicYear" : "2016",
    "title" : "Special Laboratory Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory subject that covers content not offered in the regular curriculum. Consult department to learn of offerings for a particular term.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.999",
    "academicYear" : "2016",
    "title" : "Practical Experience in EECS",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "For Course 6 students in the SM/PhD track who seek practical off-campus research experiences or internships in electrical engineering or computer science. Before enrolling, students must have a firm employment offer from a company or organization and secure a research supervisor within EECS. Employers required to document the work accomplished. Research proposals subject to departmental approval; consult departmental Graduate Office.",
    "instructors" : "L. A. Kolodziejski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.982",
    "academicYear" : "2016",
    "title" : "Teaching College-Level Science and Engineering",
    "cluster" : "(Same subject as 1.95J, 5.95J, 7.59J, 8.395J, 18.094J)\n(Subject meets with 2.978)",
    "prerequisites" : "None",
    "units" : "2-0-2 [P/D/F]",
    "optional" : null,
    "description" : "See description under subject 5.95J.",
    "instructors" : "J. Rankin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.072",
    "academicYear" : "2016",
    "title" : "Introduction to Digital Electronics",
    "cluster" : "(Same subject as EC.110J)",
    "prerequisites" : "None",
    "units" : "0-3-3 [P/D/F]",
    "optional" : null,
    "description" : "See description under subject EC.110J.",
    "instructors" : "J. Bales"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S062",
    "academicYear" : "2016",
    "title" : "Special Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Basic undergraduate subjects not offered in the regular curriculum.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S064",
    "academicYear" : "2016",
    "title" : "Special Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Basic undergraduate subjects not offered in the regular curriculum.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.172",
    "academicYear" : "2016",
    "title" : "Performance Engineering of Software Systems",
    "cluster" : "(Subject meets with 6.871)",
    "prerequisites" : "6.004, 6.005, 6.006",
    "units" : "3-12-3",
    "optional" : null,
    "description" : "Project-based introduction to building efficient, high-performance and scalable software systems. Topics include performance analysis, algorithmic techniques for high performance, instruction-level optimizations, vectorization, cache and memory hierarchy optimization, and parallel programming. Students taking graduate version complete additional assignments. 12 Engineering Design Points.",
    "instructors" : "S. Amarasinghe, C. E. Leiserson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S099",
    "academicYear" : "2016",
    "title" : "Special Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Covers subject matter not offered in the regular curriculum. Consult department to learn of offerings for a particular term.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S198",
    "academicYear" : "2016",
    "title" : "Special Laboratory Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory subject that covers content not offered in the regular curriculum. Consult department to learn of offerings for a particular term.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S899",
    "academicYear" : "2016",
    "title" : "Special Subject in Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Covers subject matter not offered in the regular curriculum. Consult department to learn of offerings for a particular term.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.268",
    "academicYear" : "2016",
    "title" : "Network Science and Models",
    "cluster" : null,
    "prerequisites" : "6.041, 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the main mathematical models used to describe large networks and dynamical processes that evolve on networks. Static models of random graphs, preferential attachment, and other graph evolution models.  Epidemic propagation, opinion dynamics, and social learning. Applications drawn from social, economic, natural, and infrastructure networks, as well as networked decision systems such as sensor networks.",
    "instructors" : "J. N. Tsitsiklis, P. Jaillet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.333",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Circuits",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in circuits. Specific focus varies from year to year. Consult department for details.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.645",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Applied Physics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in applied physics. Specific focus varies from year to year. Consult department for details.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.348",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Signals and Systems",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in signals and systems. Specific focus varies from year to year.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.247",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Control",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in control. Specific focus varies from year to year.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.261",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Communications",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in communications. Specific focus varies from year to year.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S919",
    "academicYear" : "2016",
    "title" : "Special Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Covers subject matter not offered in the regular curriculum.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S979",
    "academicYear" : "2016",
    "title" : "Special Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Covers subject matter not offered in the regular curriculum. Consult department to learn of offerings for a particular term.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.932",
    "academicYear" : "2016",
    "title" : "Linked Data Ventures",
    "cluster" : "(Same subject as 15.377J)",
    "prerequisites" : "6.005, 6.033, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides practical experience in the use and development of semantic web technologies.  Focuses on gaining practical insight from executives and practitioners who use these technologies in their companies. Working in multidisciplinary teams, students complete a term project to develop a sustainable prototype. Concludes with a professional presentation, judged by a panel of experts, and a technical presentation to faculty.",
    "instructors" : "T. Berners-Lee, L. Kagal, K. Rae, R. Sturdevant"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.545",
    "academicYear" : "2016",
    "title" : "Advanced Topics in BioEECS",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in BioEECS. Specific focus varies from year to year. Consult department for details.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.249",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Numerical Methods",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in numerical methods. Specific focus varies from year to year.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.736",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Materials, Devices, and Nanotechnology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced study of topics in materials, devices, and nanotechnology. Specific focus varies from year to year.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.335",
    "academicYear" : "2016",
    "title" : "Fast Methods for Partial Differential and Integral Equations",
    "cluster" : "(Same subject as 18.336J)",
    "prerequisites" : "6.336, 16.920, 18.085, 18.335, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 18.336J.",
    "instructors" : "A. Townsend"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.170",
    "academicYear" : "2016",
    "title" : "Software Studio",
    "cluster" : null,
    "prerequisites" : "6.005, 6.006",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Covers design and implementation of software systems, using web applications as the platform. Emphasizes the role of conceptual design in achieving clarity, simplicity, and modularity. Students complete open-ended individual assignments and a major team project. Enrollment may be limited. 12 Engineering Design Points.",
    "instructors" : "D. N. Jackson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.URS",
    "academicYear" : "2016",
    "title" : "Undergraduate Research in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Year-long individual research project arranged with appropriate faculty member or approved supervisor. Forms and instructions for the proposal and final report are available in the EECS Undergraduate Office.",
    "instructors" : "A. P. Chandrakasan, D. M. Freeman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.UAR",
    "academicYear" : "2016",
    "title" : "Seminar in Undergraduate Advanced Research",
    "cluster" : null,
    "prerequisites" : "6.UR",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Instruction in effective undergraduate research, including choosing and developing a research topic, surveying previous work and publications, research topics in EECS, industry best practices, design for robustness, technical presentation, authorship and collaboration, and ethics. Material covered over both fall and spring terms. Students engage in extensive written and oral communication exercises, in the context of an approved advanced research project. May be repeated for credit for a maximum of 12 units.",
    "instructors" : "A. P. Chandrakasan, D. M. Freeman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.169",
    "academicYear" : "2016",
    "title" : "Theory and Application of Circuits and Electronics",
    "cluster" : null,
    "prerequisites" : "None. <I>Coreq: 6.002</I>",
    "units" : "1-1-1",
    "optional" : null,
    "description" : "Building on the framework of 6.002, provides a deeper understanding of the theory and applications of circuits and electronics.",
    "instructors" : "A. Agarwal, J. del Alamo, J. H. Lang, D. J. Perreault"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.941",
    "academicYear" : "2016",
    "title" : "Statistics for Research Projects: Statistical Modeling and Experiment Design",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-2-2 [P/D/F]",
    "optional" : null,
    "description" : "Practical introduction to data analysis, statistical modeling, and experimental design, intended to provide essential skills for conducting research.   Covers basic techniques such as hypothesis-testing and regression models for both traditional experiments and newer paradignms such as evaluating simulations.  Assignments reinforce techniques through analyzing sample datasets and reading case studies. Students with research projects will be encouraged to share their experiences and project-specific questions.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.525",
    "academicYear" : "2016",
    "title" : "Medical Device Design",
    "cluster" : "(Same subject as 2.75J)\n(Subject meets with 2.750J, 6.025J)",
    "prerequisites" : "2.72, 6.071, 6.115, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.75J.",
    "instructors" : "A. H. Slocum, C. G. Sodini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S967",
    "academicYear" : "2016",
    "title" : "Special Studies: EECS",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for study of graduate-level topics related to electrical engineering and computer science but not included elsewhere in the curriculum. Registration under this subject normally used for situations involving small study groups. Normal registration is for 12 units. Registration subject to approval of professor in charge.  Consult the department for details.",
    "instructors" : "L. A. Kolodziejski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S974",
    "academicYear" : "2016",
    "title" : "Special Subject in Electrical Engineering and Computer Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Covers subject matter not offered in the regular curriculum. Consult department to learn of offerings for a particular term.",
    "instructors" : "Consult Department"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.025",
    "academicYear" : "2016",
    "title" : "Medical Device Design",
    "cluster" : "(Same subject as 2.750J)\n(Subject meets with 2.75J, 6.525J)",
    "prerequisites" : "2.72, 6.071, 6.115, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.750J.",
    "instructors" : "A. H. Slocum, C. G. Sodini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.036",
    "academicYear" : "2016",
    "title" : "Introduction to Machine Learning",
    "cluster" : null,
    "prerequisites" : "6.01",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduces principles, algorithms, and applications of machine learning from the point of view of modeling and prediction; formulation of learning problems; representation, over-fitting, generalization; clustering, classification, probabilistic modeling; and methods such as support vector machines, hidden Markov models, and Bayesian networks.",
    "instructors" : "R. Barzilay, T. Jaakkola, L. P. Kaelbling"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.129",
    "academicYear" : "2016",
    "title" : "Biological Circuit Engineering Laboratory",
    "cluster" : "(Same subject as 20.129J)",
    "prerequisites" : "Biology (GIR), Calculus II (GIR)",
    "units" : "2-8-2 Institute LAB",
    "optional" : null,
    "description" : "Students assemble individual genes and regulatory elements into larger-scale circuits; they experimentally characterize these circuits in yeast cells using quantitative techniques, including flow cytometry, and model their results computationally. Emphasizes concepts and techniques to perform independent experimental and computational synthetic biology research. Discusses current literature and ongoing research in the field of synthetic biology. Instruction and practice in oral and written communication provided. Enrollment limited. 12 Engineering Design Points.",
    "instructors" : "T. Lu, R. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.178",
    "academicYear" : "2016",
    "title" : "Introduction to Software Engineering in Java",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-1-4 [P/D/F]",
    "optional" : null,
    "description" : "Covers the fundamentals of Java, helping students develop intuition about object-oriented programming. Focuses on developing working software that solves real problems. Designed for students with little or no programming experience. Concepts covered useful to 6.005. Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.179",
    "academicYear" : "2016",
    "title" : "Introduction to C and C++",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-3-0 [P/D/F]",
    "optional" : null,
    "description" : "Fast-paced introduction to the C and C++ programming languages. Intended for those with experience in other languages who have never used C or C++. Students complete daily assignments, a small-scale individual project, and a mandatory online diagnostic test. Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.819",
    "academicYear" : "2016",
    "title" : "Advances in Computer Vision",
    "cluster" : "(Subject meets with 6.869)",
    "prerequisites" : "6.041 or 6.042; 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Advanced topics in computer vision with a focus on the use of machine learning techniques and applications in graphics and human-computer interface. Covers image representations, texture models, structure-from-motion algorithms, Bayesian techniques, object and scene recognition, tracking, shape modeling, and image databases. Applications may include face recognition, multimodal interaction, interactive systems, cinematic special effects, and photorealistic rendering. Covers topics complementary to 6.801. Students taking graduate version complete additional assignments.",
    "instructors" : "W. T. Freeman, A. Torralba"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.802",
    "academicYear" : "2016",
    "title" : "Foundations of Computational and Systems Biology",
    "cluster" : "(Same subject as 7.36J, 20.390J)\n(Subject meets with 6.874J, 7.91, 20.490J, HST.506J)",
    "prerequisites" : "Biology (GIR), 6.0002 or 6.01; or 7.05; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides an introduction to computational and systems biology. Includes units on the analysis of protein and nucleic acid sequences, protein structures, and biological networks. Presents principles and methods used for sequence alignment, motif finding, expression array analysis, structural modeling, structure design and prediction, and network analysis and modeling. Techniques include dynamic programming, Markov and hidden Markov models, Bayesian networks, clustering methods, and energy minimization approaches. Exposes students to emerging research areas. Designed for students with strong backgrounds in either molecular biology or computer science. Some foundational material covering basic programming skills, probability and statistics is provided for students with less quantitative backgrounds. Students taking graduate version complete additional assignments.",
    "instructors" : "D. K. Gifford, T. S. Jaakkola"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.443",
    "academicYear" : "2016",
    "title" : "Quantum Information Science",
    "cluster" : "(Same subject as 8.371J, 18.436J)",
    "prerequisites" : "18.435",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 8.371J.",
    "instructors" : "I. Chuang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.146",
    "academicYear" : "2016",
    "title" : "Mobile Autonomous Systems Laboratory: MASLAB",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-2-2 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Autonomous robotics contest emphasizing technical AI, vision, mapping and navigation from a robot-mounted camera. Few restrictions are placed on materials, sensors, and/or actuators enabling teams to build robots very creatively. Teams should have members with varying engineering, programming and mechanical backgrounds. Culminates with a robot competition at the end of IAP. Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.03",
    "academicYear" : "2016",
    "title" : "Introduction to EECS II from a Medical Technology Perspective",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR), Physics II (GIR)",
    "units" : "4-4-4 1/2 Institute LAB",
    "optional" : null,
    "description" : "Explores biomedical signals generated from electrocardiograms, glucose detectors, and magnetic resonance images. Topics include physical characterization and modeling of systems in the time and frequency domains; analog and digital signals and noise; basic machine learning including decision trees, clustering, and classification; and introductory machine vision. 6 Engineering Design Points.",
    "instructors" : "C. M. Stultz, E. Adalsteinsson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.805",
    "academicYear" : "2016",
    "title" : "Foundations of Information Policy",
    "cluster" : "(Same subject as STS.085J)\n(Subject meets with STS.487)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Studies the growth of computer and communications technology and the new legal and ethical challenges that reflect tensions between individual rights and societal needs. Topics include computer crime; intellectual property restrictions on software; encryption, privacy, and national security; academic freedom and free speech. Students meet and question technologists, activists, law enforcement agents, journalists, and legal experts. Instruction and practice in oral and written communication provided. Students taking graduate version complete additional assignments. Enrollment limited.",
    "instructors" : "H. Abelson, M. Fischer, D. Weitzner"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.175",
    "academicYear" : "2016",
    "title" : "Constructive Computer Architecture",
    "cluster" : null,
    "prerequisites" : "6.004",
    "units" : "3-8-1",
    "optional" : null,
    "description" : "Illustrates a constructive (as opposed to a descriptive) approach to computer architecture. Topics include combinational and pipelined arithmetic-logic units (ALU), in-order pipelined microarchitectures, branch prediction, blocking and unblocking caches, interrupts, virtual memory support, cache coherence and multicore architectures. Labs in a modern Hardware Design Language (HDL) illustrate various aspects of microprocessor design, culminating in a term project in which students present a multicore design running on an FPGA board. 12 Engineering Design Points.",
    "instructors" : "Arvind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.811",
    "academicYear" : "2016",
    "title" : "Principles and Practice of Assistive Technology",
    "cluster" : "(Same subject as HST.420J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-4-6",
    "optional" : null,
    "description" : "Students work closely with people with disabilities to develop assistive and adaptive technologies that help them live more independently. Covers design methods and problem-solving strategies; institutional review boards; human factors; human-machine interfaces; community perspectives; social and ethical aspects; and assistive technology for motor, cognitive, perceptual, and age-related impairments. Prior knowledge of one or more of the following areas useful: software; electronics; human-computer interaction; cognitive science; mechanical engineering; control; or MIT hobby shop, MIT PSC, or other relevant independent project experience.",
    "instructors" : "R. C. Miller, J. E. Greenberg, J. J. Leonard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.037",
    "academicYear" : "2016",
    "title" : "Structure and Interpretation of Computer Programs",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-0-5 [P/D/F]",
    "optional" : null,
    "description" : "Studies the structure and interpretation of computer programs which transcend specific programming languages. Demonstrates thought patterns for computer science using Scheme. Includes weekly programming projects. Enrollment may be limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.057",
    "academicYear" : "2016",
    "title" : "Introduction to MATLAB",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-0-2 [P/D/F]",
    "optional" : null,
    "description" : "Accelerated introduction to MATLAB and its popular toolboxes. Lectures are interactive, with students conducting sample MATLAB problems in real time. Includes problem-based MATLAB assignments. Students must provide their own laptop and software. Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.117",
    "academicYear" : "2016",
    "title" : "Introduction to Electrical Engineering Lab Skills",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-3-2 [P/D/F]",
    "optional" : null,
    "description" : "Introduces basic electrical engineering concepts, components, and laboratory techniques. Covers analog integrated circuits, power supplies, and digital circuits. Lab exercises provide practical experience in constructing projects using multi-meters, oscilloscopes, logic analyzers, and other tools. Includes a project in which students build a circuit to display their own EKG. Enrollment limited.",
    "instructors" : "G. P. Hom"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.147",
    "academicYear" : "2016",
    "title" : "The BattleCode Programming Competition",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-4 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Artificial Intelligence programming contest in Java. Student teams program virtual robots to play BattleCode, a real-time strategy game. Competition culminates in a live BattleCode tournament. Assumes basic knowledge of programming in Java.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.148",
    "academicYear" : "2016",
    "title" : "Web Programming Competition",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "1-0-5 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Teams compete to build the most functional and user-friendly website. Competition is judged by industry experts and includes novice and advanced divisions. Prizes awarded. Lectures and workshops cover website basics. Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.149",
    "academicYear" : "2016",
    "title" : "Introduction to Programming Using Python",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-3 [P/D/F]",
    "optional" : null,
    "description" : "Face-paced introduction to Python programming language for students with little or no programming experience. Covers both function and object-oriented concepts. Includes weekly lab exercises and final project. Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.150",
    "academicYear" : "2016",
    "title" : "Mobile Applications Competition",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-2-2 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Student teams design and build an Android application based on a given theme. Lectures and labs led by experienced students and leading industry experts, covering the basics of Android development, concepts and tools to help participants build great apps. Contest culminates with a public presentation in front of a judging panel comprised of professional developers and MIT faculty. Prizes awarded. Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.151",
    "academicYear" : "2016",
    "title" : "iOS Game Design and Development Competition",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-2-2 [P/D/F]",
    "optional" : null,
    "description" : "Introduction to iOS game design and development for students already familiar with object-oriented programming. Provides a set of basic tools (Objective-C and Cocos2D) and exposure to real-world issues in game design. Working in small teams, students complete a final project in which they create their own iPhone game. At the end of IAP, teams present their games in competition for prizes awarded by a judging panel of gaming experts.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.836",
    "academicYear" : "2016",
    "title" : "Multicore Programming",
    "cluster" : "(Subject meets with 6.816)",
    "prerequisites" : "6.006",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduces principles and core techniques for programming multicore machines. Topics include locking, scalability, concurrent data structures, multiprocessor scheduling, load balancing, and state-of-the-art synchronization techniques, such as transactional memory.  Includes sequence of programming assignments on a large multicore machine, culminating with the design of a highly concurrent  application. Students taking graduate version complete additional assignments.",
    "instructors" : "N. Shavit"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.905",
    "academicYear" : "2016",
    "title" : "Large-scale Symbolic Systems",
    "cluster" : "(Subject meets with 6.945)",
    "prerequisites" : "6.034 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Concepts and techniques for the design and implementation of large software systems that can be adapted to uses not anticipated by the designer. Applications include compilers, computer-algebra systems, deductive systems, and some artificial intelligence applications. Covers means for decoupling goals from strategy, mechanisms for implementing additive data-directed invocation, work with partially-specified entities, and how to manage multiple viewpoints. Topics include combinators, generic operations, pattern matching, pattern-directed invocation, rule systems, backtracking, dependencies, indeterminacy, memoization, constraint propagation, and incremental refinement. Students taking graduate version complete additional assignments.",
    "instructors" : "G. J. Sussman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.903",
    "academicYear" : "2016",
    "title" : "Patents, Copyrights, and the Law of Intellectual Property",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Intensive introduction to the US law of intellectual property with major emphasis on patents, including the process of patent application and the remedies for patent infringement.  Also focuses on copyrights and provides a brief look at trademarks and trade secrets. Presents comparisons of what can and cannot be protected, and what rights the owner does and does not obtain. Highlights issues relating to information technology, biogenetic materials, and business methods. Readings include judicial opinions and statutory material. No listeners.",
    "instructors" : "S. M. Bauer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.776",
    "academicYear" : "2016",
    "title" : "High Speed Communication Circuits",
    "cluster" : null,
    "prerequisites" : "6.301",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Principles and techniques of high-speed integrated circuits used in wireless/wireline data links and remote sensing. On-chip passive component design of inductors, capacitors, and antennas. Analysis of distributed effects, such as transmission line modeling, S-parameters, and Smith chart. Transceiver architectures and circuit blocks, which include low-noise amplifiers, mixers, voltage-controlled oscillators, power amplifiers, and frequency dividers. Involves IC/EM simulation and laboratory projects.",
    "instructors" : "R. Han"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.058",
    "academicYear" : "2016",
    "title" : "Preview of Signals and Systems",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR) or permission of instructor",
    "units" : "2-2-2 [P/D/F]",
    "optional" : null,
    "description" : "Preparation for 6.003 or 6.011, focusing on several key concepts, including LTI systems, convolution, CT and DT Fourier series and transforms, filtering, sampling, modulation, Laplace and z-transforms, and feedback.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.176",
    "academicYear" : "2016",
    "title" : "Pokerbots Competition",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-0-5 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Build autonomous poker players and aquire the knowledge of the game of poker. Showcase decision making skills, apply concepts in mathematics, computer science and economics.  Provides instruction in programming, game theory, probability and statistics and machine learning. Concludes with a final competition and prizes. Enrollment limited",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.177",
    "academicYear" : "2016",
    "title" : "Building Programming Experience in Python",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-0-5 [P/D/F]",
    "optional" : null,
    "description" : "Preparation for 6.01 aimed to sharpen skills in program design, implementation, and debugging in Python. Programming intensive, with one short structured assignment and a supervised, but highly individual, mandatory project presentation. Intended for students with some elementary programming experience (equivalent to AP Computer Science). Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.816",
    "academicYear" : "2016",
    "title" : "Multicore Programming",
    "cluster" : "(Subject meets with 6.836)",
    "prerequisites" : "6.006",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduces principles and core techniques for programming multicore machines. Topics include locking, scalability, concurrent data structures, multiprocessor scheduling, load balancing, and state-of-the-art synchronization techniques, such as transactional memory.  Includes sequence of programming assignments on a large multicore machine, culminating with the design of a highly concurrent  application. Students taking graduate version complete additional assignments.",
    "instructors" : "N. Shavit"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.602",
    "academicYear" : "2016",
    "title" : "Fundamentals of Photonics",
    "cluster" : "(Subject meets with 6.621)",
    "prerequisites" : "2.71, 6.013, or 8.07",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers the fundamentals of optics and the interaction of light and matter, leading to devices such as light emitting diodes, optical amplifiers, and lasers. Topics include classical ray, wave, beam, and Fourier optics; Maxwell's electromagnetic waves; resonators; quantum theory of photons; light-matter interaction; laser amplification; lasers; and semiconductors optoelectronics. Students taking graduate version complete additional assignments.",
    "instructors" : "D. R. Englund"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.621",
    "academicYear" : "2016",
    "title" : "Fundamentals of Photonics",
    "cluster" : "(Subject meets with 6.602)",
    "prerequisites" : "2.71, 6.013, or 8.07",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers the fundamentals of optics and the interaction of light and matter, leading to devices such as light emitting diodes, optical amplifiers, and lasers. Topics include classical ray, wave, beam, and Fourier optics; Maxwell's electromagnetic waves; resonators; quantum theory of photons; light-matter interaction; laser amplification; lasers; and semiconductors optoelectronics. Students taking graduate version complete additional assignments.",
    "instructors" : "D. R. Englund"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.840",
    "academicYear" : "2016",
    "title" : "Theory of Computation",
    "cluster" : "(Same subject as 18.4041J)\n(Subject meets with 18.404)",
    "prerequisites" : "18.200 or 18.062J",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 18.4041J.",
    "instructors" : "M. Sipser"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.557",
    "academicYear" : "2016",
    "title" : "Biomolecular Feedback Systems",
    "cluster" : "(Same subject as 2.18J)\n(Subject meets with 2.180J, 6.027J)",
    "prerequisites" : "18.03, Biology (GIR), or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.18J.",
    "instructors" : "D. Del Vecchio, R. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.S04",
    "academicYear" : "2016",
    "title" : "Special Subject: Fundamentals of Programming",
    "cluster" : null,
    "prerequisites" : "6.0001 or 6.01",
    "units" : "2-4-6 Institute LAB",
    "optional" : null,
    "description" : "Introduces fundamental concepts of programming. Designed to develop skills in applying basic methods from programming languages to abstract problems. Topics include programming and Python basics, computational concepts, software engineering, algorithmic techniques, data types, and recursion and tail recursion. Lab component will consist of software design, construction and implementation of design. Licensed for 2015-2016 by the Committee on Curricula.  6 Engineering Design Points.",
    "instructors" : "S. Devadas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.807",
    "academicYear" : "2016",
    "title" : "Computational Fabrication",
    "cluster" : null,
    "prerequisites" : "6.837 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces computational aspects of computer-aided design and manufacturing. Explores relevant methods in the context of additive manufacturing (e.g., 3D printing). Topics include computer graphics (geometry modeling, solid modeling, procedural modeling), physically-based simulation (kinematics, finite element method), 3D scanning/geometry processing, and an overview of 3D fabrication methods. Exposes students to the latest research in computational fabrication.",
    "instructors" : "W. Matusik"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.936",
    "academicYear" : "2016",
    "title" : "StartMIT: Workshop for Entrepreneurs and Innovators",
    "cluster" : "(Subject meets with 6.906)",
    "prerequisites" : "None",
    "units" : "4-0-2 [P/D/F]",
    "optional" : null,
    "description" : "Designed for students who are interested in entrepreneurship and want to explore the potential commercialization of their research project. Introduces practices for building a successful company, such as idea creation and validation, defining a value proposition, building a team, marketing, customer traction, and possible funding models. Students taking graduate version complete different assignments.",
    "instructors" : "A. Chandrakasan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.871",
    "academicYear" : "2016",
    "title" : "Performance Engineering of Software Systems",
    "cluster" : "(Subject meets with 6.172)",
    "prerequisites" : "6.004, 6.005, 6.006",
    "units" : "3-12-3",
    "optional" : null,
    "description" : "Project-based introduction to building efficient, high-performance and scalable software systems. Topics include performance analysis, algorithmic techniques for high performance, instruction-level optimizations, vectorization, cache and memory hierarchy optimization, and parallel programming. Students taking graduate version complete additional assignments. 12 Engineering Design Points.",
    "instructors" : "S. Amarasinghe, C. E. Leiserson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.906",
    "academicYear" : "2016",
    "title" : "StartMIT: Workshop for Entrepreneurs and Innovators",
    "cluster" : "(Subject meets with 6.936)",
    "prerequisites" : "None",
    "units" : "4-0-2 [P/D/F]",
    "optional" : null,
    "description" : "Designed for students who are interested in entrepreneurship and want to explore the potential commercialization of their research project. Introduces practices for building a successful company, such as idea creation and validation, defining a value proposition, building a team, marketing, customer traction, and possible funding models. Students taking graduate version complete different assignments.",
    "instructors" : "A. Chandrakasan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.027",
    "academicYear" : "2016",
    "title" : "Biomolecular Feedback Systems",
    "cluster" : "(Same subject as 2.180J)\n(Subject meets with 2.18J, 6.557J)",
    "prerequisites" : "18.03, Biology (GIR), or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 2.180J.",
    "instructors" : "D. Del Vecchio, R. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.806",
    "academicYear" : "2016",
    "title" : "Advanced Natural Language Processing",
    "cluster" : "(Subject meets with 6.864)",
    "prerequisites" : "6.046 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the study of human language from a computational perspective, including syntactic, semantic and discourse processing models. Emphasizes machine learning methods and algorithms. Uses these methods and models in applications such as syntactic parsing, information extraction, statistical machine translation, dialogue systems, and summarization. Students taking graduate version complete additional assignments.",
    "instructors" : "R. A. Barzilay"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.929",
    "academicYear" : "2016",
    "title" : "Energy Technology and Policy:  From Principles to Practice",
    "cluster" : "(Same subject as 5.00J, 10.579J, 22.813J, ESD.174J)",
    "prerequisites" : "None",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Develops analytical skills to lead a successful technology implementation with an integrated approach that combines technical, economical and social perspectives. Considers corporate and government viewpoints as well as international aspects, such as nuclear weapons proliferation and global climate issues.  Discusses technologies such as oil and gas, nuclear, solar, and energy efficiency. Limited to 100.",
    "instructors" : "J. Deutch"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.904",
    "academicYear" : "2016",
    "title" : "Ethics for Engineers",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.082, 2.900, 6.904, 10.01, 22.014)",
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 10.01.",
    "instructors" : "D. Doneson, B. L. Trout, D. Mess"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "6.876",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Cryptography",
    "cluster" : null,
    "prerequisites" : "6.875",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Recent results in cryptography, interactive proofs, and cryptographic game theory. Lectures by instructor, invited speakers, and students.",
    "instructors" : "S. Goldwasser, S. Micali"
  } ]
}