{
  "metadata" : {
    "size" : "52"
  },
  "items" : [ {
    "termCode" : "2016FA",
    "subjectId" : "MAS.665",
    "academicYear" : "2016",
    "title" : "Development Ventures",
    "cluster" : "(Same subject as 15.375J, EC.731J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Seminar on founding, financing, and building entrepreneurial ventures in developing nations. Challenges students to craft enduring and economically viable solutions to the problems faced by these countries.  Cases illustrate examples of both successful and failed businesses, and the difficulties in deploying and diffusing products and services through entrepreneurial action.  Explores a range of established and emerging business models, as well as new business opportunities enabled by innovations emerging from MIT labs and beyond.  Students develop a business plan executive summary suitable for submission in the MIT $100K Entrepreneurship Competition's Accelerate Contest or MIT IDEAS.",
    "instructors" : "J. Bonsen, A. Pentland"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.534",
    "academicYear" : "2016",
    "title" : "Engineering Health: Understanding and Designing Affordable Health Diagnostics",
    "cluster" : "(Same subject as HST.928J)",
    "prerequisites" : "None",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Designing and building novel health diagnostics and sensors while learning the fundamentals of rapid prototyping, applied optics, signals processing, imaging and other advanced sensing modalities. Students work in teams with a physician and technical mentor to design and construct a cutting edge health diagnostic or device. The best projects may be continued in the Spring semester through a clinical trials and ventures program reaching early trials by the end of the school year.",
    "instructors" : "R. Raskar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.664",
    "academicYear" : "2016",
    "title" : "Media Ventures",
    "cluster" : "(Same subject as 15.376J)",
    "prerequisites" : "None",
    "units" : "3-0-6",
    "optional" : "Can be repeated for credit",
    "description" : "Seminar surveys internal and external entrepreneurship, based on Media Lab technologies, to increase understanding of how digital innovations grow into societal change. Cases illustrate examples of both successful and failed businesses, as well as difficulties in deploying and diffusing products. Explores a range of business models and opportunities enabled by emerging Media Lab innovations. Students craft a business analysis for one of the featured technology innovations. Past analyses have become the basis for research publications, and new ventures.  Particular focus on big data, mobile, and the use of personal data.",
    "instructors" : "A. Pentland, J. Bonsen"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.533",
    "academicYear" : "2016",
    "title" : "Imaging Ventures:  Cameras, Displays, and Visual Computing",
    "cluster" : null,
    "prerequisites" : "Permission of Instructor",
    "units" : "0-9-0",
    "optional" : null,
    "description" : "Project-oriented seminar covers the opportunities and challenges for businesses based on emergent imaging innovations. Students analyze the landscape of imaging developments, plan business strategies and brainstorm towards a start-up, business unit, non-profit or citizen sector organization; they are encouraged to form teams and craft a business plan to gain practical experience in imaging research. Includes case studies of established and emerging businesses, and talks by invited business speakers. Surveys commercialization and the innovation landscape in all imaging arenas. Topics include mobile camera phones, cameras in developing countries, image-search, medical imaging, online photo sharing, and computational photography. Enrollment limited.",
    "instructors" : "R. Raskar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.131",
    "academicYear" : "2016",
    "title" : "Computational Camera and Photography",
    "cluster" : "(Subject meets with MAS.531)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers the complete pipeline of computational cameras that attempt to digitally capture the essence of visual information by exploiting the synergistic combination of task-specific optics, illumination, sensors, and processing. Students discuss and use thermal, multi-spectral, high-speed and 3-D range-sensing cameras, as well as camera arrays. Presents opportunities in scientific and medical imaging, and mobile phone-based photography.  Also covers cameras for human computer interaction (HCI) and sensors that mimic animal eyes. Intended for students with interest in algorithmic and technical aspects of imaging and photography. Students taking graduate version complete additional assignments.",
    "instructors" : "R. Raskar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.132",
    "academicYear" : "2016",
    "title" : "Mathematical Methods in Imaging",
    "cluster" : "(Subject meets with MAS.532)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Surveys the landscape of imaging techniques and develops skills for conducting imaging research. Reviews technical and social aspects of the evolving camera culture and considers its role in transforming social interactions, reshaping businesses, and influencing communities worldwide. Explores innovative protocols for sharing and consumption of visual media, as well as novel hardware and software tools based on advanced lenses, digital illumination, modern sensors, and emerging image-analysis algorithms. Students taking graduate version complete additional assignments.",
    "instructors" : "R. Raskar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.552",
    "academicYear" : "2016",
    "title" : "City Science",
    "cluster" : "(Same subject as 4.557J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Focuses on architectural and mobility interventions that respond to changing patterns of living, working, and transport. Emphasizes mass-customized housing, autonomous parking, charging infrastructure, and shared-use networks of lightweight electric vehicles (LEVs). Students work in small teams and are lead by researchers from the Changing Places group. Projects focus on the application of these ideas to case study cities and may include travel. Invited guests from academia and industry participate. Repeatable for credit with permission of instructor.",
    "instructors" : "K. Larson, J. Bonsen"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.700",
    "academicYear" : "2016",
    "title" : "Future of News and Participatory Media",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "1-2-9",
    "optional" : null,
    "description" : "Studies the news as an engineering challenge in light of recent, rapid, and ongoing changes to the way news is delivered and spread. Considers how we discover what events are taking place in different parts of the world and how we explain the importance of these events to readers or viewers, as well as how readers of a story respond to events. Explores the systems journalists and others have used to report and share the news.  Focuses on developing one's own tools and methods to address these challenges through weekly reporting assignments and a final project in which students build tools for journalists (professional and otherwise) to use. Limited to 18.",
    "instructors" : "E. Zuckerman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.UR",
    "academicYear" : "2016",
    "title" : "Undergraduate Research in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.URG",
    "academicYear" : "2016",
    "title" : "Undergraduate Research in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Individual or group study, research, or laboratory investigations under faculty supervision, including individual participation in an ongoing research project.  See UROP coordinator for further information.",
    "instructors" : "C. Schmandt"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.110",
    "academicYear" : "2016",
    "title" : "Fundamentals of Computational Media Design",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-3-6 HASS-A; CI-H",
    "optional" : null,
    "description" : "History of modern art and design from the perspective of the technologist.  Exploration of visual analysis, typography, and technologies for audio/visual expression. Enrollment limited; preference to students in MAS freshman program.",
    "instructors" : "V. M. Bove, Jr."
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.111",
    "academicYear" : "2016",
    "title" : "Introduction to Doing Research in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-4-1 [P/D/F]",
    "optional" : null,
    "description" : "Intended for students pursuing research projects at the Media Laboratory, particularly freshmen and sophomores. Exercises and discussions on topics including Media Lab research areas; documenting research progress; ethical issues in research; patents, copyrights, intellectual property; and giving oral, written, and online presentations of results. A final oral presentation is required. Enrollment limited; preference to students in the Media Arts and Sciences freshman program.",
    "instructors" : "V. M. Bove, Jr."
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.490",
    "academicYear" : "2016",
    "title" : "Independent Study in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.491",
    "academicYear" : "2016",
    "title" : "Independent Study in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Special projects on group or individual basis. Registration subject to prior arrangement of subject matter and supervision by staff.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.THG",
    "academicYear" : "2016",
    "title" : "Graduate Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research and writing of thesis; to be arranged by the student with supervising committee.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.622",
    "academicYear" : "2016",
    "title" : "Pattern Recognition and Analysis",
    "cluster" : "(Same subject as 1.126J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Fundamentals of characterizing and recognizing patterns and features of interest in numerical data. Basic tools and theory for signal understanding problems with applications to user modeling, affect recognition, speech recognition and understanding, computer vision, physiological analysis, and more. Decision theory, statistical classification, maximum likelihood and Bayesian estimation, nonparametric methods, unsupervised learning and clustering. Additional topics on machine and human learning from active research. Knowledge of probability theory and linear algebra required. Limited to 20.",
    "instructors" : "R. W. Picard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.630",
    "academicYear" : "2016",
    "title" : "Affective Computing",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-10",
    "optional" : null,
    "description" : "Instructs students on how to develop technologies that help people measure and communicate emotion, that respectfully read and that intelligently respond to emotion, and have internal mechanisms inspired by the useful roles emotions play. Topics vary from year to year, and may include the interaction of emotion with cognition and perception; the communication of human emotion via face, voice, physiology, and behavior; construction of computers, agents, and robots having skills of emotional intelligence; the role of emotion in decision-making and learning; and affective technologies for education, autism, health, and market research applications. Weekly reading, discussion, and a term project required. Enrollment limited.",
    "instructors" : "R. W. Picard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.690",
    "academicYear" : "2016",
    "title" : "Independent Study in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for independent study under regular supervision by a faculty member. Registration subject to prior arrangement of subject matter and supervision by staff.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.712",
    "academicYear" : "2016",
    "title" : "Learning Creative Learning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-10 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "An introduction to ideas and strategies underlying the design of new learning technologies.  Focuses especially on technologies that support interest-driven, project-based, collaborative learning experiences.  Students analyze innovative learning technologies, discuss underlying educational ideas, examine design principles, create new prototypes and applications.",
    "instructors" : "M. Resnick"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.731",
    "academicYear" : "2016",
    "title" : "The Society of Mind",
    "cluster" : "(Same subject as 6.868J)",
    "prerequisites" : "Must have read \"The Society of Mind\" and \"The Emotion Machine\"; permission of instructor",
    "units" : "2-0-10",
    "optional" : null,
    "description" : "See description under subject 6.868J.",
    "instructors" : "M. Minsky"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.790",
    "academicYear" : "2016",
    "title" : "Independent Study in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for independent study under regular supervision by a faculty member. Registration subject to prior arrangement of subject matter and supervision by staff.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.825",
    "academicYear" : "2016",
    "title" : "Musical Aesthetics and Media Technology",
    "cluster" : "(Same subject as 21M.580J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-3-3",
    "optional" : null,
    "description" : "In-depth exploration of contemporary concepts in music and media. Studies recent music that uses advanced technology, and the artistic motivations and concerns implied by the new media. Practical experience with computer music technology, including MIDI and post-MIDI systems. Special emphasis on the interactive systems for professionals as well as amateurs. Midterm paper and term project required.",
    "instructors" : "T. Machover"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.826",
    "academicYear" : "2016",
    "title" : "Projects in Media and Music",
    "cluster" : "(Same subject as 21M.581J)",
    "prerequisites" : "MAS.825J",
    "units" : "3-3-6",
    "optional" : "Can be repeated for credit",
    "description" : "Current computer music concepts and practice. Project-based work on research or production projects using the Media Lab's computer music, interactive, and media resources. Requires significant studio work and a term project. Projects based on class interests and skills, and may be individually or group-based. May be repeated for credit with permission of instructor.",
    "instructors" : "T. Machover"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.834",
    "academicYear" : "2016",
    "title" : "Tangible Interfaces",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Explores design issues surrounding tangible user interfaces, a new form of human-computer interaction. Tangible user interfaces seek to realize seamless interfaces between humans, digital information, and the physical environment by giving physical form to digital information and computation, making bits directly manipulable with hands and perceptible at the periphery of human awareness. In the design studio environment, students explore experimental tangible interface designs, theories, applications, and underlying technologies, using concept sketches, posters, physical mockups, and working prototypes.",
    "instructors" : "H. Ishii"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.836",
    "academicYear" : "2016",
    "title" : "Sensor Technologies for Interactive Environments",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "A broad introduction to a host of sensor technologies, illustrated by applications drawn from human-computer interfaces and ubiquitous computing.  After extensively reviewing electronics for sensor signal conditioning, the lectures cover the principles and operation of a variety of sensor architectures and modalities, including pressure, strain, displacement, proximity, thermal, electric and magnetic field, optical, acoustic, RF, inertial, and bioelectric.  Simple sensor processing algorithms and wired and wireless network standards are also discussed. Students are required to complete written assignments, a set of laboratories, and a final project.",
    "instructors" : "J. Paradiso"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.862",
    "academicYear" : "2016",
    "title" : "The Physics of Information Technology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Self-contained introduction to the governing equations for devices that collect, store, manipulate, transmit and present information. Provides an understanding of how operational device principles work, their uses, the limits on their performance, and how they might be improved. Students review the foundations of thermodynamics and noise, electromagnetics, and the quantum description of materials, and then study their application in areas such as semiconductor logic, magnetic storage, wireless and optical communications, and quantum information and computation.",
    "instructors" : "N. Gershenfeld"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.863",
    "academicYear" : "2016",
    "title" : "How to Make (Almost) Anything",
    "cluster" : "(Same subject as 4.140J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-9-0",
    "optional" : null,
    "description" : "Provides a practical hands-on introduction to digital fabrication, including CAD/CAM/CAE, NC machining, 3-D printing and scanning, molding and casting, composites, laser and waterjet cutting, PCB design and fabrication; sensors and actuators; mixed-signal instrumentation, embedded processing, and wired and wireless communications. Develops an understanding of these capabilities through projects using them individually and jointly to create functional systems.",
    "instructors" : "N. Gershenfeld, J. DiFrancesco, S. Tibbits"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.864",
    "academicYear" : "2016",
    "title" : "The Nature of Mathematical Modeling",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Surveys the range of levels of description useful for the mathematical description of real and virtual worlds, including analytical solutions and approximations for difference and differential equations; finite difference, finite element and cellular automata numerical models; and stochastic processes, nonlinear function fitting, constrained optimization, and data-driven inference. Emphasis on efficient practical implementation of these ideas.",
    "instructors" : "N. Gershenfeld"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.890",
    "academicYear" : "2016",
    "title" : "Independent Study in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for independent study under regular supervision by a faculty member. Registration subject to prior arrangement of subject matter and supervision by staff.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.910",
    "academicYear" : "2016",
    "title" : "Research in Media Technology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "For research assistants in Media Arts and Sciences, where the assigned research is approved for academic credit by the department.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.912",
    "academicYear" : "2016",
    "title" : "Teaching in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory, tutorial, or classroom teaching under the supervision of a Media Arts and Sciences faculty member.  Students selected by interview. Enrollment limited by availability of suitable teaching assignments.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.921",
    "academicYear" : "2016",
    "title" : "Proseminar in Media Arts and Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9 [P/D/F]",
    "optional" : null,
    "description" : "Designed specifically for new doctoral students in the Media Arts and Sciences (MAS) program. Explores intellectual foundations of MAS, unifying themes connecting MAS research, and working practices of MAS researchers. Restricted to MAS doctoral students.",
    "instructors" : "D. Roy"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.940",
    "academicYear" : "2016",
    "title" : "Preparation for SM Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-10 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Selection of thesis topic, definition of method of approach, and preparation of thesis proposal. Independent study supplemented by individual conferences with faculty.",
    "instructors" : "S. Kamvar, C. Schmandt"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.945",
    "academicYear" : "2016",
    "title" : "Media Arts and Sciences General Exam",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "0-12-0 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Selected readings for Media Arts and Sciences doctoral students in preparation for their qualifying exams.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.950",
    "academicYear" : "2016",
    "title" : "Preparation for Ph.D. Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Selects thesis subject, defines method of approach, and prepares preliminary thesis outline. Independent study, supplemented by frequent individual conferences with staff members. Restricted to doctoral candidates.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.883",
    "academicYear" : "2016",
    "title" : "Revolutionary Ventures: How to Invent and Deploy Transformative Technologies",
    "cluster" : "(Same subject as 9.455J, 15.128J, 20.454J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Seminar on envisioning and building ideas and organizations to accelerate engineering revolutions. Focuses on emerging technology domains, such as neurotechnology, imaging, cryotechnology, gerontechnology, and bio-and-nano fabrication. Draws on historical examples as well as live case studies of existing or emerging organizations, including labs, institutes, startups, and companies. Goals range from accelerating basic science to developing transformative products or therapeutics. Each class is devoted to a specific area, often with invited speakers, exploring issues from the deeply technical through the strategic. Individually or in small groups, students prototype new ventures aimed at inventing and deploying revolutionary technologies.",
    "instructors" : "J. Bonsen, E. S. Boyden, J. Jacobson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.771",
    "academicYear" : "2016",
    "title" : "Autism Theory and Technology",
    "cluster" : null,
    "prerequisites" : "Permission of Instructor",
    "units" : "2-0-10",
    "optional" : null,
    "description" : "Illuminates current theories about autism together with challenges faced by people on the autism spectrum. Theories in communicating, interacting socially, managing cognitive and affective overload, and achieving independent lifestyles are covered. In parallel, the course presents state-of-the-art technologies being developed for helping improve both theoretical understanding and practical outcomes.  Participants expected to meet and interact with people on the autism spectrum. Weekly reading, discussion, and a term project required. Enrollment limited.",
    "instructors" : "R. Picard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.837",
    "academicYear" : "2016",
    "title" : "Principles of Electronic Music Interfaces",
    "cluster" : null,
    "prerequisites" : "Permission of Instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores the ways in which electronic music is controlled and performed. A solid historical perspective is presented, tracing the development of various families of electronic musical controllers and instruments from their genesis in the late 1800s onwards. Design principles and engineering detail are also given for various current and classic controllers. Evolving issues in the control of computer music for live performance and interactive installations are discussed, including computer mapping of sensor signals and transduced gesture onto sound, music, and other media. Weekly reading assignments are given, and a final project or paper is required.",
    "instructors" : "J. Paradiso"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.881",
    "academicYear" : "2016",
    "title" : "Principles of Neuroengineering",
    "cluster" : "(Same subject as 9.422J, 20.452J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers how to innovate technologies for brain analysis and engineering, for accelerating the basic understanding of the brain, and leading to new therapeutic insight and inventions.  Focuses on using physical, chemical and biological principles to understand technology design criteria governing ability to observe and alter brain structure and function.  Topics include optogenetics, noninvasive brain imaging and stimulation, nanotechnologies, stem cells and tissue engineering, and advanced molecular and structural imaging technologies.  Design projects by students.",
    "instructors" : "E. S. Boyden, III"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.750",
    "academicYear" : "2016",
    "title" : "Human-Robot Interaction",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "In-depth exploration of the leading research, design principles, and technical challenges in human-robot interaction (HRI), with an emphasis on socially interactive robots. Topics include mixed-initiative interaction, multi-modal interfaces, face-to-face communication, human-robot teamwork, social learning, aspects of social cognition, and long-term interaction. Applications of these topics to the development of personal robots for health, education, elder care, domestic assistance, and other domains will be surveyed. Requires student presentations, critiques of class readings, student projects, and a final project including a publication quality paper.",
    "instructors" : "C. Breazeal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.532",
    "academicYear" : "2016",
    "title" : "Mathematical Methods in Imaging",
    "cluster" : "(Subject meets with MAS.132)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Surveys the landscape of imaging techniques and develops skills for conducting imaging research. Reviews technical and social aspects of the evolving camera culture and considers its role in transforming social interactions, reshaping businesses, and influencing communities worldwide. Explores innovative protocols for sharing and consumption of visual media, as well as novel hardware and software tools based on advanced lenses, digital illumination, modern sensors, and emerging image-analysis algorithms. Students taking graduate version complete additional assignments.",
    "instructors" : "R. Raskar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.600",
    "academicYear" : "2016",
    "title" : "Human 2.0",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "0-9-0",
    "optional" : null,
    "description" : "Covers principles underlying current and future technologies for cognitive, emotional and physical augmentation. Focuses on using anatomical, biomechanical, neuromechanical, biochemical and neurological models of the human body to guide the designs of augmentation technology for persons with either unusual or normal physiologies that wish to extend their cognitive, emotion, social or physical capability to new levels.   Topics include robotic exoskeletons and powered orthoses, external limb prostheses, neural implant technology, social-emotional prostheses, and cognitive prostheses. Requires student presentations, critiques of class readings, and a final project including a publication-quality paper. Enrollment limited.",
    "instructors" : "H. Herr"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.581",
    "academicYear" : "2016",
    "title" : "Networks, Complexity, and Their Applications",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-10 [P/D/F]",
    "optional" : null,
    "description" : "Covers the basics of networks science and information theory. Explains the evolution of systems as the process by which systems accumulate knowledge and information while battling the eternal need for both knowledge and information to always be physically embodied. Students form small groups to conduct a hands-on project. Additionally, students present on readings that address literature in network science, social capital theory, social networks, and economic development. Limited to 25.",
    "instructors" : "C. Hidalgo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.S64",
    "academicYear" : "2016",
    "title" : "Special Subject in Media Technology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Supplementary work in areas not covered by the regular curriculum. Registration subject to prior arrangement.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.S69",
    "academicYear" : "2016",
    "title" : "Special Subject in Media Technology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Supplementary work in areas not covered by the regular curriculum. Registration subject to prior arrangement.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.330",
    "academicYear" : "2016",
    "title" : "Design Across Scales and Disciplines",
    "cluster" : "(Same subject as 4.110J)\n(Subject meets with MAS.650)",
    "prerequisites" : "None",
    "units" : "2-2-8 HASS-A",
    "optional" : null,
    "description" : "See description under subject 4.110J.",
    "instructors" : "N. Oxman, J. M. Yoon"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.500",
    "academicYear" : "2016",
    "title" : "Hands on Foundations in Media Technology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "A series of modular classes designed to provide basic foundations in the skills needed to perform research at the Media Lab. Introduces the technology tool sets and research techniques used broadly at the Media Lab. Students choose from a series of modules that include: hardware basics, I-O and interconnecting, design and fabrication, programming, analyzing data, machine learning, signals and systems, applied control, testing and evaluation methods, documentation and communication methods. Proportional credit will be assigned to each module successfully completed.",
    "instructors" : "N. Oxman, J. Paradiso"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.650",
    "academicYear" : "2016",
    "title" : "Design Across Scales, Disciplines and Problem Contexts",
    "cluster" : "(Subject meets with 4.110J, MAS.330J)",
    "prerequisites" : "None",
    "units" : "2-2-8",
    "optional" : null,
    "description" : "Explores the reciprocal relationships among design, science, and technology across scales. Covers a wide range of topics, from visualization, fabrication, computation, material ecology, interaction, and architecture to games and performance. Examines how transformations in science and technology have influenced design thinking and vice versa. Students collaborate on interdisciplinary design projects and creative opportunities. Additional work is required of students taking the graduate version of the subject.",
    "instructors" : "N. Oxman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.S70",
    "academicYear" : "2016",
    "title" : "Special Subject in Media Technology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Supplementary work in areas not covered by the regular curriculum.  Registration subject to prior arrangement.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.865",
    "academicYear" : "2016",
    "title" : "Rapid-Prototyping of Rapid-Prototyping Machines: How to Make Something that Makes (Almost) Anything",
    "cluster" : null,
    "prerequisites" : "MAS.863",
    "units" : "3-9-0",
    "optional" : null,
    "description" : "Studies rapid-prototyping machines and covers the theory and practice of digital fabrication processes. Weekly lectures supported by readings from research literature. Students work on machine development projects throughout the term.",
    "instructors" : "N. Gershenfeld"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.535",
    "academicYear" : "2016",
    "title" : "Engineering Health: Designing and Deploying Affordable Health Diagnostics and Therapeutics",
    "cluster" : "(Same subject as HST.929J)",
    "prerequisites" : "None",
    "units" : "6-0-0",
    "optional" : null,
    "description" : "Students design and construct a cutting-edge health diagnostic or device and explore opportunities to test and deploy it. Through structured interactions with physicians, and technical rounds at local hospitals, students incorporate user-centric design into their devices and engage with the health community towards implementation.  Provides exposure to clinical trials, the FDA, user experience, intellectual property, and entrepreneurship.",
    "instructors" : "R. Raskar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "MAS.531",
    "academicYear" : "2016",
    "title" : "Computational Camera and Photography",
    "cluster" : "(Subject meets with MAS.131)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers the complete pipeline of computational cameras that attempt to digitally capture the essence of visual information by exploiting the synergistic combination of task-specific optics, illumination, sensors, and processing. Students discuss and use thermal, multi-spectral, high-speed and 3-D range-sensing cameras, as well as camera arrays. Presents opportunities in scientific and medical imaging, and mobile phone-based photography. Also covers cameras for human computer interaction (HCI) and sensors that mimic animal eyes. Intended for students with interest in algorithmic and technical aspects of imaging and photography. Students taking graduate version complete additional assignments.",
    "instructors" : "R. Raskar"
  } ]
}