{
  "metadata" : {
    "size" : "223"
  },
  "items" : [ {
    "termCode" : "2016FA",
    "subjectId" : "2.52",
    "academicYear" : "2016",
    "title" : "Modeling and Approximation of Thermal Processes",
    "cluster" : "(Same subject as 4.424J)",
    "prerequisites" : "2.51",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides instruction on how to model thermal transport processes in typical engineering systems such as those found in manufacturing, machinery, and energy technologies. Successive modules cover basic modeling tactics for particular modes of transport, including steady and unsteady heat conduction, convection, multiphase flow processes, and thermal radiation. Includes a creative design project executed by the students.",
    "instructors" : "L. R. Glicksman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S993",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.717",
    "academicYear" : "2016",
    "title" : "Optical Engineering",
    "cluster" : null,
    "prerequisites" : "2.710 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Theory and practice of optical methods in engineering and system design. Emphasis on diffraction, statistical optics, holography, and imaging. Provides engineering methodology skills necessary to incorporate optical components in systems serving diverse areas such as precision engineering and metrology, bio-imaging, and computing (sensors, data storage, communication in multi-processor systems). Experimental demonstrations and a design project are included.",
    "instructors" : "P. T. So, G. Barbastathis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S996",
    "academicYear" : "2016",
    "title" : "Graduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.65",
    "academicYear" : "2016",
    "title" : "Sustainable Energy",
    "cluster" : "(Same subject as 1.818J, 10.391J, 11.371J, 22.811J, ESD.166J)\n(Subject meets with 2.650J, 10.291J, 22.081J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "See description under subject 22.811J.",
    "instructors" : "M. W. Golay"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S974",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Lecture, seminar or laboratory course consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter. 2.S972-2.S974 are graded P/D/F.",
    "instructors" : "Consult A. E. Hosoi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S994",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S997",
    "academicYear" : "2016",
    "title" : "Graduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.990",
    "academicYear" : "2016",
    "title" : "Practical Work Experience",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "0-1-0 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For Mechanical Engineering undergraduates participating in curriculum-related off-campus work experiences in mechanical engineering. Before enrolling, students must have an employment offer from a company or organization and must find a Mech E supervisor. Upon completion of the work the student must submit a detailed design notebook, approved by the MIT supervisor. Subject to departmental approval. Consult Department Undergraduate Office for details on procedures and restrictions.",
    "instructors" : "A. Slocum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.680",
    "academicYear" : "2016",
    "title" : "Unmanned Marine Vehicle Autonomy, Sensing, and Communication",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-6-4",
    "optional" : null,
    "description" : "Focuses on software and algorithms for autonomous decision making (autonomy) by underwater vehicles operating in ocean environments. Discusses how autonomous marine vehicles (UMVs) adapt to the environment for improved sensing performance. Covers sensors for acoustic, biological and chemical sensing and their integration with the autonomy system for environmentally adaptive undersea mapping and observation. Introduces students to the underwater acoustic communication environment and various options for undersea navigation, highlighting their relevance to the operation of collaborative undersea networks for environmental sensing. Labs involve the use of the MOOP-IvP autonomy software for the development of integrated sensing, modeling and control solutions. Solutions modeled in simulation environments and include field tests with small autonomous surface and underwater vehicles operated on the Charles River. Limited enrollment.",
    "instructors" : "H. Schmidt, J.J. Leonard, M. Benjamin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S992",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.700",
    "academicYear" : "2016",
    "title" : "Principles of Naval Architecture",
    "cluster" : "(Subject meets with 2.701)",
    "prerequisites" : "2.002 or 2.02B",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "See description under subject *UNKNOWN*.",
    "instructors" : "F. S. Hover, A. H. Techet, J. Ketcham, P. D. Sclavounos, M. Thomas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S97",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S972",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S998",
    "academicYear" : "2016",
    "title" : "Graduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.999",
    "academicYear" : "2016",
    "title" : "Engineer's Degree Thesis Proposal Preparation",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "For students who must do additional work to convert an SM thesis to an ME thesis, or for students who write an ME thesis after having received an SM degree.",
    "instructors" : "R. Abeyaratne, M. S. Triantafyllou"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.THG",
    "academicYear" : "2016",
    "title" : "Graduate Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of advisor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of an SM, PhD, or ScD thesis; to be arranged by the student and an appropriate MIT faculty member.",
    "instructors" : "Consult R. Abeyaratne"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.THU",
    "academicYear" : "2016",
    "title" : "Undergraduate Thesis",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Individual self-motivated study, research, or design project under faculty supervision. Departmental program requirement: minimum of 6 units. Instruction and practice in written communication provided.",
    "instructors" : "Consult A. E. Hosoi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.UR",
    "academicYear" : "2016",
    "title" : "Undergraduate Research in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.URG",
    "academicYear" : "2016",
    "title" : "Undergraduate Research in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Individual study, research, or laboratory investigations under faculty supervision, including individual participation in an ongoing research project. See projects listing in Undergraduate Office, 1-110, for guidance.",
    "instructors" : "Consult N. Fang, K. Kamrin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.EPW",
    "academicYear" : "2016",
    "title" : "UPOP Engineering Practice Workshop",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.EPW, 2.EPW, 3.EPW, 6.EPW, 10.EPW, 16.EPW, 20.EPW, 22.EPW)",
    "prerequisites" : "None",
    "units" : "1-0-0 [P/D/F]",
    "optional" : null,
    "description" : "Develops foundational skills for the world of practice in science, technology, and engineering. Sophomores receive classroom instruction, and one-on-one and small-group coaching in basics of professional identity building. They attend field trips to local employers and receive job interview practice, coached by industry volunteers. Over IAP, students attend a weeklong Team Training Camp of experiential learning modules - led by MIT faculty with the help of MIT alums and other senior professionals in business, engineering, and science where students participate in creative simulations, team problem-solving challenges, and oral presentations, and practice networking with employers. Enrollment limited.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.EPE",
    "academicYear" : "2016",
    "title" : "UPOP Engineering Practice Experience",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.EPE, 2.EPE, 3.EPE, 6.EPE, 10.EPE, 16.EPE, 22.EPE)",
    "prerequisites" : "2.EPW or permission of instructor",
    "units" : "0-0-1 [P/D/F]",
    "optional" : null,
    "description" : "Provides sophomores with guided practice in finding opportunities and excelling in the world of practice. Building on the skills and relationships acquired in the Engineering Practice Workshop, students receive coaching to articulate goals, invoke the UPOP network of mentors and employers, identify and pursue opportunities and negotiate terms of their summer assignment. Students complete a 10-12 week internship, which includes filing three progress reports, conducting one informational interview, and possibly hosting a site visit by MIT staff.  Returning to campus as juniors, UPOP students take part in reflective exercises that aid assimilation of learning objectives and reinforce the cognitive link between all aspects of the UPOP experience and disciplinary fields of study. Sequence begins in the spring of sophomore year and ends in the fall of junior year.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.001",
    "academicYear" : "2016",
    "title" : "Mechanics and Materials I",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR); <I>Coreq: 18.03 or 2.087</I>",
    "units" : "3-2-7 REST",
    "optional" : null,
    "description" : "Introduction to statics and the mechanics of deformable solids. Emphasis on the three basic principles of equilibrium, geometric compatibility, and material behavior. Stress and its relation to force and moment; strain and its relation to displacement; linear elasticity with thermal expansion. Failure modes. Application to simple engineering structures such as rods, shafts, beams, and trusses.  Application to biomechanics of natural materials and structures.",
    "instructors" : "G. Barbastathis, A. E. Hosoi, K. Kamrin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.002",
    "academicYear" : "2016",
    "title" : "Mechanics and Materials II",
    "cluster" : null,
    "prerequisites" : "2.001, or 2.01 and 2.02B; Chemistry (GIR)",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Introduces mechanical behavior of engineering materials, and the use of materials in mechanical design.  Emphasizes the fundamentals of mechanical behavior of materials, as well as design with materials.  Major topics: elasticity, plasticity, limit analysis, fatigue, fracture, and creep.  Materials selection.  Laboratory experiments involving projects related to materials in mechanical design. Enrollment may be limited due to laboratory capacity; preference to Course 2 majors and minors.",
    "instructors" : "L. Anand, K. Kamrin, P. Reis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.004",
    "academicYear" : "2016",
    "title" : "Dynamics and Control II",
    "cluster" : null,
    "prerequisites" : "2.003 or 2.03; Physics II (GIR)",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Modeling, analysis, and control of dynamic systems. System modeling: lumped parameter models of mechanical, electrical, and electromechanical systems; interconnection laws; actuators and sensors. Linear systems theory: linear algebra; Laplace transform; transfer functions, time response and frequency response, poles and zeros; block diagrams; solutions via analytical and numerical techniques; stability. Introduction to feedback control: closed-loop response; PID compensation; steady-state characteristics, root-locus design concepts, frequency-domain design concepts. Laboratory experiments and control design projects. Enrollment may be limited due to laboratory capacity; preference to Course 2 majors and minors.",
    "instructors" : "G. Barbastathis, D. Del Vecchio, D. C. Gossard, D. E. Hardt, S. Lloyd"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.005",
    "academicYear" : "2016",
    "title" : "Thermal-Fluids Engineering I",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR), Calculus II (GIR); 2.086, 6.0002, or 18.06; or permission of instructor",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Integrated development of the fundamental principles of thermodynamics, fluid mechanics, and heat transfer with applications. Focuses on the development of the first and second laws of thermodynamics with special consideration of the rate processes associated with heat transfer and work transfer. Entropy generation and its influence on the performance of engineering systems. Conduction heat transfer in solids including steady-state and transient situations. Finned surfaces. Coupled and uncoupled fluid models. Hydrostatics. Inviscid flow analysis and Bernoulli equation. Internal and external laminar viscous flows. Turbulence. Boundary layers. Head loss in pipes.",
    "instructors" : "J. G. Brisson, J. Buongiorno, P. F. J. Lermusiaux, K. Varanasi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.006",
    "academicYear" : "2016",
    "title" : "Thermal-Fluids Engineering II",
    "cluster" : null,
    "prerequisites" : "2.005; or 2.051, 2.06",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Focuses on the application of the principles of thermodynamics, heat transfer, and fluid mechanics to the design and analysis of engineering systems. Laminar and turbulent flow. Heat transfer associated with laminar and turbulent flow of fluids in free and forced convection in channels and over surfaces. Pure substance model. Heat transfer in boiling and condensation. Thermodynamics and fluid mechanics of steady flow components of thermodynamic plants. Heat exchanger design. Power cycles and refrigeration plants. Design of thermodynamic plants. Radiation heat transfer. Multi-mode heat transfer and fluid flow in thermodynamic plants.",
    "instructors" : "J. G. Brisson, A. E. Hosoi, R. Karnik, G. H. McKinley"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.007",
    "academicYear" : "2016",
    "title" : "Design and Manufacturing I",
    "cluster" : null,
    "prerequisites" : "2.001 or 2.01; 2.670; <I>Coreq: 2.086</I>",
    "units" : "3-4-5",
    "optional" : null,
    "description" : "Develops students' competence and self-confidence as design engineers. Emphasis on the creative design process bolstered by application of physical laws.  Instruction on how to complete projects on schedule and within budget. Robustness and manufacturability are emphasized. Subject relies on active learning via a major design-and-build project. Lecture topics include idea generation, estimation, concept selection, visual thinking, computer-aided design (CAD), mechanism design, machine elements, basic electronics, technical communication, and ethics. Lab fee. Limited enrollment. Pre-registration required for lab assignment; special sections by lottery only.",
    "instructors" : "D. Frey, S. Kim, A. Winter"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.008",
    "academicYear" : "2016",
    "title" : "Design and Manufacturing II",
    "cluster" : null,
    "prerequisites" : "2.007 or <I>Coreq: 2.017; 2.005 or 2.051</I>",
    "units" : "3-3-6 1/2 Institute LAB",
    "optional" : null,
    "description" : "Integration of design, engineering, and management disciplines and practices for analysis and design of manufacturing enterprises. Emphasis is on the physics and stochastic nature of manufacturing processes and systems, and their effects on quality, rate, cost, and flexibility. Topics include process physics and control, design for manufacturing, and manufacturing systems. Group project requires design and fabrication of parts using mass-production and assembly methods to produce a product in quantity. Six units may be applied to the General Institute Lab Requirement. Enrollment may be limited due to laboratory capacity; preference to Course 2 majors and minors.",
    "instructors" : "J.-H. Chun, M. L. Culpepper, S. Kim, S. G. Kim, S. E. Sarma, J. Hart"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.009",
    "academicYear" : "2016",
    "title" : "The Product Engineering Process",
    "cluster" : null,
    "prerequisites" : "2.001 or 2.01; 2.003 or 2.03; 2.005 or 2.051; 2.670, 2.678 or 2.00B",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Students develop an understanding of product development phases and experience working in teams to design and construct high-quality product prototypes. Design process learned is placed into a broader development context. Primary goals are to improve ability to reason about design alternatives and apply modeling techniques appropriate for different development phases; understand how to gather and process customer information and transform it into engineering specifications; and use teamwork to resolve the challenges in designing and building a substantive product prototype. Instruction and practice in oral communication provided. Enrollment may be limited due to laboratory capacity; preference to Course 2 seniors.",
    "instructors" : "D. R. Wallace"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.032",
    "academicYear" : "2016",
    "title" : "Dynamics",
    "cluster" : null,
    "prerequisites" : "2.003",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Review of momentum principles. Hamilton's principle and Lagrange's equations. Three-dimensional kinematics and dynamics of rigid bodies. Study of steady motions and small deviations therefrom, gyroscopic effects, causes of instability. Free and forced vibrations of lumped-parameter and continuous systems. Nonlinear oscillations and the phase plane. Nonholonomic systems. Introduction to wave propagation in continuous systems.",
    "instructors" : "T. R. Akylas, T. Peacock, N. Hadjiconstantinou"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.034",
    "academicYear" : "2016",
    "title" : "Nonlinear Dynamics and Waves",
    "cluster" : "(Same subject as 1.685J, 18.377J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A unified treatment of nonlinear oscillations and wave phenomena with applications to mechanical, optical, geophysical, fluid, electrical and flow-structure interaction problems. Nonlinear free and forced vibrations; nonlinear resonances; self-excited oscillations; lock-in phenomena.  Nonlinear dispersive and nondispersive waves; resonant wave interactions; propagation of wave pulses and nonlinear Schrodinger equation.  Nonlinear long waves and breaking; theory of characteristics; the Korteweg-de Vries equation; solitons and solitary wave interactions.  Stability of shear flows.  Some topics and applications may vary from year to year.",
    "instructors" : "T. R. Akylas, R. R. Rosales"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.062",
    "academicYear" : "2016",
    "title" : "Wave Propagation",
    "cluster" : "(Same subject as 1.138J, 18.376J)",
    "prerequisites" : "2.003, 18.075",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Theoretical concepts and analysis of wave problems in science and engineering with examples chosen from elasticity, acoustics, geophysics, hydrodynamics, blood flow, nondestructive evaluation, and other applications.  Progressive waves, group velocity and dispersion, energy density and transport. Reflection, refraction and transmission of plane waves by an interface. Mode conversion in elastic waves. Rayleigh waves. Waves due to a moving load. Scattering by a two-dimensional obstacle.  Reciprocity theorems. Parabolic approximation. Waves on the sea surface. Capillary-gravity waves. Wave resistance. Radiation of surface waves. Internal waves in stratified fluids.  Waves in rotating media.  Waves in random media.",
    "instructors" : "T. R. Akylas, R. R. Rosales"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.072",
    "academicYear" : "2016",
    "title" : "Mechanics of Continuous Media",
    "cluster" : null,
    "prerequisites" : "2.071",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Principles and applications of continuum mechanics. Kinematics of deformation. Thermomechanical conservation laws. Stress and strain measures. Constitutive equations including some examples of their microscopic basis.  Solution of some basic problems for various materials as relevant in materials science, fluid dynamics, and structural analysis. Inherently nonlinear phenomena in continuum mechanics. Variational principles.",
    "instructors" : "L. Anand"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.073",
    "academicYear" : "2016",
    "title" : "Solid Mechanics: Plasticity and Inelastic Deformation",
    "cluster" : null,
    "prerequisites" : "2.071",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Physical basis of plastic/inelastic deformation of solids; metals, polymers, granular/rock-like materials. Continuum constitutive models for small and large deformation of elastic-(visco)plastic solids. Analytical and numerical solution of selected boundary value problems. Applications to deformation processing of metals.",
    "instructors" : "L. Anand, D. M. Parks"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.084",
    "academicYear" : "2016",
    "title" : "Structural Mechanics in Nuclear Power Technology",
    "cluster" : "(Same subject as 1.56J, 22.314J)",
    "prerequisites" : "2.001 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 22.314J.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.093",
    "academicYear" : "2016",
    "title" : "Finite Element Analysis of Solids and Fluids I",
    "cluster" : "(Subject meets with 2.092)",
    "prerequisites" : "2.001 or 2.01; 2.003 or 2.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Finite element methods for analysis of steady-state and transient problems in solid, structural, fluid mechanics, and heat transfer. Presents finite element methods and solution procedures for linear and nonlinear analyses using largely physical arguments. Demonstrates finite element analyses. Homework involves use of an existing general purpose finite element analysis program. Includes modeling of problems and interpretation of numerical results. Students taking graduate version complete additional assignments.",
    "instructors" : "K. J. Bathe"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.094",
    "academicYear" : "2016",
    "title" : "Finite Element Analysis of Solids and Fluids II",
    "cluster" : null,
    "prerequisites" : "2.001",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents finite element theory and methods for general linear and nonlinear analyses. Reliable and effective finite element methods and their applications to solution of general problems in solid, structural and fluid mechanics, heat and mass transfer, and multiphysics problems including fluid-structure interactions.  Formulation of governing continuum mechanics equations, conservation laws, virtual work, and variational principles for finite element solutions. Discretization of governing equations using finite element methods; stability, accuracy and convergence of methods. Solution of central problems and a term project using an existing general purpose finite element analysis program.",
    "instructors" : "K. J. Bathe"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.096",
    "academicYear" : "2016",
    "title" : "Introduction to Numerical Simulation",
    "cluster" : "(Same subject as 6.336J, 16.910J)",
    "prerequisites" : "18.03 or 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 6.336J.",
    "instructors" : "L. Daniel, J. K. White"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.097",
    "academicYear" : "2016",
    "title" : "Numerical Methods for Partial Differential Equations",
    "cluster" : "(Same subject as 6.339J, 16.920J)",
    "prerequisites" : "18.03 or 18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 16.920J.",
    "instructors" : "Q. Wang, J. K. White"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.110",
    "academicYear" : "2016",
    "title" : "Information, Entropy, and Computation",
    "cluster" : "(Same subject as 6.050J)",
    "prerequisites" : "Physics I (GIR)",
    "units" : "4-0-5",
    "optional" : null,
    "description" : "See description under subject 6.050J.",
    "instructors" : "P. Penfield, Jr., S. Lloyd"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.14",
    "academicYear" : "2016",
    "title" : "Analysis and Design of Feedback Control Systems",
    "cluster" : "(Subject meets with 2.140)",
    "prerequisites" : "2.004, 2.04A, or 2.04B",
    "units" : "3-3-6",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.141",
    "academicYear" : "2016",
    "title" : "Modeling and Simulation of Dynamic Systems",
    "cluster" : null,
    "prerequisites" : "2.151",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Modeling multidomain engineering systems at a level of detail suitable for design and control system implementation. Network representation, state-space models; multiport energy storage and dissipation, Legendre transforms; nonlinear mechanics, transformation theory, Lagrangian and Hamiltonian forms; Control-relevant properties. Application examples may include electro-mechanical transducers, mechanisms, electronics, fluid and thermal systems, compressible flow, chemical processes, diffusion, and wave transmission.",
    "instructors" : "N. Hogan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.151",
    "academicYear" : "2016",
    "title" : "Advanced System Dynamics and Control",
    "cluster" : null,
    "prerequisites" : "2.004, 18.06; or 2.087, 2.04A",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Analytical and graphical descriptions of state-determined dynamic physical systems; time and frequency domain representations; system characteristics - controllability, observability, stability; linear and nonlinear system responses. Modification of system characteristics using feedback. State observers, Kalman filters. Modeling/performance trade-offs in control system design. Emphasis on application of techniques to physical systems.",
    "instructors" : "K. Youcef-Toumi, N. Hogan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.160",
    "academicYear" : "2016",
    "title" : "Identification, Estimation, and Learning",
    "cluster" : null,
    "prerequisites" : "2.151",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides a broad theoretical basis for system identification, estimation, and learning. Least squares estimation and its convergence properties, Kalman filter and extended Kalman filter, noise dynamics and system representation, function approximation theory, neural nets, radial basis functions, wavelets, Volterra expansions, informative data sets, persistent excitation, asymptotic variance, central limit theorems, model structure selection, system order estimate, maximum likelihood, unbiased estimates, Cramer-Rao lower bound, Kullback-Leibler information distance, Akaike's information criterion, experiment design, and model validation.",
    "instructors" : "H. Asada, J.-J. E. Slotine"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.25",
    "academicYear" : "2016",
    "title" : "Fluid Mechanics",
    "cluster" : null,
    "prerequisites" : "2.006 or 2.06; <I>Coreq: 18.075 or 18.085</I>",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Survey of principal concepts and methods of fluid dynamics. Mass conservation, momentum, and energy equations for continua. Navier-Stokes equation for viscous flows. Similarity and dimensional analysis. Lubrication theory. Boundary layers and separation. Circulation and vorticity theorems. Potential flow. Introduction to turbulence. Lift and drag. Surface tension and surface tension driven flows.",
    "instructors" : "A. F. Ghoniem, A. E. Hosoi, G. H. McKinley, A. T. Patera"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.27",
    "academicYear" : "2016",
    "title" : "Turbulent and Separated Flows",
    "cluster" : null,
    "prerequisites" : "2.20 or 2.25; 18.075",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Governing equations, and statistical and dynamical theories of turbulence. Isotropic homogeneous turbulence, near wall turbulence, effects of free surface and surfactants and moving body boundary. Direct numerical simulations, large eddy simulations and sub-grid scale modeling, Reynolds-Average Navier-Stokes (RANS) equations and RANS turbulence models. Flow instability and transitions, almost parallel flows and inviscid and viscous instabilities. Laminar and turbulent separation, expansion flows, separated flows past bluff and streamlined bodies; flow induced vibrations.",
    "instructors" : "D. Yue, A. Techet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.28",
    "academicYear" : "2016",
    "title" : "Fundamentals and Applications of Combustion",
    "cluster" : null,
    "prerequisites" : "2.006, or 2.051 and 2.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Fundamentals and modeling of reacting gas dynamics and combustion using analytical and numerical methods. Conservation equations of reacting flows. Multi-species transport, chemical thermodynamics and chemical kinetics. Non-equilibrium flow. Detonation and reacting boundary layers. Ignition, flammability, and extinction. Premixed and diffusion flames. Combustion instabilities. Supersonic combustion. Turbulent combustion. Liquid and solid burning. Fire, safety, and environmental impact. Applications to power and propulsion.",
    "instructors" : "A. F. Ghoniem"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.341",
    "academicYear" : "2016",
    "title" : "Macromolecular Hydrodynamics",
    "cluster" : "(Same subject as 10.531J)",
    "prerequisites" : "2.25, 10.301, or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Physical phenomena in polymeric liquids undergoing deformation and flow. Kinematics and material functions for complex fluids; techniques of viscometry, rheometry; and linear viscoelastic measurements for polymeric fluids. Generalized Newtonian fluids. Continuum mechnanics, frame invariance, and convected derivatives for finite strain viscoelasticity. Differential and integral constitutive equations for viscoelastic fluids. Analytical solutions to isothermal and non-isothermal flow problems; the roles of non-Newtonian viscosity, linear viscoelasticity, normal stresses, elastic recoil, stress relaxation in processing flows. Introduction to molecular theories for dynamics of polymeric fluids. (Extensive class project and presentation required instead of a final exam).",
    "instructors" : "G. H. McKinley"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.51",
    "academicYear" : "2016",
    "title" : "Intermediate Heat and Mass Transfer",
    "cluster" : null,
    "prerequisites" : "2.006, or 2.051 and 2.06, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Analysis, modeling, and design of heat and mass transfer processes with application to common technologies. Unsteady heat conduction in one or more dimensions, steady conduction in multidimensional configurations, numerical simulation; forced convection in laminar and turbulent flows; natural convection in internal and external configurations; phase change heat transfer; thermal radiation, black bodies, grey radiation networks, spectral and solar radiation; mass transfer at low rates, evaporation.",
    "instructors" : "J. H. Lienhard, E. N. Wang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.55",
    "academicYear" : "2016",
    "title" : "Advanced Heat and Mass Transfer",
    "cluster" : null,
    "prerequisites" : "2.51",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Advanced treatment of fundamental aspects of heat and mass transport. Covers topics such as diffusion kinetics, conservation laws, laminar and turbulent convection, mass transfer including phase change or heterogeneous reactions, and basic thermal radiation. Problems and examples include theory and applications drawn from a spectrum of engineering design and manufacturing problems.",
    "instructors" : "J. H. Lienhard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.56",
    "academicYear" : "2016",
    "title" : "Conduction and Change of Phase Heat Transfer",
    "cluster" : null,
    "prerequisites" : "2.51, <I>Coreq: 18.075</I>",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Solutions of steady and transient heat conduction problems with various boundary conditions. Approximate methods: application of numerical techniques. Moving boundaries: problems in freezing and melting. Condensation heat transfer. Boiling: mechanisms and heat transfer correlations. Thermal modeling of engineering systems: thermal contact resistance; heat and mass transfer in material processing; heat transfer in biomedical systems.",
    "instructors" : "J. H. Lienhard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.57",
    "academicYear" : "2016",
    "title" : "Nano-to-Macro Transport Processes",
    "cluster" : "(Subject meets with 2.570)",
    "prerequisites" : "2.005, 2.051, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.58",
    "academicYear" : "2016",
    "title" : "Radiative Transfer",
    "cluster" : "(Same subject as 10.74J)",
    "prerequisites" : "2.51, 10.302, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Principles of thermal radiation and their application to engineering heat and photon transfer problems. Quantum and classical models of radiative properties of materials, electromagnetic wave theory for thermal radiation, radiative transfer in absorbing, emitting, and scattering media, and coherent laser radiation. Applications cover laser-material interactions, imaging, infrared instrumentation, global warming, semiconductor manufacturing, combustion, furnaces, and high temperature processing.",
    "instructors" : "G. Chen"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.61",
    "academicYear" : "2016",
    "title" : "Internal Combustion Engines",
    "cluster" : null,
    "prerequisites" : "2.006",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Fundamentals of how the design and operation of internal combustion engines affect their performance, efficiency, fuel requirements, and environmental impact.  Study of fluid flow, thermodynamics, combustion, heat transfer and friction phenomena, and fuel properties, relevant to engine power, efficiency, and emissions.  Examination of design features and operating characteristics of different types of internal combustion engines:  spark-ignition, diesel, stratified-charge, and mixed-cycle engines.  Engine Laboratory project.  For graduate and senior undergraduate students.",
    "instructors" : "W. K. Cheng"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.66",
    "academicYear" : "2016",
    "title" : "Fundamentals of Energy in Buildings",
    "cluster" : "(Same subject as 1.044J, 4.42J)",
    "prerequisites" : "Physics I (GIR), Calculus II (GIR)",
    "units" : "3-2-7 REST",
    "optional" : null,
    "description" : "See description under subject 4.42J.",
    "instructors" : "L. R. Glicksman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.670",
    "academicYear" : "2016",
    "title" : "Mechanical Engineering Tools",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "0-1-2",
    "optional" : null,
    "description" : "Introduces the fundamentals of machine tools use and fabrication techniques. Students work with a variety of machine tools including the bandsaw, milling machine, and lathe. Mechanical Engineering students are advised to take this subject in the first IAP after declaring their major. Enrollment may be limited due to laboratory capacity. Preference to Course 2 majors and minors.",
    "instructors" : "M. Culpepper"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.671",
    "academicYear" : "2016",
    "title" : "Measurement and Instrumentation",
    "cluster" : null,
    "prerequisites" : "2.001 or 2.01; 2.003 or 2.03; Physics II (GIR)",
    "units" : "3-3-6 Institute LAB",
    "optional" : null,
    "description" : "Experimental techniques for observation and measurement of physical variables such as force, strain, temperature, flow rate, and acceleration. Emphasizes principles of transduction, measurement circuitry, MEMS sensors, Fourier transforms, linear and nonlinear function fitting, uncertainty analysis, probability density functions and statistics, system identification, electrical impedance analysis and transfer functions, computer-aided experimentation, and technical reporting. Typical laboratory experiments involve oscilloscopes, electronic circuits including operational amplifiers, thermocouples, strain gauges, digital recorders, lasers, etc. Basic material and lab objectives are developed in lectures. Instruction and practice in oral and written communication provided. Enrollment limited.",
    "instructors" : "I. W. Hunter, J. J. Leonard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.672",
    "academicYear" : "2016",
    "title" : "Project Laboratory",
    "cluster" : null,
    "prerequisites" : "2.001, 2.003, 2.006, 2.671",
    "units" : "0-3-3 1/2 Institute LAB",
    "optional" : null,
    "description" : "Major emphasis on interplay between analytical and experimental methods in solution of research and development problems. Communication (written and oral) of results is also a strong component of the course. Groups of two or three students work together on three projects during the term. Enrollment limited.",
    "instructors" : "W. Cheng, D. P. Hart, E. Wang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.71",
    "academicYear" : "2016",
    "title" : "Optics",
    "cluster" : "(Subject meets with 2.710)",
    "prerequisites" : "Physics II (GIR); 18.03; 2.004, 2.04A, 2.04B, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.710",
    "academicYear" : "2016",
    "title" : "Optics",
    "cluster" : "(Subject meets with 2.71)",
    "prerequisites" : "Physics II (GIR); 18.03; 2.004, 2.04A, 2.04B, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to optical science with elementary engineering applications. Geometrical optics: ray-tracing, aberrations, lens design, apertures and stops, radiometry and photometry. Wave optics: basic electrodynamics, polarization, interference, wave-guiding, Fresnel and Fraunhofer diffraction, image formation, resolution, space-bandwidth product. Emphasis on analytical and numerical tools used in optical design. Graduate students are required to complete additional assignments with stronger analytical content, and an advanced design project.",
    "instructors" : "G. Barbastathis, P. T. So"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.72",
    "academicYear" : "2016",
    "title" : "Elements of Mechanical Design",
    "cluster" : "(Subject meets with 2.720)",
    "prerequisites" : "2.005 or 2.051; 2.008; <I>Coreq: 2.671</I>",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Advanced study of modeling, design, integration, and best practices for use of machine elements, such as bearings, bolts, belts, flexures, and gears. Modeling and analysis is based upon rigorous application of physics, mathematics, and core mechanical engineering principles, which are reinforced via laboratory experiences and a design project in which students model, design, fabricate, and characterize a mechanical system that is relevant to a real-world application. Activities and quizzes are directly related to, and coordinated with, the project deliverables. Develops the ability to synthesize, model and fabricate a design subject to engineering constraints (e.g., cost, time, schedule). Students taking graduate version complete additional assignments. Enrollment limited.",
    "instructors" : "M. L. Culpepper"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.737",
    "academicYear" : "2016",
    "title" : "Mechatronics",
    "cluster" : null,
    "prerequisites" : "6.071 or 6.002; 2.14, 6.302, or 16.30",
    "units" : "3-5-4",
    "optional" : null,
    "description" : "Introduction to designing mechatronic systems, which require integration of the mechanical and electrical engineering disciplines within a unified framework. Significant laboratory-based design experiences form subject's core. Final project. Topics include: low-level interfacing of software with hardware; use of high-level graphical programming tools to implement real-time computation tasks; digital logic; analog interfacing and power amplifiers; measurement and sensing; electromagnetic and optical transducers; control of mechatronic systems. Limited to 20.",
    "instructors" : "D. L. Trumper, K. Youcef-Toumi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.739",
    "academicYear" : "2016",
    "title" : "Product Design and Development",
    "cluster" : "(Same subject as 15.783J, ESD.32J)",
    "prerequisites" : "2.009, 15.761, 15.778, 15.810, or permission of instructor",
    "units" : "3-3-6",
    "optional" : "Credit cannot also be received for ESD.40",
    "description" : "See description under subject 15.783J.",
    "instructors" : "S. Eppinger, M. C. Yang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.782",
    "academicYear" : "2016",
    "title" : "Design of Medical Devices and Implants",
    "cluster" : "(Same subject as 3.961J, 20.451J, HST.524J)",
    "prerequisites" : "Chemistry (GIR), Biology (GIR), Physics I (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Solution of clinical problems by use of implants and other medical devices. Systematic use of cell-matrix control volumes. The role of stress analysis in the design process. Anatomic fit: shape and size of implants. Selection of biomaterials. Instrumentation for surgical implantation procedures. Preclinical testing for safety and efficacy: risk/benefit ratio assessment. Evaluation of clinical performance: design of clinical trials. Project materials drawn from orthopedic devices, soft tissue implants, artificial organs, and dental implants.",
    "instructors" : "I. V. Yannas, M. Spector"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.785",
    "academicYear" : "2016",
    "title" : "Cell-Matrix Mechanics",
    "cluster" : "(Same subject as 3.97J, 20.411J, HST.523J)",
    "prerequisites" : "2.001, or 2.01 and 2.02A; Chemistry (GIR), Biology (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Mechanical forces play a decisive role during development of tissues and organs, during remodeling following injury as well as in normal function. A stress field influences cell function primarily through deformation of the extracellular matrix to which cells are attached. Deformed cells express different biosynthetic activity relative to undeformed cells. The unit cell process paradigm combined with topics in connective tissue mechanics form the basis for discussions of several topics from cell biology, physiology, and medicine.",
    "instructors" : "I. V. Yannas, M. Spector"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.791",
    "academicYear" : "2016",
    "title" : "Cellular Biophysics and Neurophysiology",
    "cluster" : "(Same subject as 6.021J, 20.370J)\n(Subject meets with 2.794J, 6.521J, 20.470J, HST.541J)",
    "prerequisites" : "Physics II (GIR); 18.03; 2.005, 6.002, 6.003, 6.071, 10.301, 20.110, 20.111, or permission of instructor",
    "units" : "5-2-5",
    "optional" : null,
    "description" : "See description under subject 6.021J.",
    "instructors" : "J. Han, T. Heldt, J. Voldman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.792",
    "academicYear" : "2016",
    "title" : "Quantitative Systems Physiology",
    "cluster" : "(Same subject as 6.022J, 20.371J, HST.542J)\n(Subject meets with 2.796J, 6.522J, 20.471J)",
    "prerequisites" : "Physics II (GIR), 18.03, or permission of instructor",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "See description under subject 6.022J.",
    "instructors" : "T. Heldt, R. G. Mark, C. M. Stultz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.794",
    "academicYear" : "2016",
    "title" : "Cellular Biophysics",
    "cluster" : "(Same subject as 6.521J, 20.470J, HST.541J)\n(Subject meets with 2.791J, 6.021J, 20.370J)",
    "prerequisites" : "Physics II (GIR); 18.03; 2.005, 6.002, 6.003, 6.071, 10.301, 20.110, or permission of instructor",
    "units" : "5-2-5",
    "optional" : null,
    "description" : "See description under subject 6.521J.",
    "instructors" : "J. Han, T. Heldt, J. Voldman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.796",
    "academicYear" : "2016",
    "title" : "Quantitative Physiology: Organ Transport Systems",
    "cluster" : "(Same subject as 6.522J, 20.471J)\n(Subject meets with 2.792J, 6.022J, 20.371J, HST.542J)",
    "prerequisites" : "2.006 or 6.013; 6.021",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "See description under subject 6.522J.",
    "instructors" : "T. Heldt, R. G. Mark, C. M. Stultz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.810",
    "academicYear" : "2016",
    "title" : "Manufacturing Processes and Systems",
    "cluster" : null,
    "prerequisites" : "2.001, 2.006, 2.008",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Introduction to manufacturing processes and manufacturing systems including assembly, machining, injection molding, casting, thermoforming, and more. Emphasis on the physics and randomness and how they influence quality, rate, cost, and flexibility. Attention to the relationship between the process and the system, and the process and part design. Project (in small groups) requires fabrication (and some design) of a product using several different processes (as listed above). Enrollment may be limited due to laboratory constraints.",
    "instructors" : "T. G. Gutowski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.851",
    "academicYear" : "2016",
    "title" : "System Optimization and Analysis for Operations",
    "cluster" : "(Same subject as 15.066J, ESD.750J)",
    "prerequisites" : "Calculus II (GIR)",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 15.066J.",
    "instructors" : "V. Farias"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.852",
    "academicYear" : "2016",
    "title" : "Manufacturing Systems Analysis",
    "cluster" : null,
    "prerequisites" : "6.041 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Models of manufacturing systems, including transfer lines and flexible manufacturing systems. Calculation of performance measures, including throughput, in-process inventory, and meeting production commitments. Real-time control of scheduling. Effects of machine failure, set-ups, and other disruptions on system performance.",
    "instructors" : "S. B. Gershwin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.890",
    "academicYear" : "2016",
    "title" : "Global Operations Leadership Seminar",
    "cluster" : "(Same subject as 10.792J, 15.792J, 16.985J)",
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 15.792J.",
    "instructors" : "T. Roemer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.96",
    "academicYear" : "2016",
    "title" : "Management in Engineering",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 2.96, 6.930, 10.806, 16.653)",
    "prerequisites" : "None",
    "units" : "3-1-8",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S999",
    "academicYear" : "2016",
    "title" : "Graduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced lecture, seminar, or laboratory consisting of material not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.  2.S980 and 2.S996 are graded P/D/F.",
    "instructors" : "Consult R. Abeyaratne"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.978",
    "academicYear" : "2016",
    "title" : "Instruction in Teaching Engineering",
    "cluster" : "(Subject meets with 1.95J, 5.95J, 6.982J, 7.59J, 8.395J, 18.094J)",
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "Participatory seminar focuses on the knowledge and skills necessary for teaching engineering in higher education. Topics include research on learning; course development; promoting active learning, problemsolving, and critical thinking in students; communicating with a diverse student body; using educational technology to further learning; lecturing; creating effective tests and assignments; and assessment and evaluation. Field-work teaching various subjects in the Mechanical Engineering department will complement classroom discussions.",
    "instructors" : "J. Rankin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.797",
    "academicYear" : "2016",
    "title" : "Molecular, Cellular, and Tissue Biomechanics",
    "cluster" : "(Same subject as 3.053J, 6.024J, 20.310J)",
    "prerequisites" : "2.370 or 2.772J; 18.03 or 3.016; Biology (GIR)",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Develops and applies scaling laws and the methods of continuum mechanics to biomechanical phenomena over a range of length scales. Topics include structure of tissues and the molecular basis for macroscopic properties; chemical and electrical effects on mechanical behavior; cell mechanics, motility and adhesion; biomembranes; biomolecular mechanics and molecular motors. Experimental methods for probing structures at the tissue, cellular, and molecular levels.",
    "instructors" : "M. Bathe, A. J. Grodzinsky"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.994",
    "academicYear" : "2016",
    "title" : "Independent Study",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Designed for undergraduates wanting to continue substantial projects of own choice, under faculty supervision, in mechanical engineering. Work may be of experimental, theoretical, or design nature. Projects may be arranged individually in most fields of department interest, i.e., in mechanics, design and manufacturing, controls and robotics, thermal science and energy engineering, bioengineering, ocean engineering and nanotechnology.  2.993 is letter-graded; 2.994 is P/D/F.",
    "instructors" : "Consult A. E. Hosoi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.998",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Assigned reading and problems or research in distinct areas, either theoretical or experimental, or design. Arranged on individual basis with instructor in the following areas: mechanics and materials, thermal and fluid sciences, systems and design, biomedical engineering, and ocean engineering. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Consult R. Abeyaratne"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.650",
    "academicYear" : "2016",
    "title" : "Introduction to Sustainable Energy",
    "cluster" : "(Same subject as 10.291J, 22.081J)\n(Subject meets with 1.818J, 2.65J, 10.391J, 11.371J, 22.811J, ESD.166J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "See description under subject 22.081J.",
    "instructors" : "M. W. Golay"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S971",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.627",
    "academicYear" : "2016",
    "title" : "Fundamentals of Photovoltaics",
    "cluster" : "(Subject meets with 2.626)",
    "prerequisites" : "Permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Fundamentals of photoelectric conversion: charge excitation, conduction, separation, and collection. Studies commercial and emerging photovoltaic technologies. Cross-cutting themes include conversion efficiencies, loss mechanisms, characterization, manufacturing, systems, reliability, life-cycle analysis, and risk analysis. Photovoltaic technology evolution in the context of markets, policies, society, and environment. Graduate students complete additional work.",
    "instructors" : "T. Buonassisi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.140",
    "academicYear" : "2016",
    "title" : "Analysis and Design of Feedback Control Systems",
    "cluster" : "(Subject meets with 2.14)",
    "prerequisites" : "2.004, 2.04A, 2.04B, or permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Develops the fundamentals of feedback control using linear transfer function system models. Analysis in time and frequency domains. Design in the s-plane (root locus) and in the frequency domain (loop shaping). Describing functions for stability of certain non-linear systems.  Extension to state variable systems and multivariable control with observers. Discrete and digital hybrid systems and use of z-plane design. Extended design case studies and capstone group projects. Student taking graduate version complete additional assignments. Enrollment may be limited due to laboratory capacity.",
    "instructors" : "D. Rowell, D. L. Trumper, K. Youcef-Toumi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.719",
    "academicYear" : "2016",
    "title" : "Photonic Materials",
    "cluster" : "(Subject meets with 2.718)",
    "prerequisites" : "2.003, 8.03, 6.161, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides a review of Maxwell's equations and the Helmholtz wave equation. Optical devices: waveguides and cavities, phase and group velocity, causality, and scattering. Light-matter interaction in bulk, surface, and subwavelength-structured matter. Effective media, dispersion relationships, wavefronts and rays, eikonal description of light propagation, phase singularities. Transformation optics, gradient effective media. Includes description of the experimental tools for realization and measurement of photonic materials and effects. Students taking graduate version complete additional assignments.",
    "instructors" : "G. Barbastathis, N. Fang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.718",
    "academicYear" : "2016",
    "title" : "Photonic Materials",
    "cluster" : "(Subject meets with 2.719)",
    "prerequisites" : "2.003, 8.03, 6.161, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.83",
    "academicYear" : "2016",
    "title" : "Energy, Materials and Manufacturing",
    "cluster" : "(Subject meets with 2.813)",
    "prerequisites" : "2.008 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to the major dilemma that faces manufacturing and society for the 21st century: how to support economic development while protecting the environment. Subject addresses industrial ecology, materials flows, life-cycle analysis, thermodynamic analysis and exergy accounting, manufacturing process performance, product design analysis, design for the environment, recycling and ecological economics. Combines lectures and group discussions of journal articles and selected literature, often with opposing views. Graduate students complete term-long project with report required for graduate credit.",
    "instructors" : "T. G. Gutowski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.813",
    "academicYear" : "2016",
    "title" : "Energy, Materials, and Manufacturing",
    "cluster" : "(Subject meets with 2.83)",
    "prerequisites" : "2.008 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to the major dilemma that faces manufacturing and society for the 21st century: how to support economic development while protecting the environment. Subject addresses industrial ecology, materials flows, life-cycle analysis, thermodynamic analysis and exergy accounting, manufacturing process performance, product design analysis, design for the environment, recycling and ecological economics. Combines lectures and group discussions of journal articles and selected literature, often with opposing views. Graduate students complete term-long project with report required for graduate credit.",
    "instructors" : "T. G. Gutowski"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.854",
    "academicYear" : "2016",
    "title" : "Introduction to Manufacturing Systems",
    "cluster" : "(Subject meets with 2.853)",
    "prerequisites" : "Undergraduate mathematics",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides ways to analyze manufacturing systems in terms of material flow and storage, information flow, capacities, and times and durations of events. Fundamental topics include probability, inventory and queuing models, forecasting, optimization, process analysis, and linear and dynamic systems. Factory planning and scheduling topics include flow planning, bottleneck characterization, buffer and batch-size tactics, seasonal planning, and dynamic behavior of production systems. Graduate students are required to complete additional assignments.",
    "instructors" : "S. B. Gershwin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S792",
    "academicYear" : "2016",
    "title" : "Graduate Special Subject in Bioengineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced lecture, seminar or laboratory course consisting of material in the broadly-defined field of bioengineering not offered in regularly scheduled subjects. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Consult R. Kamm"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.071",
    "academicYear" : "2016",
    "title" : "Mechanics of Solid Materials",
    "cluster" : null,
    "prerequisites" : "2.002 or 2.02A",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Fundamentals of solid mechanics applied to the mechanical behavior of engineering materials. Kinematics of deformation, stress, and balance principles. Isotropic linear elasticity and isotropic linear thermal elasticity. Variational and energy methods. Linear viscoelasticity. Small-strain elastic-plastic deformation. Mechanics of large deformation; nonlinear hyperelastic material behavior. Foundations and methods of deformable-solid mechanics, including relevant applications. Provides base for further study and specialization within solid mechanics, including continuum mechanics, computational mechanics (e.g., finite-element methods), plasticity, fracture mechanics, structural mechanics, and nonlinear behavior of materials.",
    "instructors" : "L. Anand, D. M. Parks"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.036",
    "academicYear" : "2016",
    "title" : "Nonlinear Dynamics and Chaos",
    "cluster" : "(Same subject as 18.385J)",
    "prerequisites" : "18.03 or 18.034",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 18.385J.",
    "instructors" : "R. R. Rosales"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.391",
    "academicYear" : "2016",
    "title" : "Nanostructure Fabrication",
    "cluster" : "(Same subject as 6.781J)",
    "prerequisites" : "6.152, 6.161, or 2.710; or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 6.781J.",
    "instructors" : "H. I. Smith, G. Barbastathis, K. K. Berggren"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.853",
    "academicYear" : "2016",
    "title" : "Introduction to Manufacturing Systems",
    "cluster" : "(Subject meets with 2.854)",
    "prerequisites" : "2.008",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.017",
    "academicYear" : "2016",
    "title" : "Design of Electromechanical Robotic Systems",
    "cluster" : "(Same subject as 1.015J)",
    "prerequisites" : "2.003 or 2.03; <I>Coreq: 2.005, 2.05 and 2.051, or 2.016; 2.671</I>",
    "units" : "3-3-6 1/2 Institute LAB",
    "optional" : null,
    "description" : "Design, construction, and testing of field robotic systems, through team projects with each student responsible for a specific subsystem. Projects focus on electronics, instrumentation, and machine elements. Design for operation in uncertain conditions is a focus point, with ocean waves and marine structures as a central theme. Basic statistics, linear systems, Fourier transforms, random processes, spectra and extreme events with applications in design.  Lectures on ethics in engineering practice included. Enrollment may be limited due to laboratory capacity.",
    "instructors" : "F. S. Hover, J. J. Leonard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.689",
    "academicYear" : "2016",
    "title" : "Projects in Oceanographic Engineering",
    "cluster" : "(Same subject as 1.699J)",
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Projects in oceanographic engineering, carried out under supervision of Woods Hole Oceanographic Institution staff. Given at Woods Hole Oceanographic Institution.",
    "instructors" : "J. Preisig, Woods Hole Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.705",
    "academicYear" : "2016",
    "title" : "Projects in New Concept Naval Ship Design",
    "cluster" : null,
    "prerequisites" : "2.704",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Focus on preliminary design of a new naval ship, fulfilling a given set of mission requirements. Design plan formulation, system level trade-off studies, emphasizes achieving a balanced design and total system integration. Formal written and oral reports. Team projects extend over three terms.",
    "instructors" : "M. Thomas, J. Ketcham"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.961",
    "academicYear" : "2016",
    "title" : "Management in Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Introduction and overview of engineering management. Financial principles, management of innovation, technical strategy and best management practices. Case study method of instruction emphasizes participation in class discussion. Focus is on the development of individual skills and management tools.",
    "instructors" : "J.-H. Chun, H. S. Marcus"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.674",
    "academicYear" : "2016",
    "title" : "Micro/Nano Engineering Laboratory",
    "cluster" : null,
    "prerequisites" : "2.001 or 2.01; 2.003 or 2.03; 2.005, or 2.051 and 2.06; 2.671 or permission of instructor",
    "units" : "1-3-2",
    "optional" : null,
    "description" : "Concepts, ideas, and enabling tools of nanoengineering taught through lab modules and imaging tools, which include microfluidics, microthermal systems, MEMS, nanomaterials, SEM, TEM, and AFM. Provides practical knowledge and experience via building, observing and manipulating micro- and nanoscale structures. Teaches students how to apply engineering knowledge to practical fluid, thermal, and dynamic systems at small scales.  Meets with 2.675 in the fall term. Enrollment limited; preference to Course 2 majors and minors.",
    "instructors" : "S. G. Kim, G. Chen, E. Wang, R. Karnik"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.60",
    "academicYear" : "2016",
    "title" : "Fundamentals of Advanced Energy Conversion",
    "cluster" : "(Same subject as 10.390J)\n(Subject meets with 2.62J, 10.392J, 22.40J)",
    "prerequisites" : "2.006, or 2.051 and 2.06, or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Fundamentals of thermodynamics, chemistry, and transport applied to energy systems. Analysis of energy conversion and storage in thermal, mechanical, chemical, and electrochemical processes in power and transportation systems, with emphasis on efficiency, performance, and environmental impact. Applications to fuel reforming and alternative fuels, hydrogen, fuel cells and batteries, combustion, catalysis, combined and hybrid power cycles using fossil, nuclear and renewable resources. CO<SUB>2</SUB> separation and capture. Biomass energy. Students taking graduate version complete additional assignments.",
    "instructors" : "A. F. Ghoniem, W. Green"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.684",
    "academicYear" : "2016",
    "title" : "Wave Scattering by Rough Surfaces and Inhomogeneous Media",
    "cluster" : null,
    "prerequisites" : "2.066 or permission of instrctor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "An advanced-level subject designed to give students a working knowledge of current techniques in this area. Material is presented principally in the context of ocean acoustics, but can be used in other acoustic and electromagnetic applications. Includes fundamentals of wave propagation through, and/or scattering by: random media, extended coherent structures, rough surfaces, and discrete scatterers.",
    "instructors" : "T. K. Stanton, A. C. Lavery, Woods Hole Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.688",
    "academicYear" : "2016",
    "title" : "Principles of Oceanographic Instrument Systems -- Sensors and Measurements",
    "cluster" : null,
    "prerequisites" : "18.075, 2.671",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Introduces theoretical and practical principles of design of oceanographic sensor systems. Transducer characteristics for acoustic, current, temperature, pressure, electric, magnetic, gravity, salinity, velocity, heat flow, and optical devices. Limitations on these devices imposed by ocean environment. Signal conditioning and recording; noise, sensitivity, and sampling limitations; standards. Principles of state-of-the-art systems being used in physical oceanography, geophysics, submersibles, acoustics discussed in lectures by experts in these areas. Day cruises in local waters during which the students will prepare, deploy and analyze observations from standard oceanographic instruments constitute the lab work for this subject.",
    "instructors" : "H. Singh, R. Geyer, A. Michel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.707",
    "academicYear" : "2016",
    "title" : "Submarine Structural Acoustics",
    "cluster" : null,
    "prerequisites" : "2.066",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduction to the acoustic interaction of submerged structures with the surrounding fluid. Fluid and elastic wave equations. Elastic waves in plates. Radiation and scattering from planar structures as well as curved structures such as spheres and cylinders. Acoustic imaging of structural vibrations. Students can take 2.085 in the second half of term.",
    "instructors" : "H. Schmidt"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.184",
    "academicYear" : "2016",
    "title" : "Biomechanics and Neural Control of Movement",
    "cluster" : "(Subject meets with 2.183J, 9.34J)",
    "prerequisites" : "2.004, 2.04A, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Quantitative knowledge of human movement behavior is important in a growing number of engineering applications (medical and rehabilitation technology, athletic and military equipment, human-computer interaction, vehicle performance, etc.). Presents a quantitative, model-based description of how biomechanical and neural factors interact in human sensory-motor behavior, focusing mainly on the upper limbs. Students survey recent literature on how motor behavior is controlled, comparing biological and robotic approaches to similar tasks. Topics may include a review of relevant neural, muscular and skeletal physiology, neural feedback and \"equilibrium-point\" theories, co-contraction strategies, impedance control, kinematic redundancy, optimization, intermittency, contact tasks and tool use. Students taking the graduate version will complete additional assignments.",
    "instructors" : "N. Hogan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.570",
    "academicYear" : "2016",
    "title" : "Nano-to-Macro Transport Processes",
    "cluster" : "(Subject meets with 2.57)",
    "prerequisites" : "2.005, 2.051, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Parallel treatments of photons, electrons, phonons, and molecules as energy carriers; aiming at a fundamental understanding of descriptive tools for energy and heat transport processes, from nanoscale to macroscale. Topics include energy levels; statistical behavior and internal energy; energy transport in the forms of waves and particles; scattering and heat generation processes; Boltzmann equation and derivation of classical laws; and deviation from classical laws at nanoscale and their appropriate descriptions. Applications in nanotechnology and microtechnology. Students taking the graduate version complete additional assignments.",
    "instructors" : "G. Chen"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.23",
    "academicYear" : "2016",
    "title" : "Hydrofoils and Propellers",
    "cluster" : null,
    "prerequisites" : "2.20, 18.085",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Reviews the theory and design of hydrofoil sections; lifting and thickness problems for sub-cavitating sections and unsteady flow problems. Covers lifting line and lifting surface theory with applications to hydrofoil craft, rudder, control surface, propeller and wind turbine rotor design. Topics include propeller lifting line and lifting surface theory; wake adapted propellers, steady and unsteady propeller thrust and torque; waterjets; performance analysis and design of wind turbine rotors. Presents numerical principles of vortex lattice and lifting surface panel methods. Projects illustrate the development of theoretical and computational methods for lifting, propulsion and wind turbine applications.",
    "instructors" : "P. D. Sclavounos"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.611",
    "academicYear" : "2016",
    "title" : "Marine Power and Propulsion",
    "cluster" : "(Subject meets with 2.612)",
    "prerequisites" : "2.005",
    "units" : "4-0-8",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.031",
    "academicYear" : "2016",
    "title" : "Dynamics II",
    "cluster" : null,
    "prerequisites" : "2.03",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Continuation of topics introduced in 2.03, including work-energy concepts, Lagrange's equations for systems of particles and rigid bodies in planar motion, and matrix eigenvalue problems.  Meets with 2.003 second half of term.",
    "instructors" : "D. Gossard, K. Turitsyn, T. Peacock"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.701",
    "academicYear" : "2016",
    "title" : "Principles of Naval Architecture",
    "cluster" : "(Subject meets with 2.700)",
    "prerequisites" : "2.002 or 2.02B",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Presents principles of naval architecture, ship geometry, hydrostatics, calculation and drawing of curves of form, intact and damage stability, hull structure strength calculations and ship resistance. Introduces computer-aided naval ship design and analysis tools. Projects include analysis of ship lines drawings, calculation of ship hydrostatic characteristics, analysis of intact and damaged stability, ship model testing, and hull structure strength calculations.  Students taking graduate version complete additional assignments.",
    "instructors" : "F. S. Hover, A. H. Techet, J. Ketcham, P. D. Sclavounos, M. Thomas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.703",
    "academicYear" : "2016",
    "title" : "Principles of Naval Ship Design",
    "cluster" : null,
    "prerequisites" : "2.082, 2.20, 2.611, 2.702",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Covers the design of surface ship platforms for naval applications. Includes topics such as hull form selection and concept design synthesis, topside and general arrangements, weight estimation, and technical feasibility analyses (including strength, stability, seakeeping, and survivability.). Practical exercises involve application of design principles and utilization of advanced computer-aided ship design tools.",
    "instructors" : "J. Ketcham, M. Thomas, F. Hover"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.704",
    "academicYear" : "2016",
    "title" : "Projects in Naval Ship Conversion Design",
    "cluster" : null,
    "prerequisites" : "2.703",
    "units" : "1-6-5",
    "optional" : null,
    "description" : "Focuses on conversion design of a naval ship. A new mission requirement is defined, requiring significant modification to an existing ship. Involves requirements setting, design plan formulation and design philosophy, and employs formal decision-making methods. Technical aspects demonstrate feasibility and desirability. Includes formal written and verbal reports and team projects.",
    "instructors" : "M. Thomas, J. Ketcham"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.24",
    "academicYear" : "2016",
    "title" : "Ocean Wave Interaction with Ships and Offshore Energy Systems",
    "cluster" : "(Same subject as 1.692J)",
    "prerequisites" : "2.20, 18.085",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Surface wave theory, conservation laws and boundary conditions, properties of regular surface waves and random ocean waves. Linearized theory of floating body dynamics, kinematic and dynamic free surface conditions, body boundary conditions. Simple harmonic motions. Diffraction and radiation problems, added mass and damping matrices. General reciprocity identities on diffraction and radiation. Ship wave resistance theory, Kelvin wake physics, ship seakeeping in regular and random waves. Discusses point wave energy absorbers, beam sea and head-sea devises, oscillating water column device and Well's turbine. Discusses offshore floating energy systems and their interaction with ambient waves, current and wind, including oil and gas platforms, liquefied natural gas (LNG) vessels and floating wind turbines. Homework drawn from real-world applications.",
    "instructors" : "P. D. Sclavounos"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.089",
    "academicYear" : "2016",
    "title" : "Computational Geometry",
    "cluster" : "(Same subject as 1.128J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Topics in surface modeling: b-splines, non-uniform rational b-splines, physically based deformable surfaces, sweeps and generalized cylinders, offsets, blending and filleting surfaces. Non-linear solvers and intersection problems. Solid modeling: constructive solid geometry, boundary representation, non-manifold and mixed-dimension boundary representation models, octrees. Robustness of geometric computations. Interval methods. Finite and boundary element discretization methods for continuum mechanics problems. Scientific visualization. Variational geometry. Tolerances. Inspection methods. Feature representation and recognition. Shape interrogation for design, analysis, and manufacturing. Involves analytical and programming assignments.",
    "instructors" : "N. M. Patrikalakis, D. C. Gossard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.092",
    "academicYear" : "2016",
    "title" : "Finite Element Analysis of Solids and Fluids I",
    "cluster" : "(Subject meets with 2.093)",
    "prerequisites" : "2.001 or 2.01; 2.003 or 2.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.154",
    "academicYear" : "2016",
    "title" : "Maneuvering and Control of Surface  and Underwater Vehicles",
    "cluster" : null,
    "prerequisites" : "2.22",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Maneuvering motions of surface and underwater vehicles. Derivation of equations of motion, hydrodynamic coefficients. Memory effects. Linear and nonlinear forms of the equations of motion. Control surfaces modeling and design. Engine, propulsor, and transmission systems modeling and simulation during maneuvering. Stability of motion. Principles of multivariable automatic control. Optimal control, Kalman filtering, loop transfer recovery. Term project: applications chosen from autopilots for surface vehicles; towing in open seas; remotely operated vehicles.",
    "instructors" : "M. S. Triantafyllou"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.20",
    "academicYear" : "2016",
    "title" : "Marine Hydrodynamics",
    "cluster" : null,
    "prerequisites" : "1.060B, 2.006, 2.06, or 2.016",
    "units" : "4-1-7",
    "optional" : null,
    "description" : "The fundamentals of fluid mechanics are developed in the context of naval architecture and ocean science and engineering. Transport theorem and conservation principles. Navier-Stokes' equation. Dimensional analysis. Ideal and potential flows. Vorticity and Kelvin's theorem. Hydrodynamic forces in potential flow, D'Alembert's paradox, added-mass, slender-body theory. Viscous-fluid flow, laminar and turbulent boundary layers. Model testing, scaling laws. Application of potential theory to surface waves, energy transport, wave/body forces. Linearized theory of lifting surfaces. Experimental project in the towing tank or propeller tunnel.",
    "instructors" : "D. K. P. Yue"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.22",
    "academicYear" : "2016",
    "title" : "Design Principles for Ocean Vehicles",
    "cluster" : null,
    "prerequisites" : "2.20",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Design tools for analysis of linear systems and random processes related to ocean vehicles; description of ocean environment including random waves, ocean wave spectra and their selection; short and long term wave statistics; and ocean currents.  Advanced hydrodynamics for design of ocean vehicles and offshore structures including wave forces on towed and moored structures; inertia vs. drag dominated flows; vortex induced vibrations of offshore structures; ship seakeeping and sensitivity of seakeeping performance.   Design exercises in application of principles. Several laboratory exercises emphasizing modern measurement techniques, model testing, and flow diagnostic tools.",
    "instructors" : "M. S. Triantafyllou"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.370",
    "academicYear" : "2016",
    "title" : "Fundamentals of Nanoengineering",
    "cluster" : "(Subject meets with 2.37)",
    "prerequisites" : "2.001 or 2.01; Chemistry (GIR)",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Presents the fundamentals of molecular modeling in engineering in the context of nanoscale mechanical engineering applications. Statistical mechanics and its connection to engineering thermodynamics. Molecular origin and limitations of macroscopic descriptions and constitutive relations for equilibrium and non-equilibrium behavior. Introduction to molecular simulation, solid-state physics and electrokinetic phenomena. Discusses molecular approaches to modern nanoscale engineering problems. Graduate students are required to complete additional assignments with stronger analytical content.",
    "instructors" : "N. G. Hadjiconstantinou"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.612",
    "academicYear" : "2016",
    "title" : "Marine Power and Propulsion",
    "cluster" : "(Subject meets with 2.611)",
    "prerequisites" : "2.005",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Selection and evaluation of commercial and naval ship power and propulsion systems. Analysis of propulsors, prime mover thermodynamic cycles, propeller-engine matching. Propeller selection, waterjet analysis, review of alternative propulsors; thermodynamic analyses of Rankine, Brayton, Diesel, and Combined cycles, reduction gears and integrated  electric drive. Battery operated vehicles, fuel cells. Term project requires analysis of alternatives in propulsion plant design for given physical, performance, and economic constraints. Graduate students complete different assignments  and exams.",
    "instructors" : "M. Thomas, M. S. Triantafyllou, R. S. McCord"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.074",
    "academicYear" : "2016",
    "title" : "Solid Mechanics: Elasticity",
    "cluster" : null,
    "prerequisites" : "2.002, <I>Coreq: 18.03</I>",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to the theory and applications of elastic solids. Review strain, stress, and stress-strain law. Several of the following topics: Anisotropic material behavior. Piezoelectric materials. Effective properties of composites. Structural mechanics of beams and plates. Energy methods for structures. Two-dimensional problems. Stress concentration at cavities, concentrated loads, cracks, and dislocations. Variational methods and their applications; introduction to the finite element method. Introduction to wave propagation.",
    "instructors" : "D. M. Parks"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.02B",
    "academicYear" : "2016",
    "title" : "Mechanics of Structures",
    "cluster" : null,
    "prerequisites" : "2.01",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduction to continuum mechanics of deformable solids, emphasizing strain-displacement and stress-equilibrium relations while specializing material constitutive response to linear elasticity and its limits. Teaches students to solve example boundary value problems and consider the engineering implications of the solutions. Corresponding numerical solutions based on finite element methods are introduced and explored.",
    "instructors" : "D. M. Parks"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.080",
    "academicYear" : "2016",
    "title" : "Structural Mechanics",
    "cluster" : "(Same subject as 1.573J)",
    "prerequisites" : "2.002",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Presents fundamental concepts of structural mechanics with applications to marine, civil, and mechanical structures. Covers residual stresses; thermal effects; analysis of beams, columns, tensioned beams, trusses, frames, arches, cables, and shafts of general shape and material, including composites; elastic buckling of columns; exact and approximate methods, energy methods, principle of virtual work, and introduction to computational structural mechanics.",
    "instructors" : "T. Wierzbicki, H. Schmidt"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.03",
    "academicYear" : "2016",
    "title" : "Dynamics I",
    "cluster" : null,
    "prerequisites" : "None. <I>Coreq: 2.086</I>",
    "units" : "2-0-4",
    "optional" : "Credit cannot also be received for 2.S03",
    "description" : "Introduction to the dynamics of one and two degree-of-freedom mechanical systems. Kinematics. Force-momentum formulation for particles and rigid bodies. Work-energy concepts. Rotation of rigid bodies, angular momentum, torques and moments of inertia. Newton, Euler equations (direct method in dynamics). Conservation laws in dynamics. Basics of equilibrium, linearization and stability analysis. Includes MATLAB modeling of dynamical systems with applications. Meets with 2.003 first half of term.",
    "instructors" : "D. Gossard, K. Turitsyn, T. Peacock"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.04A",
    "academicYear" : "2016",
    "title" : "Systems and Controls",
    "cluster" : null,
    "prerequisites" : "None. <I>Coreq: 2.03</I>",
    "units" : "2-1-3",
    "optional" : null,
    "description" : "Introduction to linear systems, transfer functions, and Laplace transforms. Covers stability and feedback, and provides basic design tools for specifications of transient response. Briefly covers frequency-domain techniques. Enrollment may be limited due to laboratory capacity.",
    "instructors" : "G. Barbastathis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.04B",
    "academicYear" : "2016",
    "title" : "Introduction to Mechanical Vibration",
    "cluster" : null,
    "prerequisites" : "2.03, 2.086",
    "units" : "2-1-3",
    "optional" : null,
    "description" : "Analyzes the time domain response of single- and multiple-degree-of-freedom (DOF) systems to initial conditions and force inputs. Uses matrix formulation of multiple-DOF problems, including finding natural frequencies and mode shapes. Provides an introduction to the method of normal mode superposition. Includes transfer function analysis of the response of linear systems to steady state harmonic inputs, with application to vibration isolation and dynamic absorbers. Also includes application to the analysis of machines with rotating imbalances. Enrollment may be limited due to lab capacity; preference to Course 2 majors and minors.",
    "instructors" : "J. K. Vandiver"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.626",
    "academicYear" : "2016",
    "title" : "Fundamentals of Photovoltaics",
    "cluster" : "(Subject meets with 2.627)",
    "prerequisites" : "Permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.131",
    "academicYear" : "2016",
    "title" : "Advanced Instrumentation and Measurement",
    "cluster" : null,
    "prerequisites" : "Permission of Instructor",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "Provides training in advanced instrumentation and measurement techniques. Topics include system level design, fabrication and evaluation with emphasis on systems involving concepts and technology from mechanics, optics, electronics, chemistry and biology. Simulation, modeling and design software. Use of a wide range of instruments/techniques (e.g., scanning electron microscope, dynamic signal/system analyzer, impedance analyzer, laser interferometer) and fabrication/machining methods (e.g., laser micro-machining, stereo lithography, computer controlled turning and machining centers). Theory and practice of both linear and nonlinear system identification techniques. No final exam.",
    "instructors" : "I. W. Hunter"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.167",
    "academicYear" : "2016",
    "title" : "Hands-On Marine Robotics",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Direct experience in developing marine robotic systems, from conceptualization and design through manufacture and testing.  The class consists of a weekly seminar with readings and discussions, and significant outside work on student projects, culminating in a written report each term.  Seminar topics include tools for unmanned marine work and their history, analysis of mission requirements, conceptual design and modeling of systems, experiments and proofs of concept, and project pacing and time management.  A total of up to 12 hours credit may be taken over one or two terms; seminar topics repeat yearly.",
    "instructors" : "F. S. Hover"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.050",
    "academicYear" : "2016",
    "title" : "Nonlinear Dynamics: Chaos",
    "cluster" : "(Same subject as 12.006J, 18.353J)",
    "prerequisites" : "18.03 or 18.034; Physics II (GIR)",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 12.006J.",
    "instructors" : "P-T. Brun"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.687",
    "academicYear" : "2016",
    "title" : "Time Series Analysis and System Identification",
    "cluster" : null,
    "prerequisites" : "6.011, 18.06",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Covers matched filtering, power spectral (PSD) estimation, and adaptive signal processing / system identification algorithms. Algorithm development is framed as an optimization problem, and optimal and approximate solutions are described. Reviews time-varying systems, first and second moment representations of stochastic processes, and state-space models. Also covers algorithm derivation, performance analysis, and robustness to modeling errors. Algorithms for PSD estimation, the LMS and RLS algorithms, and the Kalman Filter are treated in detail.",
    "instructors" : "J. C. Preisig, Woods Hole Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.625",
    "academicYear" : "2016",
    "title" : "Electrochemical Energy Conversion and Storage: Fundamentals, Materials and Applications",
    "cluster" : "(Same subject as 10.625J)",
    "prerequisites" : "2.005, 3.046, 3.53, 10.40, or 2.051 and 2.06, or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Fundamental concepts, tools, and applications in electrochemical science and engineering. Introduces thermodynamics, kinetics and transport of electrochemical reactions. Describes how materials structure and properties affect electrochemical behavior of particular applications, for instance in lithium rechargeable batteries, electrochemical capacitors, fuel cells, photo electrochemical cells, and electrolytic cells. Discusses state-of-the-art electrochemical energy technologies for portable electronic devices, hybrid and plug-in vehicles, electrical vehicles. Theoretical and experimental exploration of electrochemical measurement techniques in cell testing, and in bulk and interfacial transport measurements (electronic and ionic resistivity and charge transfer cross the electrode-electrolyte interface).",
    "instructors" : "Y. Shao-Horn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.715",
    "academicYear" : "2016",
    "title" : "Optical Microscopy and Spectroscopy for Biology and Medicine",
    "cluster" : "(Same subject as 20.487J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the theory and the design of optical microscopy and its applications in biology and medicine.  The course starts from an overview of basic optical principles allowing an understanding of microscopic image formation and common contrast modalities such as dark field, phase, and DIC.  Advanced microscopy imaging techniques such as total internal reflection, confocal, and multiphoton will also be discussed.  Quantitative analysis of biochemical microenvironment using spectroscopic techniques based on fluorescence, second harmonic, Raman signals will be covered.  We will also provide an overview of key image processing techniques for microscopic data.",
    "instructors" : "P. T. So, C. Sheppard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.681",
    "academicYear" : "2016",
    "title" : "Environmental Ocean Acoustics",
    "cluster" : null,
    "prerequisites" : "2.066, 18.075 or Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Fundamentals of underwater sound, and its application to mapping and surveillance in an ocean environment. Wave equations for fluid and elastic media. Reflection and transmission of sound at plane interfaces. Wave theory representation of acoustic source radiation and propagation in shallow and deep ocean waveguides. Interaction of underwater sound with elastic waves in the seabed and an Arctic ice cover, including effects of porosity and anisotropy. Numerical modeling of the propagation of underwater sound, including spectral methods, normal mode theory, and the parabolic equation method, for laterally homogeneous and inhomogeneous environments. Doppler effects. Effects of oceanographic variability and fluctuation - spatial and temporal coherence. Generation and propagation of ocean ambient noise. Modeling and simulation of signals and noise in traditional sonar systems, as well as modern, distributed, autonomous acoustic surveillance systems.",
    "instructors" : "H. Schmidt"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.682",
    "academicYear" : "2016",
    "title" : "Acoustical Oceanography",
    "cluster" : null,
    "prerequisites" : "2.681",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Provides brief overview of what important current research topics are in oceanography (physical, geological, and biological) and how acoustics can be used as a tool to address them. Three typical examples are climate, bottom geology, and marine mammal behavior. Addresses the acoustic inverse problem, reviewing inverse methods (linear and nonlinear) and the combination of acoustical methods with other measurements as an integrated system. Concentrates on specific case studies, taken from current research journals.",
    "instructors" : "J. F. Lynch, Woods Hole Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.683",
    "academicYear" : "2016",
    "title" : "Marine Bioacoustics and Geoacoustics",
    "cluster" : null,
    "prerequisites" : "2.681",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Both active and passive acoustic methods of measuring marine organisms, the seafloor, and their interactions are reviewed.  Acoustic methods of detecting, observing, and quantifying marine biological organisms are described, as are acoustic methods of measuring geological properties of the seafloor, including depth, and surficial and volumetric composition.  Interactions are also described, including effects of biological scatterers on geological measurements, and effects of seafloor scattering on measurements of biological scatterers on, in, or immediately above the seafloor.  Methods of determining small-scale material properties of organisms and the seafloor are outlined. Operational methods are emphasized, and corresponding measurement theory is described.  Case studies are used in illustration.  Principles of acoustic-system calibration are elaborated.",
    "instructors" : "K. G. Foote, Woods Hole Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.678",
    "academicYear" : "2016",
    "title" : "Electronics for Mechanical Systems",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR)",
    "units" : "2-2-2",
    "optional" : null,
    "description" : "Practical introduction to the fundamentals of electronics in the context of electro-mechanical systems, with emphasis on experimentation and project work in basic electronics. Laboratory exercises include the design and construction of simple electronic devices, such as power supplies, amplifiers, op-amp circuits, switched mode dc-dc converters, and dc motor drivers. Surveys embedded microcontrollers as system elements. Laboratory sessions stress the understanding of electronic circuits at the component level, but also point out the modern approach of system integration using commercial modules and specialized integrated circuits. Enrollment may be limited due to laboratory capacity; preference to Course 2 majors and minors.",
    "instructors" : "D. Rowell"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.59",
    "academicYear" : "2016",
    "title" : "Thermal Hydraulics in Power Technology",
    "cluster" : "(Same subject as 10.536J, 22.313J)",
    "prerequisites" : "2.006, 10.302, 22.312, or permission of instructor",
    "units" : "3-2-7",
    "optional" : null,
    "description" : "See description under subject 22.313J.",
    "instructors" : "E. Baglietto"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.42",
    "academicYear" : "2016",
    "title" : "General Thermodynamics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "General foundations of thermodynamics from an entropy point of view, entropy generation and transfer in complex systems. Definitions of work, energy, stable equilibrium, available energy, entropy, thermodynamic potential, and interactions other than work (nonwork, heat, mass transfer). Applications to properties of materials, bulk flow, energy conversion, chemical equilibrium, combustion, and industrial manufacturing.",
    "instructors" : "J. Brisson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.744",
    "academicYear" : "2016",
    "title" : "Product Design",
    "cluster" : "(Same subject as ESD.64J)",
    "prerequisites" : "2.009",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Project-centered subject addressing transformation of ideas into successful products which are properly matched to the user and the market. Students are asked to take a more complete view of a new product and to gain experience with designs judged on their aesthetics, ease of use, and sensitivities to the realities of the marketplace. Lectures on modern design process, industrial design, visual communication, form-giving, mass production, marketing, and environmentally conscious design.",
    "instructors" : "D. R. Wallace"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.830",
    "academicYear" : "2016",
    "title" : "Control of Manufacturing Processes",
    "cluster" : "(Same subject as 6.780J, ESD.63J)",
    "prerequisites" : "2.008, 6.041, 6.152, or 15.064",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Statistical modeling and control in manufacturing processes. Use of experimental design and response surface modeling to understand manufacturing process physics. Defect and parametric yield modeling and optimization. Forms of process control, including statistical process control, run by run and adaptive control, and real-time feedback control. Application contexts include semiconductor manufacturing, conventional metal and polymer processing, and emerging micro-nano manufacturing processes.",
    "instructors" : "D. E. Hardt, D. S. Boning"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.62",
    "academicYear" : "2016",
    "title" : "Fundamentals of Advanced Energy Conversion",
    "cluster" : "(Same subject as 10.392J, 22.40J)\n(Subject meets with 2.60J, 10.390J)",
    "prerequisites" : "2.006, or 2.051 and 2.06, or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Fundamentals of thermodynamics, chemistry, and transport applied to energy systems. Analysis of energy conversion and storage in thermal, mechanical, chemical, and electrochemical processes in power and transportation systems, with emphasis on efficiency, performance and environmental impact. Applications to fuel reforming and alternative fuels, hydrogen, fuel cells and batteries, combustion, catalysis, combined and hybrid power cycles using fossil, nuclear and renewable resources. CO<SUB>2</SUB> separation and capture. Biomass energy. Meets with 2.60 when offered concurrently; students taking the graduate version complete additional assignments.",
    "instructors" : "A. F. Ghoniem, W. Green"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.099",
    "academicYear" : "2016",
    "title" : "Computational Mechanics of Materials",
    "cluster" : "(Same subject as 16.225J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 16.225J.",
    "instructors" : "R. Radovitzky"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.12",
    "academicYear" : "2016",
    "title" : "Introduction to Robotics",
    "cluster" : "(Subject meets with 2.120)",
    "prerequisites" : "2.004, or 2.031 and 2.04A",
    "units" : "3-2-7",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.374",
    "academicYear" : "2016",
    "title" : "Design and Fabrication of Microelectromechanical Systems",
    "cluster" : "(Same subject as 6.717J)\n(Subject meets with 2.372J, 6.777J)",
    "prerequisites" : "6.003 or 2.003, Physics II (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 6.717J.",
    "instructors" : "D. Weinstein"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.06",
    "academicYear" : "2016",
    "title" : "Fluid Dynamics",
    "cluster" : null,
    "prerequisites" : "2.01 or 2.001",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduction to principal concepts and methods of fluid mechanics. Pressure, hydrostatics, and buoyancy. Control volume analysis. Mass conservation and momentum conservation for moving fluids. Viscous fluid flows, flow through pipes. Dimensional analysis. Boundary layers, and lift and drag on objects. Meets with 2.016 first half of fall term.  Also offered second half of spring term.",
    "instructors" : "G. H. McKinley, A. Hosoi, K. Varanasi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.171",
    "academicYear" : "2016",
    "title" : "Analysis and Design of Digital Control Systems",
    "cluster" : null,
    "prerequisites" : "2.14, 2.151, or permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "A comprehensive introduction to digital control system design, reinforced with hands-on laboratory experiences. Major topics include discrete-time system theory and analytical tools; design of digital control systems via approximation from continuous time; direct discrete-time design; loop-shaping design for performance and robustness; state-space design; observers and state-feedback; quantization and other nonlinear effects; implementation issues. Laboratory experiences and design projects connect theory with practice.",
    "instructors" : "D. L. Trumper"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.37",
    "academicYear" : "2016",
    "title" : "Fundamentals of Nanoengineering",
    "cluster" : "(Subject meets with 2.370)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.888",
    "academicYear" : "2016",
    "title" : "Professional Seminar in Global Manufacturing Innovation and Entrepreneurship",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-1",
    "optional" : null,
    "description" : "Covers a broad range of topics in modern manufacturing, from models and structures for 21st-century operations, to case studies in leadership from the shop floor to the executive office. Also includes global perspectives from Asia, Europe and North America, with guest speakers from all three regions. Explores opportunities for new ventures in manufacturing. Intended primarily for Master of Engineering in Manufacturing students.",
    "instructors" : "D. E. Hardt, S. B. Gershwin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.00B",
    "academicYear" : "2016",
    "title" : "Toy Product Design",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-5-1",
    "optional" : null,
    "description" : "Provides students with an overview of design for entertainment and play, as well as opportunities in creative product design and community service. Students develop ideas for new toys that serve clients in the community, and work in teams with local sponsors and with experienced mentors on a themed toy design project. Students enhance creativity and experience fundamental aspects of the product development process, including determining customer needs, brainstorming, estimation, sketching, sketch modeling, concept development, design aesthetics, detailed design, and prototyping. Includes written, visual, and oral communication. Enrollment limited; preference to freshmen.",
    "instructors" : "D. R. Wallace"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.00A",
    "academicYear" : "2016",
    "title" : "Fundamentals of Engineering Design: Explore Space, Sea and Earth",
    "cluster" : "(Same subject as 16.00AJ)",
    "prerequisites" : "Physics I (GIR), Calculus I (GIR)",
    "units" : "3-3-3",
    "optional" : null,
    "description" : "Student teams formulate and complete space/earth/ocean exploration-based design projects with weekly milestones. Introduces core engineering themes, principles, and modes of thinking. Specialized learning modules enable teams to focus on the knowledge required to complete their projects, such as machine elements, electronics, design process, visualization and communication. Includes exercises in written and oral communication and team building. Examples of projects include surveying a lake for millfoil, from a remote controlled aircraft, and then sending out robotic harvesters to clear the invasive growth; and exploration to search for the evidence of life on a moon of Jupiter, with scientists participating through teleoperation and supervisory control of robots. Enrollment limited; preference to freshmen.",
    "instructors" : "A. H. Techet, D. Newman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.64",
    "academicYear" : "2016",
    "title" : "Superconducting Magnets",
    "cluster" : null,
    "prerequisites" : "2.51, permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers design, manufacture, and operation issues of superconducting magnets for major engineering applications in biomedical science (MRI & NMR magnets), high-energy physics (dipole/quadrupole/detector magnets), and electric power (motor/generator/transmission cable) as well as laboratory use. Topics include electromagnetic field analyses, mechanical stress analyses, thermal stability analyses, protection circuit design, cryogenics, and experimental techniques.",
    "instructors" : "Y. Iwasa, S. Hahn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.065",
    "academicYear" : "2016",
    "title" : "Acoustics and Sensing",
    "cluster" : "(Subject meets with 2.066)",
    "prerequisites" : "2.003, 2.04B, 6.003, 8.03, or 16.003",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.066",
    "academicYear" : "2016",
    "title" : "Acoustics and Sensing",
    "cluster" : "(Subject meets with 2.065)",
    "prerequisites" : "2.003, 2.04B, 6.003, 8.03, 16.003, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the fundamental concepts of acoustics and sensing with waves. Provides a unified theoretical approach to the physics of image formation through scattering and wave propagation in sensing. The linear and nonlinear acoustic wave equation, sources of sound, including musical instruments. Reflection, refraction, transmission and absorption. Bearing and range estimation by sensor array processing, beamforming, matched filtering, and focusing. Diffraction, bandwidth, ambient noise and reverberation limitations. Scattering from objects, surfaces and volumes by Green's Theorem. Forward scatter, shadows, Babinet's principle, extinction and attenuation. Ray tracing and waveguides in remote sensing. Applications to acoustic, radar, seismic, thermal and optical sensing and exploration. Students taking the graduate version of the subject complete additional assignments.",
    "instructors" : "N. C. Makris"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.500",
    "academicYear" : "2016",
    "title" : "Desalination and Water Purification",
    "cluster" : null,
    "prerequisites" : "1.020, 2.006, 10.302, or 2.051 and 2.06, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the fundamental science and technology of desalinating water to overcome water scarcity and ensure sustainable water supplies. Covers basic water chemistry, flash evaporation, reverse osmosis and membrane engineering, electrodialysis, nanofiltration, solar desalination, energy efficiency of desalination systems, fouling and scaling, environmental impacts, and economics of desalination systems. Open to upper-class undergraduates.",
    "instructors" : "J. H. Lienhard, M. Balaban"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.086",
    "academicYear" : "2016",
    "title" : "Numerical Computation for Mechanical Engineers",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR), Calculus II (GIR); <I>Coreq: 18.03 or 2.087</I>",
    "units" : "0-3-9 REST",
    "optional" : null,
    "description" : "Covers elementary programming concepts, including variable types, data structures, and flow control. Provides an introduction to linear algebra and probability. Numerical methods relevant to MechE, including approximation (interpolation, least squares, and statistical regression), integration, solution of linear and nonlinear equations, and ordinary differential equations. Presents deterministic and probabilistic approaches. Uses examples from MechE, particularly from robotics, dynamics, and structural analysis. Assignments require MATLAB programming. Enrollment may be limited due to laboratory capacity; preference to Course 2 majors and minors.",
    "instructors" : "N. Hadjiconstantinou, A. Patera, D. Frey, A. Hosoi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.05",
    "academicYear" : "2016",
    "title" : "Thermodynamics",
    "cluster" : null,
    "prerequisites" : "2.01 or 2.001",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "Provides an introduction to thermodynamics, including first law (coupled and uncoupled systems, incompressible liquid, ideal gas) and second law (equilibrium, reversibility and irreversibility). Explores systems in communication with heat reservoirs; quasi-static processes; and heat engines and refrigeration.  Properties of open systems, including mass, energy and entropy transfer.",
    "instructors" : "C. Buie"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.979",
    "academicYear" : "2016",
    "title" : "Undergraduate Teaching",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For students participating in departmentally approved undergraduate teaching programs. Students assist faculty in the design and execution of the curriculum and actively participate in the instruction and monitoring of the class participants. Students prepare subject materials, lead discussion groups, and review progress. Credit is arranged on a subject-by-subject basis and is reviewed by the department.",
    "instructors" : "A. E. Hosoi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.772",
    "academicYear" : "2016",
    "title" : "Thermodynamics of Biomolecular Systems",
    "cluster" : "(Same subject as 20.110J)",
    "prerequisites" : "Calculus II (GIR), Chemistry (GIR)",
    "units" : "5-0-7 REST",
    "optional" : "Credit cannot also be received for 7.10, 20.111",
    "description" : "See description under subject 20.110J.",
    "instructors" : "L. Griffith, C. Voigt"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.673",
    "academicYear" : "2016",
    "title" : "Instrumentation and Measurement for Biological Systems",
    "cluster" : "(Same subject as 20.309J)\n(Subject meets with 20.409)",
    "prerequisites" : "Biology (GIR), Physics II (GIR), 6.0002, 18.03, 20.330; 2.001, 20.310, or 6.02; or permission of instructor",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "See description under subject 20.309J.",
    "instructors" : "Fall: P. Blainey, S. Manalis, S. Nagle, S. Wasserman, J. Bagnall<br>Spring: E. Boyden, P. So, S. Nagle, S. Wasserman, J. Bagnall"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.793",
    "academicYear" : "2016",
    "title" : "Fields, Forces and Flows in Biological Systems",
    "cluster" : "(Same subject as 6.023J, 20.330J)",
    "prerequisites" : "Physics II (GIR); 2.005, 6.021, 20.320, or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 20.330J.",
    "instructors" : "J. Han, S. Manalis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.798",
    "academicYear" : "2016",
    "title" : "Molecular, Cellular, and Tissue Biomechanics",
    "cluster" : "(Same subject as 3.971J, 6.524J, 10.537J, 20.410J)",
    "prerequisites" : "Biology (GIR); 2.002, 2.006, 6.013, 10.301, or 10.302",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Develops and applies scaling laws and the methods of continuum mechanics to biomechanical phenomena over a range of length scales. Topics include structure of tissues and the molecular basis for macroscopic properties; chemical and electrical effects on mechanical behavior; cell mechanics, motility and adhesion; biomembranes; biomolecular mechanics and molecular motors. Experimental methods for probing structures at the tissue, cellular, and molecular levels.",
    "instructors" : "R. D. Kamm, K. Van Vliet"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.795",
    "academicYear" : "2016",
    "title" : "Fields, Forces, and Flows in Biological Systems",
    "cluster" : "(Same subject as 6.561J, 10.539J, 20.430J)",
    "prerequisites" : "6.013, 2.005, 10.302, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 20.430J.",
    "instructors" : "M. Bathe, A. J. Grodzinsky"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.79",
    "academicYear" : "2016",
    "title" : "Biomaterials: Tissue Interactions",
    "cluster" : "(Same subject as 3.96J, 20.441J, HST.522J)",
    "prerequisites" : "Chemistry (GIR), Biology (GIR), Physics I (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Principles of materials science and cell biology underlying the development and implementation of biomaterials for the fabrication of medical devices/implants, including artificial organs and matrices for tissue engineering and regenerative medicine. Employs a conceptual model, the \"unit cell process for analysis of the mechanisms underlying wound healing and tissue remodeling following implantation of biomaterials/devices in various organs, including matrix synthesis, degradation, and contraction. Methodology of tissue and organ regeneration. Discusses methods for biomaterials surface characterization and analysis of protein adsorption on biomaterials. Design of implants and prostheses based on control of biomaterials-tissue interactions. Comparative analysis of intact, biodegradable, and bioreplaceable implants by reference to case studies. Criteria for restoration of physiological function for tissues and organs.",
    "instructors" : "I. V. Yannas, M. Spector"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.821",
    "academicYear" : "2016",
    "title" : "Selection and Processing of Structural Materials",
    "cluster" : "(Same subject as 3.371J)\n(Subject meets with 3.S171)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 3.371J.",
    "instructors" : "T. Eagar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.060",
    "academicYear" : "2016",
    "title" : "Structural Dynamics and Vibrations",
    "cluster" : "(Same subject as 1.581J, 16.221J)\n(Subject meets with 1.058)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "See description under subject 1.581J.",
    "instructors" : "E. Kausel, J. K. Vandiver"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.091",
    "academicYear" : "2016",
    "title" : "Software and Computation for Simulation",
    "cluster" : "(Same subject as 1.124J, ESD.51J)",
    "prerequisites" : "1.00 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.124J.",
    "instructors" : "J. R. Williams"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.372",
    "academicYear" : "2016",
    "title" : "Design and Fabrication of Microelectromechanical Systems",
    "cluster" : "(Same subject as 6.777J)\n(Subject meets with 2.374J, 6.717J)",
    "prerequisites" : "6.003 or 2.003, Physics II (GIR); or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.087",
    "academicYear" : "2016",
    "title" : "Engineering Mathematics: Linear Algebra and ODEs",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR), Physics I (GIR)",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduction to linear algebra and ordinary differential equations (ODEs), including general numerical approaches to solving systems of equations. Linear systems of equations, existence and uniqueness of solutions, Gaussian elimination. Initial value problems, 1st and 2nd order systems, forward and backward Euler, RK4. Eigenproblems, eigenvalues and eigenvectors, including complex numbers, functions, vectors and matrices.",
    "instructors" : "A. Hosoi, T. Peacock"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.081",
    "academicYear" : "2016",
    "title" : "Plates and Shells: Static and Dynamic Analysis",
    "cluster" : "(Same subject as 16.230J)",
    "prerequisites" : "2.071, 2.080J, or Permission of Instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Stress-strain relations for plate and shell elements. Differential equations of equilibrium. Energy methods and approximate solutions. Bending and buckling of rectangular plates. Post-buckling and ultimate strength of cold formed sections and typical stiffened panels used in aerospace, civil, and mechanical engineering; offshore technology; and ship building. Geometry of curved surfaces. General theory of elastic, axisymmetric shells and their equilibrium equations. Buckling, crushing and bending strength of cylindrical shells with applications. Propagation of 1-D elastic waves in rods, geometrical and material dispersion. Plane, Rayleigh surface, and 3-D waves. 1-D plastic waves. Response of plates and shells to high-intensity loads. Dynamic plasticity and fracture. Application to crashworthiness and impact loading of structures.",
    "instructors" : "T. Sapsis"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.29",
    "academicYear" : "2016",
    "title" : "Numerical Fluid Mechanics",
    "cluster" : null,
    "prerequisites" : "2.006, 2.06, 2.016, 2.20, or 2.25; 18.075",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to numerical methods and MATLAB: errors, condition numbers and roots of equations. Navier-Stokes. Direct and iterative methods for linear systems. Finite differences for elliptic, parabolic and hyperbolic equations. Fourier decomposition, error analysis and stability. High-order and compact finite-differences. Finite volume methods. Time marching methods. Navier-Stokes solvers. Grid generation. Finite volumes on complex geometries. Finite element methods. Spectral methods. Boundary element and panel methods. Turbulent flows. Boundary layers. Lagrangian Coherent Structures. Includes a final research project.",
    "instructors" : "P. F. J. Lermusiaux"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.082",
    "academicYear" : "2016",
    "title" : "Ship Structural Analysis and Design",
    "cluster" : null,
    "prerequisites" : "2.081, 2.701",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "Design application of analysis developed in 2.081J. Ship longitudinal strength and hull primary stresses. Ship structural design concepts. Design limit states including plate bending, column and panel buckling, panel ultimate strength, and plastic analysis. Matrix stiffness, and introduction to finite element analysis. Computer projects on the structural design of a midship module.",
    "instructors" : "R. S. McCord, T. Wierzbicki"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.965",
    "academicYear" : "2016",
    "title" : "Global Supply Chain Management",
    "cluster" : "(Same subject as 1.265J, 15.765J, ESD.265J)",
    "prerequisites" : "1.260, 1.261, 15.761, 15.778, or permission of instructor",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject ESD.265J.",
    "instructors" : "B. Arntzen"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.702",
    "academicYear" : "2016",
    "title" : "Systems Engineering and Naval Ship Design",
    "cluster" : null,
    "prerequisites" : "2.701",
    "units" : "3-3-3",
    "optional" : null,
    "description" : "Introduces principles of systems engineering and ship design with an overview of naval ship design and acquisition processes, requirements setting, formulation of a systematic plan, design philosophy and constraints, formal decision making methods, selection criteria, optimization, variant analysis, trade-offs, analysis of ship design trends, risk, and cost analysis. Emphasizes the application of principles through completion of a design exercise and project.",
    "instructors" : "J. Ketcham, M. Thomas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.016",
    "academicYear" : "2016",
    "title" : "Hydrodynamics",
    "cluster" : null,
    "prerequisites" : "2.01 or 2.001",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Principles of conservation of mass, momentum and energy in fluid mechanics.  Basic geophysical fluid mechanics, including the effects of salinity, temperature, and density; heat balance in the ocean; large scale flows.  Hydrostatics.  Linear free surface waves, wave forces on floating and submerged structures.  Added mass, lift and drag forces.  Introduction to ocean acoustics; sound propagation and refraction.  Sonar equation. Laboratory sessions in wave propagation, lift and drag forces on submerged bodies, and sound propagation. Meets with 2.06 first half of term.",
    "instructors" : "A. H. Techet, P. D. Sclavounos"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.019",
    "academicYear" : "2016",
    "title" : "Design of Ocean Systems",
    "cluster" : null,
    "prerequisites" : "2.001; 2.003; 2.005 or 2.016",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Complete cycle of designing an ocean system using computational design tools for the conceptual and preliminary design stages. Team projects assigned, with each student responsible for a specific subsystem. Lectures cover hydrodynamics; structures; power and thermal aspects of ocean vehicles, environment, materials, and construction for ocean use; generation and evaluation of design alternatives. Focus on innovative design concepts chosen from high-speed ships, submersibles, autonomous vehicles, and floating and submerged deep-water offshore platforms. Lectures on ethics in engineering practice included. Instruction and practice in oral and written communication provided. Enrollment may be limited due to laboratory capacity; preference to Course 2 seniors.",
    "instructors" : "C. Chryssostomidis, M. S. Triantafyllou"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.003",
    "academicYear" : "2016",
    "title" : "Dynamics and Control I",
    "cluster" : "(Same subject as 1.053J)",
    "prerequisites" : "Physics I (GIR), 18.03, or permission of instructor; <I>Coreq: 2.086 or 1.020</I>",
    "units" : "4-1-7 REST",
    "optional" : null,
    "description" : "Introduction to the dynamics and vibrations of lumped-parameter models of mechanical systems. Kinematics. Force-momentum formulation for systems of particles and rigid bodies in planar motion. Work-energy concepts.  Virtual displacements and virtual work. Lagrange's equations for systems of particles and rigid bodies in planar motion. Linearization of equations of motion. Linear stability analysis of mechanical systems. Free and forced vibration of linear multi-degree of freedom models of mechanical systems; matrix eigenvalue problems.",
    "instructors" : "J. K. Vandiver, N. C. Makris, N. M. Patrikalakis, T. Peacock, D. Gossard, K. Turitsyn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.753",
    "academicYear" : "2016",
    "title" : "Development of Mechanical Products",
    "cluster" : "(Subject meets with 2.752)",
    "prerequisites" : "2.750, 2.009, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on evolving a product from proof-of-concept to beta prototype: Includes team building, project planning, budgeting, resource planning; models for scaling, tolerancing and reliability, patents, business planning. Students/teams start with a proof-of-concept product they bring to class or select from projects provided by instructor. In lieu of taking 12 units of 2.ThU, Course 2 majors taking 2.752 may write a bachelor's thesis that documents their contributions to the product developed in the team project. Students taking the graduate version complete additional assignments. Enrollment limited.",
    "instructors" : "A. Slocum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.722",
    "academicYear" : "2016",
    "title" : "D-Lab: Design",
    "cluster" : "(Same subject as EC.720J)",
    "prerequisites" : "2.670 or permission of the instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject EC.720J.",
    "instructors" : "A. B. Smith, M. McCambridge"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.752",
    "academicYear" : "2016",
    "title" : "Development of Mechanical Products",
    "cluster" : "(Subject meets with 2.753)",
    "prerequisites" : "2.750, 2.009, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.675",
    "academicYear" : "2016",
    "title" : "Micro/Nano Engineering Laboratory",
    "cluster" : null,
    "prerequisites" : "2.25; 2.372 or permission of instructor",
    "units" : "2-3-7",
    "optional" : null,
    "description" : "Concepts, ideas, and enabling tools of nanoengineering taught through lab modules and imaging tools, which include microfluidics, microthermal systems, MEMS, nanomaterials, SEM, TEM, and AFM. Provides practical knowledge and experience via building, observing and manipulating micro- and nanoscale structures. Teaches students how to apply engineering knowledge to practical fluid, thermal, and dynamic systems at small scales. Meets with 2.674 in the fall term. Enrollment limited.",
    "instructors" : "S. G. Kim, G. Chen, E. Wang, R. Karnik"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S973",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S995",
    "academicYear" : "2016",
    "title" : "Undergraduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.111",
    "academicYear" : "2016",
    "title" : "Quantum Computation",
    "cluster" : "(Same subject as 8.370J, 18.435J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 18.435J.",
    "instructors" : "I. Chuang, E. Farhi, S. Lloyd, P. Shor"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.014",
    "academicYear" : "2016",
    "title" : "Engineering Systems Development",
    "cluster" : null,
    "prerequisites" : "2.001 or 2.01; 2.003 or 2.03; 2.005 or 2.051; 2.670, 2.678 or 2.00B",
    "units" : "0-6-6",
    "optional" : "Can be repeated for credit",
    "description" : "Focuses on implementation and operation of engineering systems. Emphasizes system integration and performance verification using methods of experimental inquiry. Students refine their subsystem designs and the fabrication of working prototypes. Includes experimental analysis of subsystem performance and comparison with physical models of performance and with design goals. Component integration into the full system, with detailed analysis and operation of the complete vehicle in the laboratory and in-the-field. Includes written and oral reports. Students carry out formal reviews of the overall system design. Enrollment may be limited due to laboratory capacity; preference to Course 2 majors and minors.",
    "instructors" : "D. Hart"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.013",
    "academicYear" : "2016",
    "title" : "Engineering Systems Design",
    "cluster" : null,
    "prerequisites" : "2.001 or 2.01; 2.003 or 2.03; 2.005 or 2.051; 2.670, 2.678 or 2.00B",
    "units" : "0-6-6",
    "optional" : null,
    "description" : "Focuses on the design of engineering systems to satisfy stated performance, stability, and/or control requirements. Emphasizes individual initiative, application of fundamental principles, and the compromises inherent in the engineering design process. Culminates in the design of an engineering system, typically a vehicle or other complex system. Includes instruction and practice in written and oral communication through team presentations, design reviews, and written reports. Enrollment may be limited due to laboratory capacity; preference to Course 2 majors and minors.",
    "instructors" : "D. Hart"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.26",
    "academicYear" : "2016",
    "title" : "Advanced Fluid Dynamics",
    "cluster" : "(Same subject as 1.63J)",
    "prerequisites" : "18.085; 2.25 or permission of instructor.",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Fundamentals of fluid dynamics intrinsic to natural physical phenomena and/or engineering processes. Discusses a range of topics and advanced problem-solving techniques. Sample topics include brief review of basic laws of fluid motion, scaling and approximations, creeping flows, boundary layers in high-speed flows, steady and transient, similarity method of solution, buoyancy-driven convection in porous media, dispersion in steady or oscillatory flows, physics and mathematics of linearized instability, effects of shear and stratification. In alternate years, two of the following modules will be offered: I: Geophysical Fluid Dynamics of Coastal Waters, II: Capillary Phenomena, III: Non-Newtonian Fluids, IV: Flagellar Swimming.",
    "instructors" : "T. R. Akylas, G. H. McKinley"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.120",
    "academicYear" : "2016",
    "title" : "Introduction to Robotics",
    "cluster" : "(Subject meets with 2.12)",
    "prerequisites" : "2.004, or 2.031 and 2.04A, or permission of instructor",
    "units" : "3-2-7",
    "optional" : null,
    "description" : "Presents the fundamentals of robot mechanisms, dynamics, and controls. Planar and spatial kinematics, differential motion, energy method for robot mechanics; mechanism design for manipulation and locomotion; multi-rigid-body dynamics; force and compliance control, balancing control, visual feedback, human-machine interface; actuators, sensors, wireless networking, and embedded software. Weekly laboratories include real-time control, vehicle navigation, arm and end-effector design, and balancing robot control. Group term project requires design and fabrication of robotic systems. Students taking graduate version complete additional assignments. Enrollment may be limited due to laboratory capacity.",
    "instructors" : "H. Asada, J. J. Leonard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.00",
    "academicYear" : "2016",
    "title" : "Introduction to Design",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-2-2",
    "optional" : null,
    "description" : "Project-based introduction to product development and engineering design. Emphasizes key elements of the design process, including defining design problems, generating ideas, and building solutions. Presents a range of design techniques to help students think about, evaluate, and communicate designs, from sketching to physical prototyping, as well as other types of modeling. Students work both individually and in teams. Enrollment limited; preference to Course 2-A sophomores.",
    "instructors" : "M. Yang"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.01",
    "academicYear" : "2016",
    "title" : "Elements of Structures",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR), <I>Coreq: 2.087 or 18.03</I>",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduction to statics and mechanics of deformable structural elements. Emphasizes simple engineering structures, such as rods (axial loading), shafts (torsion), beams (bending), and columns (buckling). Presents basic principles of equilibrium, geometric compatibility, and linear material response. Covers fundamental concepts of continuum mechanics including internal forces, stress, strain, and displacement.",
    "instructors" : "A. Hosoi, S. Socrate, A. Kolpak"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.051",
    "academicYear" : "2016",
    "title" : "Introduction to Heat Transfer",
    "cluster" : null,
    "prerequisites" : "2.05",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduces fundamental processes of heat transfer. Fourier's law. Heat conduction processes including thermal resistance, lumped capacitance, fins, and the heat equation. Elementary convection, including laminar and turbulent boundary layers, internal flow, and natural convection. Thermal radiation, including Stefan-Boltzmann law, small object in large enclosure, and parallel plates. Basic concepts of heat exchangers.",
    "instructors" : "J. H. Lienhard, E. N. Wang, A. Hosoi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.02A",
    "academicYear" : "2016",
    "title" : "Engineering Materials: Properties and Applications",
    "cluster" : null,
    "prerequisites" : "2.01",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduction to the physical mechanisms that give rise to mechanical properties of engineering materials: stiffness, creep, stress-relaxation, strength, fracture-toughness, and fatigue. Also covers materials selection for mechanical design. Includes case studies on materials-limited problems in engineering design.",
    "instructors" : "A. Kolpak"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.601",
    "academicYear" : "2016",
    "title" : "Re-Energizing MIT: Innovating Energy Management at the Institute",
    "cluster" : "(Same subject as 11.160J)",
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 11.160J.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.153",
    "academicYear" : "2016",
    "title" : "Adaptive Control",
    "cluster" : null,
    "prerequisites" : "2.151",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the foundation of adaptive control in continuous-time and discrete-time systems. Adaptive control is the ability to self-correct a controller in the presence of parametric uncertainties using online information is its main and most compelling feature. Examples drawn from aerospace, propulsion, automotive, and energy systems will be used to elucidate the underlying concepts.",
    "instructors" : "A. Annaswamy"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.75",
    "academicYear" : "2016",
    "title" : "Medical Device Design",
    "cluster" : "(Same subject as 6.525J)\n(Subject meets with 2.750J, 6.025J)",
    "prerequisites" : "2.72, 6.071, 6.115, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.799",
    "academicYear" : "2016",
    "title" : "The Cell as a Machine",
    "cluster" : null,
    "prerequisites" : "5.07, 18.03, or 7.05",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Examines a variety of essential cellular functions from the perspective of the cell as a machine. Includes phenomena such as nuclear organization, protein synthesis, cell and membrane mechanics, cell migration, cell cycle control, cell transformation. Lectures are provided by video twice per week; live 3-hour recitation one evening per week. Course is taken simultaneously by students at multiple universities; homework and take-home exams common to all students. Preference to students in Courses 2 and 20.",
    "instructors" : "R. Kamm, M. Sheetz, H. Yu"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.750",
    "academicYear" : "2016",
    "title" : "Medical Device Design",
    "cluster" : "(Same subject as 6.025J)\n(Subject meets with 2.75J, 6.525J)",
    "prerequisites" : "2.72, 6.071, 6.115, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Application of mechanical and electrical engineering fundamentals to the design of medical devices that address clinical needs. Throughout the term, students work in small teams on a major project to translate a clinical challenge into a proof-of-concept prototype device. Students conduct user analysis, develop design specifications, and follow a structured process to cultivate creative designs and apply analytical techniques to optimize them. They deepen their understanding of art and intellectual property by researching prior representations. Develops practical skills in prototyping and testing as well as project management. Includes lectures, problem sets and exams that focus on design fundamentals. Instruction and practice in written and oral communication provided. Students taking graduate version complete additional assignments. Enrollment limited.",
    "instructors" : "A. H. Slocum, C. G. Sodini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.723",
    "academicYear" : "2016",
    "title" : "Engineering Innovation and Design",
    "cluster" : "(Same subject as 6.902J, ESD.051J)",
    "prerequisites" : "None",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "Project-based seminar in innovative design thinking develops students' ability to conceive, implement, and evaluate successful projects in any engineering discipline. Lectures focus on the iterative design process and techniques to enhance creative analysis. Students use this process to design and implement robust voice recognition applications using a simple web-based system. They also give presentations and receive feedback to sharpen their communication skills for high emotional and intellectual impact. Guest lectures illustrate multidisciplinary approaches to design thinking.",
    "instructors" : "B. Kotelly"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.74",
    "academicYear" : "2016",
    "title" : "Bio-inspired Robotics",
    "cluster" : "(Subject meets with 2.740)",
    "prerequisites" : "2.004 or permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Interdisciplinary approach to bio-inspired design, with emphasis on principle extraction applicable to various robotics research fields, such as robotics, prosthetics, and human assistive technologies. Focuses on three main components: biomechanics, numerical techniques that allow multi-body dynamics simulation with environmental interaction and optimization, and basic robotics techniques and implementation skills.  Students integrate the components into a final robotic system project of their choosing through which they must demonstrate their understanding of dynamics and control and test hypothesized design principles. Students taking graduate version complete additional assignments. Enrollment may be limited due to laboratory capacity.",
    "instructors" : "S. Kim"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.152",
    "academicYear" : "2016",
    "title" : "Nonlinear Control System Design",
    "cluster" : "(Same subject as 9.110J)",
    "prerequisites" : "2.151, 6.241, 16.31, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to applied nonlinear control and estimation. Nonlinear stability theory, Lyapunov analysis, Barbalat's lemma. Feedback linearization, internal dynamics. Sliding surfaces. Adaptive nonlinear control. Contraction analysis, differential stability theory. Nonlinear observers. Stable adaptive control using multiresolution bases. Stability of nonlinear partial differential systems. Asynchronous distributed computation. Concurrent Synchronization. Emphasis on applications to physical systems (robots, aircraft, spacecraft, underwater vehicles, reaction-diffusion processes, machine vision, oscillators, internet). Term projects.",
    "instructors" : "J.-J. E. Slotine"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.076",
    "academicYear" : "2016",
    "title" : "Mechanics of Heterogeneous Materials",
    "cluster" : "(Same subject as 16.223J)",
    "prerequisites" : "2.002, 3.032, 16.20, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 16.223J.",
    "instructors" : "B. L. Wardle, S-G. Kim"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.165",
    "academicYear" : "2016",
    "title" : "Robotics",
    "cluster" : "(Same subject as 9.175J)",
    "prerequisites" : "2.151 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Dynamic analysis, design, and control of robots. Forward and inverse kinematics and dynamics of multi-input, multi-output rigid body systems. Computed torque control. Adaptive control. System identification. Force feedback, adaptive visual servoing. Task planning, teleoperation. Elements of biological planning and control. Motor primitives, entrainment, locomotion, active sensing, binding models. Term projects.",
    "instructors" : "J.-J. E. Slotine, H. Asada"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.720",
    "academicYear" : "2016",
    "title" : "Elements of Mechanical Design",
    "cluster" : "(Subject meets with 2.72)",
    "prerequisites" : "permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Advanced study of modeling, design, integration, and best practices for use of machine elements, such as bearings, bolts, belts, flexures, and gears. Modeling and analysis is based upon rigorous application of physics, mathematics, and core mechanical engineering principles, which are reinforced via laboratory experiences and a design project in which students model, design, fabricate, and characterize a mechanical system that is relevant to a real-world application. Activities and quizzes are directly related to, and coordinated with, the project deliverables. Develops the ability to synthesize, model and fabricate a design subject to engineering constraints (e.g., cost, time, schedule). Students taking graduate version complete additional assignments.",
    "instructors" : "M. L. Culpepper"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.740",
    "academicYear" : "2016",
    "title" : "Bio-inspired Robotics",
    "cluster" : "(Subject meets with 2.74)",
    "prerequisites" : "2.004 or permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Interdisciplinary approach to bio-inspired design, with emphasis on principle extraction applicable to various robotics research fields, such as robotics, prosthetics, and human assistive technologies. Focuses on three main components: biomechanics, numerical techniques that allow multi-body dynamics simulation with environmental interaction and optimization, and basic robotics techniques and implementation skills.  Students integrate the components into a final robotic system project of their choosing through which they must demonstrate their understanding of dynamics and control and test hypothesized design principles. Students taking graduate version complete additional assignments. Enrollment may be limited due to lab capacity.",
    "instructors" : "S. Kim"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.912",
    "academicYear" : "2016",
    "title" : "Venture Engineering",
    "cluster" : "(Same subject as 15.373J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Develops the capability to move from testing ideas to assembling a venture as a system comprised of technological, human, social, regulatory, managerial, and financial processes and flows that affect costs, revenues, and value. Begins with a focus on leadership, addressing key issues involved in recruiting and building a founder team and its early employees. Fosters understanding of financial resource needs for the new enterprise and methods for raising funds. Students engage in a venture planning activity in which they must demonstrate their understanding of the concepts covered in class.",
    "instructors" : "S. Stern, E. Fitzgerald"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.76",
    "academicYear" : "2016",
    "title" : "Global Engineering",
    "cluster" : "(Subject meets with 2.760)",
    "prerequisites" : "2.008 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Combines rigorous engineering theory and user-centered product design to create technologies for developing and emerging markets. Covers machine design theory to parametrically analyze technologies; bottom-up/top-down design processes; engagement of stakeholders in the design process; socioeconomic factors that affect adoption of products; and developing/emerging market dynamics and their effect on business and technology. Includes guest lectures from subject matter experts in relevant fields and case studies on successful and failed technologies. Student teams apply course material to term-long projects to create new technologies, developed in collaboration with industrial partners and other stakeholders in developing/emerging markets. Students taking graduate version complete additional assignments.",
    "instructors" : "A. Winter"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.729",
    "academicYear" : "2016",
    "title" : "D-Lab: Design for Scale",
    "cluster" : "(Same subject as EC.729J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-2-7",
    "optional" : null,
    "description" : "See description under subject EC.729J.",
    "instructors" : "E. Reynolds, M. Yang, H. Quintus-Bosz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.995",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Assigned reading and problems or research in distinct areas, either theoretical or experimental, or design. Arranged on individual basis with instructor in the following areas: mechanics and materials, thermal and fluid sciences, systems and design, biomedical engineering, and ocean engineering. Can be repeated for credit only for completely different subject matter.",
    "instructors" : "Consult R. Abeyaratne"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.690",
    "academicYear" : "2016",
    "title" : "Corrosion in Marine Engineering",
    "cluster" : null,
    "prerequisites" : "3.012, permission of instructor",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "Introduction to forms of corrosion encountered in marine systems material selection, coatings and protection systems. Case studies and causal analysis developed through student presentations.",
    "instructors" : "J. W. Ketcham, T. Eagar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.651",
    "academicYear" : "2016",
    "title" : "D-Lab: Energy",
    "cluster" : "(Same subject as EC.711J)\n(Subject meets with EC.791)",
    "prerequisites" : "None",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "See description under subject EC.711J.",
    "instructors" : "S. L. Hsu"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S03",
    "academicYear" : "2016",
    "title" : "Special Subject: Dynamics I",
    "cluster" : null,
    "prerequisites" : "2.086",
    "units" : "2-0-4",
    "optional" : "Credit cannot also be received for 2.03",
    "description" : "Experimental version of 2.03, which offers a combination of online and in-person lectures. See description of 2.03. Licensed for Summer 2014 by the Committee on Curricula as an acceptable alternative to 2.03.",
    "instructors" : "S. Mahajan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.900",
    "academicYear" : "2016",
    "title" : "Ethics for Engineers",
    "cluster" : "Engineering School-Wide Elective Subject. \n(Offered under: 1.082, 2.900, 6.904, 10.01, 22.014)",
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 10.01.",
    "instructors" : "D. Doneson, B. L. Trout, D. Mess"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.183",
    "academicYear" : "2016",
    "title" : "Biomechanics and Neural Control of Movement",
    "cluster" : "(Same subject as 9.34J)\n(Subject meets with 2.184)",
    "prerequisites" : "2.004, 2.04A, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S982",
    "academicYear" : "2016",
    "title" : "Graduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.S981",
    "academicYear" : "2016",
    "title" : "Graduate Special Subject in Mechanical Engineering",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.77",
    "academicYear" : "2016",
    "title" : "FUNdaMENTALS of Precision Product Design",
    "cluster" : "(Subject meets with 2.70)",
    "prerequisites" : "2.008",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Examines design, selection, and combination of machine elements to produce a robust precision system. Introduces process, philosophy and physics-based principles of design to improve/enable renewable power generation, energy efficiency, and manufacturing productivity. Topics include linkages, power transmission, screws and gears, actuators, structures, joints, bearings, error apportionment, and error budgeting. Considers each topic with respect to its physics of operation, mechanics (strength, deformation, thermal effects) and accuracy, repeatability, and resolution. Includes guest lectures from practicing industry and academic leaders.  Students design, build, and test a small benchtop precision machine, such as a heliostat for positioning solar PV panels or a two or three axis machine.  Prior to each lecture, students review the pre-recorded detailed topic materials and then converge on what parts of the topic they want covered in extra depth in lecture.  Students are assessed on their preparation for and participation in class sessions. Students taking graduate version complete additional assignments. Enrollment limited.",
    "instructors" : "A. Slocum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.981",
    "academicYear" : "2016",
    "title" : "New England Coastal Ecology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-1 [P/D/F]",
    "optional" : null,
    "description" : "Provides exposure to marine communities found along the coast of New England and how they fit into global patterns. Focuses on the ecology of salt marshes and rocky shores, and the biology of plants and animals that live in these complex habitats. Prepares students to recognize common inhabitants of these two communities and develops understanding of the major environmental factors affecting them, the types of ecological services they provide, and likely impacts of current and future climate change. Includes visits to field and research centers. Limited to 20.",
    "instructors" : "Consult C. Bastidas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.18",
    "academicYear" : "2016",
    "title" : "Biomolecular Feedback Systems",
    "cluster" : "(Same subject as 6.557J)\n(Subject meets with 2.180J, 6.027J)",
    "prerequisites" : "18.03, Biology (GIR), or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.760",
    "academicYear" : "2016",
    "title" : "Global Engineering",
    "cluster" : "(Subject meets with 2.76)",
    "prerequisites" : "2.008 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Combines rigorous engineering theory and user-centered product design to create technologies for developing and emerging markets. Covers machine design theory to parametrically analyze technologies; bottom-up/top-down design processes; engagement of stakeholders in the design process; socioeconomic factors that affect adoption of products; and developing/emerging market dynamics and their effect on business and technology. Includes guest lectures from subject matter experts in relevant fields and case studies on successful and failed technologies. Student teams apply course material to term-long projects to create new technologies, developed in collaboration with industrial partners and other stakeholders in developing/emerging markets. Students taking graduate version complete additional assignments.",
    "instructors" : "A. Winter"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.708",
    "academicYear" : "2016",
    "title" : "Traditional Naval Architecture Design",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-1 [P/D/F]",
    "optional" : null,
    "description" : "Week-long intensive introduction to traditional design methods in which students hand draw a lines plan of a N. G. Herreshoff (MIT Class of 1870) design based on hull shape offsets taken from his original design model. After completing the plan, students then carve a wooden half-hull model of the boat design. Covers methods used to develop hull shape analysis data from lines plans. Provides students with instruction in safe hand tool use and how to transfer their lines to 3D in the form of their model. Limited to 15.",
    "instructors" : "K. Hasselbalch, J. Harbour"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.180",
    "academicYear" : "2016",
    "title" : "Biomolecular Feedback Systems",
    "cluster" : "(Same subject as 6.027J)\n(Subject meets with 2.18J, 6.557J)",
    "prerequisites" : "18.03, Biology (GIR), or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Comprehensive introduction to dynamics and control of biomolecular systems with emphasis on design/analysis techniques from control theory. Provides a review of biology concepts, regulation mechanisms, and models. Covers basic enabling technologies, engineering principles for designing biological functions, modular design techniques, and design limitations. Students taking graduate version complete additional assignments.",
    "instructors" : "D. Del Vecchio, R. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.916",
    "academicYear" : "2016",
    "title" : "Funding Strategies for Startups",
    "cluster" : "(Same subject as 10.407J)",
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 10.407J.",
    "instructors" : "S. Loessberg, D. P. Hart"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.166",
    "academicYear" : "2016",
    "title" : "Probabilistic Techniques for Mobile Robotics",
    "cluster" : null,
    "prerequisites" : "6.041 or permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Theory and application of probabilistic techniques for autonomous mobile robotics. Topics include probabilistic state estimation and decision making for mobile robots; stochastic representations of the environment; dynamic models and sensor models for mobile robots; algorithms for mapping and localization; planning and control in the presence of uncertainty; cooperative operation of multiple mobile robots; mobile sensor networks; application to autonomous marine (underwater and floating), ground, and air vehicles.",
    "instructors" : "J. J. Leonard"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "2.70",
    "academicYear" : "2016",
    "title" : "FUNdaMENTALS of Precision Product Design",
    "cluster" : "(Subject meets with 2.77)",
    "prerequisites" : "2.008",
    "units" : "3-3-6",
    "optional" : null,
    "description" : null,
    "instructors" : null
  } ]
}