{
  "metadata" : {
    "size" : "207"
  },
  "items" : [ {
    "termCode" : "2016FA",
    "subjectId" : "11.474",
    "academicYear" : "2016",
    "title" : "D-Lab: Disseminating Water,  Sanitation and Hygiene Innovations for the Common Good",
    "cluster" : "(Subject meets with EC.715)",
    "prerequisites" : "None",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Focuses on disseminating water, sanitation and hygiene (WASH) innovations in developing countries, especially among underserved communities. Structured around field-based learning, case studies, lectures and videos. Emphasis on core WASH principles, culture-specific solutions, appropriate and sustainable technologies, behavior change, social marketing and building partnerships. Term project entails implementing the \"next steps\" in a WASH innovation in a specific locale and/or a new proposal/plan/project. Long-term commitment to specific real-world WASH projects which have been disseminated by MIT faculty, students and alumni. Students taking graduate version complete additional assignments. Limited to 30.",
    "instructors" : "S. E. Murcott"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.165",
    "academicYear" : "2016",
    "title" : "Energy and Infrastructure Technologies",
    "cluster" : "(Subject meets with 1.286J, 11.477J)",
    "prerequisites" : "14.01 or permission of instructor",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Examines efforts in developing and advanced nations and regions to create, finance, and regulate infrastructure and energy technologies from a variety of methodological and disciplinary perspectives. Explores how an energy crisis can be an opportunity for making fundamental changes to improve collapsing infrastructure technologies. Introduces the challenges to modern society concerning energy and infrastructure technologies. Reviews the moral hazard aspects of infrastructure and the common arguments for withholding adequate support from new energy and infrastructure technologies. Seminar is conducted with intensive in-class discussions and debates.  Students taking the graduate version complete additional assignments.",
    "instructors" : "D. Hsu"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.001",
    "academicYear" : "2016",
    "title" : "Introduction to Urban Design and Development",
    "cluster" : "(Same subject as 4.250J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-H",
    "optional" : null,
    "description" : "Examines the evolving structure of cities and the way that cities, suburbs, and metropolitan areas can be designed and developed. Surveys the ideas of a wide range of people who have addressed urban problems. Stresses the connection between values and design. Demonstrates how physical, social, political and economic forces interact to shape and reshape cities over time.",
    "instructors" : "L. Vale"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.002",
    "academicYear" : "2016",
    "title" : "Making Public Policy",
    "cluster" : "(Same subject as 17.30J)",
    "prerequisites" : "None",
    "units" : "4-0-8 HASS-S; CI-H",
    "optional" : null,
    "description" : "Examines how the struggle among competing advocates shapes the outputs of government. Considers how conditions become problems for government to solve, why some political arguments are more persuasive than others, why some policy tools are preferred over others, and whether policies achieve their goals. Investigates the interactions among elected officials, think tanks, interest groups, the media, and the public in controversies over global warming, urban sprawl, Social Security, health care, education, and other issues.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.003",
    "academicYear" : "2016",
    "title" : "Methods of Policy Analysis",
    "cluster" : "(Same subject as 17.303J)",
    "prerequisites" : "11.002J; <I>Coreq: 14.01</I>",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Provides students with an introduction to public policy analysis. Examines various approaches to policy analysis by considering the concepts, tools, and methods used in economics, political science, and other disciplines. Students apply and critique these approaches through case studies of current public policy problems.",
    "instructors" : "C. Abbanat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.011",
    "academicYear" : "2016",
    "title" : "The Art and Science of Negotiation",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Introduction to negotiation theory and practice. Applications in government, business, and nonprofit settings are examined. Combines a \"hands-on\" personal skill-building orientation with a look at pertinent theory. Strategy, communications, ethics, and institutional influences are examined as they shape the ability of actors to analyze problems, negotiate agreements, and resolve disputes in social, organizational, and political circumstances characterized by interdependent interests.",
    "instructors" : "B. Verdini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.013",
    "academicYear" : "2016",
    "title" : "American Urban History I",
    "cluster" : "(Same subject as 21H.217J)",
    "prerequisites" : "None",
    "units" : "2-0-7 HASS-H; CI-H",
    "optional" : null,
    "description" : "Seminar on the history of institutions and institutional change in American cities from roughly 1850 to the present.  Among the institutions to be looked at are political machines, police departments, courts, schools, prisons, public authorities, and universities.  Focuses on readings and discussions.",
    "instructors" : "R. M. Fogelson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.014",
    "academicYear" : "2016",
    "title" : "American Urban History II",
    "cluster" : "(Same subject as 21H.218J)",
    "prerequisites" : "None",
    "units" : "2-0-7 HASS-H; CI-H",
    "optional" : null,
    "description" : "Seminar on the history of selected features of the physical environment of urban America. Among the features considered are parks, cemeteries, tenements, suburbs, zoos, skyscrapers, department stores, supermarkets, and amusement parks.",
    "instructors" : "R. M. Fogelson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.016",
    "academicYear" : "2016",
    "title" : "The Once and Future City",
    "cluster" : "(Same subject as 4.211J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-H; CI-H",
    "optional" : null,
    "description" : "Examines the evolving structure of cities, the dynamic processes that shape them, and the significance of a city's history for its future development. Develops the ability to read urban form as an interplay of natural processes and human purposes over time. Field assignments in Boston provide the opportunity to use, develop, and refine these concepts. Enrollment limited.",
    "instructors" : "A. Spirn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.123",
    "academicYear" : "2016",
    "title" : "Big Plans and Mega-Urban Landscapes",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-6 HASS-S",
    "optional" : null,
    "description" : "Explores the physical, ecological, technological, political, economic and cultural implications of big plans and mega-urban landscapes in a global context. Uses local and international case studies to understand the process of making major changes to urban landscape and city fabric, and to regional landscape systems. Includes lectures by leading practitioners. Assignments consider planning and design strategies across multiple scales and time frames.",
    "instructors" : "L. Shi, M. Wilson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.124",
    "academicYear" : "2016",
    "title" : "Introduction to Education:  Looking Forward and Looking Back on Education",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-6-3 HASS-S; CI-H",
    "optional" : null,
    "description" : "One of two introductory subjects on teaching and learning science and mathematics in a variety of K-12 settings. Topics include education and media, education reform, the history of education, simulations, games, and the digital divide.  Students gain practical experience through weekly visits to schools, classroom discussions, selected readings, and activities to develop a critical and broad understanding of past and current forces that shape the goals and processes of education, and explores the challenges and opportunities of teaching.  Students work collaboratively and individually on papers, projects, and in-class presentations.",
    "instructors" : "E. Klopfer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.125",
    "academicYear" : "2016",
    "title" : "Introduction to Education: Understanding and Evaluating Education",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-6-3 HASS-S; CI-H",
    "optional" : null,
    "description" : "One of two introductory subjects on teaching and learning science and mathematics in a variety of K-12 settings.  Topics include student misconceptions, formative assessment, standards and standardized testing, multiple intelligences, and educational technology.   Students gain practical experience through weekly visits to schools, classroom discussions, selected readings, and activities to develop a critical and broad understanding of past and current forces that shape the goals and processes of education, and explores the challenges and opportunities of teaching. Students work collaboratively and individually on papers, projects, and in-class presentations.",
    "instructors" : "S. Tutwiler"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.166",
    "academicYear" : "2016",
    "title" : "Law, Social Movements, and Public Policy: Comparative and International Experience",
    "cluster" : "(Subject meets with 11.496)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Studies the interaction between law, courts, and social movements in shaping domestic and global public policy. Examines how groups mobilize to use law to affect change and why they succeed and fail. Uses case studies to explore the interplay between law, social movements, and public policy in current areas such as gender, race, labor, trade, environment, and human rights. Introduces the theories of public policy, social movements, law and society, and transnational studies. Students taking the graduate version complete additional assignments. Limited to 15.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.188",
    "academicYear" : "2016",
    "title" : "Urban Planning and Social Science Laboratory",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-3-6 Institute LAB",
    "optional" : "Credit cannot also be received for 11.205",
    "description" : "An introduction to the research and empirical analysis of urban planning issues using geographic information systems. Extensive hands-on exercises provide experience with various techniques in spatial analysis and querying databases. Includes a small project on an urban planning problem involving the selection of appropriate methods, the use of primary and secondary data, computer-based modeling, and spatial analysis. Requires some computing experience.",
    "instructors" : "J. Ferreira"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.UR",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.URG",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Undergraduate research opportunities in Urban Studies and Planning. For further information, consult the Departmental Coordinators.",
    "instructors" : "E. Klopfer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.THU",
    "academicYear" : "2016",
    "title" : "Undergraduate Thesis",
    "cluster" : null,
    "prerequisites" : "11.ThT",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of an SB thesis. To be arranged by the student under approved supervision.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.192",
    "academicYear" : "2016",
    "title" : "Independent Study",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For undergraduates wishing to pursue further study in specialized areas of urban studies or city and regional planning not covered in regular subjects.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.201",
    "academicYear" : "2016",
    "title" : "Gateway: Planning Action",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "4-1-7",
    "optional" : null,
    "description" : "Introduces the profession of urban and regional planning.  Emphasizes the key sensibilities necessary for effective planning practice as well as professional writing and oral communication skills.",
    "instructors" : "J. Buckley"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.202",
    "academicYear" : "2016",
    "title" : "Planning Economics",
    "cluster" : null,
    "prerequisites" : "11.203",
    "units" : "2-0-2",
    "optional" : null,
    "description" : "Introduces applications of microeconomic theory to planning problems including urban form and structure, government's role in urban settings and problems of housing finance.",
    "instructors" : "A. Saiz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.203",
    "academicYear" : "2016",
    "title" : "Microeconomics",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-5",
    "optional" : null,
    "description" : "Introduces basic economic analysis for planning students including the functioning of markets, the allocation of scarce resources among competing uses, profit maximizing behavior in different market structures.  Course illustrates theory with contemporary economic issues.",
    "instructors" : "A. Saiz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.220",
    "academicYear" : "2016",
    "title" : "Quantitative Reasoning and Statistical Methods for Planning I",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "4-2-6",
    "optional" : null,
    "description" : "Develops logical, empirically based arguments using statistical techniques and analytic methods. Covers elementary statistics, probability, and other types of quantitative reasoning useful for description, estimation, comparison, and explanation. Emphasizes the use and limitations of analytical techniques in planning practice. Restricted to MCP students.",
    "instructors" : "J. Zhao"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.225",
    "academicYear" : "2016",
    "title" : "Argumentation and Communication",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "A writing practicum associated with 11.201 that focuses on helping students write and present their ideas in cogent, persuasive arguments and other analytical frameworks. Reading and writing assignments and other exercises stress the connections between clear thinking, critical reading, and effective writing.",
    "instructors" : "C. Abbanat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.229",
    "academicYear" : "2016",
    "title" : "Advanced Writing Seminar",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-7",
    "optional" : "Can be repeated for credit",
    "description" : "Focuses on writing and speaking skills. Students bring their writing from other classes to the workshop to practice reviewing and rewriting skills and make several oral presentations. Different types of writing including proposals, memos, thesis, press releases, and writing sound bites for the media.",
    "instructors" : "C. Abbanat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.233",
    "academicYear" : "2016",
    "title" : "Research Design for Policy Analysis and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Develops skills in research design for policy analysis and planning. Emphasizes the logic of the research process and its constituent elements. Topics include philosophy of science, question formulation, hypothesis generation and theory construction, data collection techniques (e.g. experimental, survey, interview), ethical issues in research, and research proposal preparation.",
    "instructors" : "G. Carolini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.234",
    "academicYear" : "2016",
    "title" : "Making Sense: Qualitative Methods for Designers and Planners",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Surveys uses of qualitative methods in urban design and planning research and practice. Topics include observing environments, physical traces, and environmental behavior; asking questions; focused interviews; standardized questionnaires; use of written archival materials; use of visual materials, including photographs, new media, and maps; case studies; and comparative methods. Emphasizes use of each of these skills to collect and make sense of qualitative data in community and institutional settings.",
    "instructors" : "L. Vale"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.255",
    "academicYear" : "2016",
    "title" : "Negotiation and Dispute Resolution in the Public Sector",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Investigates social conflict and distributional disputes in the public sector. While theoretical aspects of conflict and consensus building are considered, focus is on the practice of negotiation and dispute resolution. Comparisons between unassisted and assisted negotiation are reviewed along with the techniques of facilitation and mediation.",
    "instructors" : "L. Susskind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.301",
    "academicYear" : "2016",
    "title" : "Introduction to Urban Design and Development",
    "cluster" : "(Same subject as 4.252J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines both the structure of cities and ways they can be changed. Includes historical forces that have produced cities, models of urban analysis, contemporary theories of urban design, implementation strategies. Core lectures supplemented by discussion sessions focusing on student work and field trips.  Guest speakers present cases involving current projects illustrating the scope and methods of urban design practice.",
    "instructors" : "D. Frenchman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.302",
    "academicYear" : "2016",
    "title" : "Urban Design Politics",
    "cluster" : "(Same subject as 4.253J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines ways urban design contributes to distribution of political power and resources in cities. Investigates the nature of relations between built form and political purposes through close study of a wide variety of situations where public sector design commissions and planning processes have been clearly motivated by political pressures. Lectures and discussions focus on specific case studies of 20th-century government-sponsored designs carried out under diverse regimes in the US, Europe, and elsewhere.",
    "instructors" : "L. Vale"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.303",
    "academicYear" : "2016",
    "title" : "Real Estate Development Studio:  Complex Urban Projects",
    "cluster" : "(Same subject as 4.254J)",
    "prerequisites" : "Permission of instructor",
    "units" : "6-0-12",
    "optional" : null,
    "description" : "Focuses on the synthesis of projects for the real estate development industry, including the integration of physical design and programming with finance and marketing. Interdisciplinary student teams analyze how to maximize value in large-scale, mixed use projects in the process of preparing professional development proposals, involving sites in US cities and internationally. Reviews emerging real estate products and innovative developments to provide a foundation for studio work. Two major projects are interspersed with lectures, field trips, and short sketch exercises. Integrates skills and knowledge in the MSRED program; also open to other students interested in real estate development.",
    "instructors" : "D. Frenchman, P. Roth"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.304",
    "academicYear" : "2016",
    "title" : "Site and Environmental Systems Planning",
    "cluster" : "(Same subject as 4.255J)",
    "prerequisites" : "Permission of instructor",
    "units" : "6-0-9",
    "optional" : null,
    "description" : "Introduces a range of practical approaches involved in evaluating and planning sites within the context of natural and cultural systems. Develops the knowledge and skills to analyze and plan a site for development through exercises and an urban design project. Topics include land inventory, urban form, spatial organization of uses, parcelization, design of roadways, grading, utility systems, off-site impacts, and landscape architecture.",
    "instructors" : "M. A. Ocampo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.308",
    "academicYear" : "2016",
    "title" : "Ecological Urbanism Seminar",
    "cluster" : "(Same subject as 4.213J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the urban environment as a natural phenomenon, human habitat, medium of expression, and forum for action. Subject has two related, major themes: how ideas of nature influence the way cities are perceived, designed, built, and managed; and how natural processes and urban form interact and the consequences of these for human health safety and welfare. Enrollment limited.",
    "instructors" : "A. Spirn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.309",
    "academicYear" : "2016",
    "title" : "Sensing Place: Photography as Inquiry",
    "cluster" : "(Same subject as 4.215J)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores photography as a disciplined way of seeing, of investigating urban landscapes and expressing ideas. Readings, observations, and photographs form the basis of discussions on light, detail, place, poetics, narrative, and how photography can inform design and planning. Enrollment limited.",
    "instructors" : "A. Spirn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.238",
    "academicYear" : "2016",
    "title" : "Ethics of Intervention",
    "cluster" : "(Same subject as 21A.409J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 21A.409J.",
    "instructors" : "E. C. James"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.371",
    "academicYear" : "2016",
    "title" : "Sustainable Energy",
    "cluster" : "(Same subject as 1.818J, 2.65J, 10.391J, 22.811J, ESD.166J)\n(Subject meets with 2.650J, 10.291J, 22.081J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "See description under subject 22.811J.",
    "instructors" : "M. W. Golay"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.205",
    "academicYear" : "2016",
    "title" : "Introduction to Spatial Analysis",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-2-2",
    "optional" : "Credit cannot also be received for 11.188",
    "description" : "Practical introduction to spatial analysis and geographic information systems (GIS).  Examines how geography is represented digitally and how nonrandom distributions of phenomena as diverse as poverty and scenic resources can be better understood by examining their spatial characteristics. Limited enrollment; preference to first-year MCP students.",
    "instructors" : "Fall: S. Williams<br>Spring: J. Ferreira"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.490",
    "academicYear" : "2016",
    "title" : "Law and Development",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-10",
    "optional" : null,
    "description" : "Examines the role of law in development and introduces economic and legal theories. Topics include formality/informality of property, contracts and bargaining in the shadow of the law, institutions for transparency and accountability, legitimation of law, sequencing of legal reform, and international economic law aspects. Studies the roles of property rights in economic development, the judiciary and the bureaucracy in development, and law in aid policy. Includes selected country case studies. Limited to 15.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S199",
    "academicYear" : "2016",
    "title" : "Special Subject: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "For undergraduates wishing to pursue further study or fieldwork in specialized areas of urban studies or city and regional planning not covered in regular subjects of instruction. 11.S198 is graded P/D/F.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S949",
    "academicYear" : "2016",
    "title" : "Special Subject: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction.",
    "instructors" : "P. Zegras, O. Flores"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S958",
    "academicYear" : "2016",
    "title" : "Special Seminar: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S965",
    "academicYear" : "2016",
    "title" : "Special Subject: Real Estate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.328",
    "academicYear" : "2016",
    "title" : "Urban Design Skills: Observing, Interpreting, and Representing the City",
    "cluster" : "(Same subject as 4.240J)",
    "prerequisites" : "None",
    "units" : "4-2-9",
    "optional" : null,
    "description" : "Introduces methods of recording, evaluating, and representing the urban environment. Through visual observation, field analysis, measurements, interviews, and other means, students draw on their senses and develop their ability to deduce, conclude, question, and test conclusions about how the environment is used and valued. Using representational tools such as drawing, photographing, computer modeling and desktop publishing, students communicate what they observe along with their impressions and design ideas. Intended as a foundation for future studio work in urban design. Includes design-based projects.",
    "instructors" : "M. A. Ocampo, E. Ben-Joseph, J. Samper"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.330",
    "academicYear" : "2016",
    "title" : "The Making of Cities",
    "cluster" : "(Same subject as 4.241J)\n(Subject meets with 4.251)",
    "prerequisites" : "4.252 or 11.001",
    "units" : "Units arranged",
    "optional" : null,
    "description" : "See description under subject 4.241J.",
    "instructors" : "L. Jacobi, R. Segal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.332",
    "academicYear" : "2016",
    "title" : "Urban Design Studio",
    "cluster" : "(Same subject as 4.163J)",
    "prerequisites" : "4.162 or permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 4.163J.",
    "instructors" : "A. Berger, F. Masoud, A. Naude Santos"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.333",
    "academicYear" : "2016",
    "title" : "Urban Design Seminar: Perspectives on Contemporary Practice",
    "cluster" : "(Same subject as 4.244J)",
    "prerequisites" : "None",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Examines innovations in urban design practice occurring through the work of leading practitioners in the fields of architecture, landscape architecture, and urban planning. Features lectures by major national and global practitioners in urban design. Projects and topics vary based on term and speakers but may cover architectural urbanism, landscape and ecology, arts and culture, urban design regulation and planning agencies, and citywide and regional design. Focuses on analysis and synthesis of themes discussed in presentations and discussions.",
    "instructors" : "J. Samper"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.337",
    "academicYear" : "2016",
    "title" : "Urban Design Ideals and Action",
    "cluster" : "(Same subject as 4.247J)",
    "prerequisites" : "11.301 or permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Examines the relationship between urban design ideals, urban design action, and the built environment through readings, discussions, presentations, and papers. Analyzes the diverse design ideals that influence cities and settlements, and investigates how urban designers use them to shape urban form. Provides a critical understanding of the diverse formal methods used to intervene creatively in both developed and developing contexts, especially pluralistic and informal built environments.",
    "instructors" : "B. Ryan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.339",
    "academicYear" : "2016",
    "title" : "Downtown",
    "cluster" : "(Subject meets with 11.026J, 21H.321J)",
    "prerequisites" : "None",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Seminar on downtown in US cities from the late 19th century to the late 20th. Emphasis on downtown as an idea, place, and cluster of interests, on the changing character of downtown, and on recent efforts to rebuild it. Topics considered include subways, skyscrapers, highways, urban renewal, and retail centers. Focus on readings, discussions, and individual research projects. Students taking graduate version complete additional assignments.",
    "instructors" : "R. M. Fogelson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.360",
    "academicYear" : "2016",
    "title" : "Community Growth and Land Use Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Practicum workshop  on strategies of planning and control for growth and land use, chiefly at the municipal level. Growth and its local consequences; land use planning approaches; implementation tools including innovative zoning and regulatory techniques, physical design, and natural systems integration. Semester-long projects arranged with student teams serving municipal clients.",
    "instructors" : "T. S. Szold"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.367",
    "academicYear" : "2016",
    "title" : "The Law and Politics of Land Use",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Analysis of local and state power to regulate land use and development. Particular emphasis on the evolution of planning and zoning regulations, and the perceived narrowing of the relationship between public improvements requirements and development impact. The ability of regulatory bodies to impose environmental performance standards and limit development activity is explored in relation to recent Supreme Court and State SJC decisions. Development decisions rendered by public agencies are reviewed, critiqued, and discussed.",
    "instructors" : "T. S. Szold"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.368",
    "academicYear" : "2016",
    "title" : "Environmental Justice",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores the foundations of the environmental justice movement, current and emerging issues, and the application of environmental justice analysis to environmental policy and planning. Examines claims made by diverse groups along with the policy and civil society responses that address perceived inequity and injustice. International issues and perspectives also considered.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.401",
    "academicYear" : "2016",
    "title" : "Introduction to Housing, Community and Economic Development",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides a critical introduction to the shape and determinants of political, social and economic inequality in America. Explores equitable development as a response framework for planners; social capital and community building as planning concepts; and the history, development, and current prospects of the fields of housing (with an emphasis on affordability and inclusion) and local economic development. Considers multiple scales but primarily the neighborhood, city/town, and metro region, centered on the interplay of policies, institutions and markets.",
    "instructors" : "J. P. Thompson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.427",
    "academicYear" : "2016",
    "title" : "Urban Labor Markets and Employment Policy",
    "cluster" : "(Same subject as 15.677J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 15.677J.",
    "instructors" : "P. Osterman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.430",
    "academicYear" : "2016",
    "title" : "Leadership in Real Estate",
    "cluster" : "(Same subject as 15.941J)",
    "prerequisites" : "None",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "See description under subject 15.941J.",
    "instructors" : "G. Schuck"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.431",
    "academicYear" : "2016",
    "title" : "Real Estate Finance and Investment",
    "cluster" : "(Same subject as 15.426J)",
    "prerequisites" : "Permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Concepts and techniques for analyzing financial decisions in commercial property development and investment. Topics include property income streams, urban economics, discounted cash flow, equity valuation, leverage and income tax considerations, development projects, and joint ventures.",
    "instructors" : "D. Geltner"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.432",
    "academicYear" : "2016",
    "title" : "Real Estate Capital Markets",
    "cluster" : "(Same subject as 15.427J)",
    "prerequisites" : "11.431; 15.402 or 15.414",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduces real estate capital markets for institutional investors. Topics include real estate investment trusts (REIT), commercial mortgage-backed securities (CMBS), and private equity.  Concepts and techniques for investment analysis include portfolio theory and equilibrium asset pricing. Additional topics may include price indexing and derivatives.",
    "instructors" : "D. Geltner"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.433",
    "academicYear" : "2016",
    "title" : "Real Estate Economics",
    "cluster" : "(Same subject as 15.021J)",
    "prerequisites" : "14.01, 15.010, or 15.011",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Develops an understanding of the economic factors that shape and influence the markets for real property. Includes an analysis of housing as well as commercial real estate, and covers demographic analysis, regional growth, construction cycles, urban land markets and location theory. Exercises and modeling techniques for measuring and predicting property demand, supply, vacancy and prices.",
    "instructors" : "W. C. Wheaton"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.437",
    "academicYear" : "2016",
    "title" : "Financing Economic Development",
    "cluster" : "(Subject meets with 11.137)",
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Focuses on financing tools and program models to support local economic development. Provides an overview of private capital markets and financing sources to understand capital market imperfections that constrain economic development, business accounting, financial statement analysis, federal economic development programs, and public finance tools. Covers policies and program models, including revolving loan funds, guarantee programs, venture capital funds, bank holding companies, community development loan funds and credit unions, micro enterprise funds, and the Community Reinvestment Act. Students taking graduate version complete additional assignments.",
    "instructors" : "K. Seidman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.438",
    "academicYear" : "2016",
    "title" : "Economic Development Planning",
    "cluster" : null,
    "prerequisites" : "11.203, 11.220",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on the policy tools and planning techniques used to formulate and implement local economic development strategies. Includes an overview of economic development theory, discussion of major policy areas and practices employed to influence local economic development, a review of analytic tools to assess local economies and how to formulate strategy. Coursework includes formulation of a local economic development strategy for a client.",
    "instructors" : "K. Seidman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.439",
    "academicYear" : "2016",
    "title" : "Revitalizing Urban Main Streets",
    "cluster" : null,
    "prerequisites" : "11.401 or 11.301J or 11.328J",
    "units" : "4-0-11",
    "optional" : null,
    "description" : "Workshop explores the integration of economic development and physical planning interventions to revitalize urban commercial districts. Covers: an overview of the causes of urban business district decline, revitalization challenges, and the strategies to address them; the planning tools used to understand and assess urban Main Streets from both physical design and economic development perspectives; and the policies, interventions, and investments used to foster urban commercial revitalization. Students apply the theories, tools and interventions discussed in class to preparing a formal neighborhood commercial revitalization plan for a client business district.",
    "instructors" : "K. Seidman, S. Silberberg"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.463",
    "academicYear" : "2016",
    "title" : "Structuring Low-Income Housing Projects in Developing Countries",
    "cluster" : "(Same subject as 4.236J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 4.236J.",
    "instructors" : "R. Goethert"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.481",
    "academicYear" : "2016",
    "title" : "Analyzing and Accounting for Regional Economic Change",
    "cluster" : "(Same subject as 1.284J, ESD.192J)",
    "prerequisites" : "14.03, 14.04",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Surveys theories of regional growth, factor mobility, clustering, industrial restructuring, learning regions, and global supply chains from a political-economy perspective. Examines/critiques multipliers, linkages, and supply chains used to assess employment and environmental impacts,  energy and infrastructure investments, and accounting issues related to the underground economy, work in the home, and environmental degradation.  Assesses price indices, industrial location and employment measures, and shift-share analyses. Discussions of US and foreign applications.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.482",
    "academicYear" : "2016",
    "title" : "Regional Socioeconomic Impact Analyses and Modeling",
    "cluster" : "(Same subject as 1.285J, ESD.193J)",
    "prerequisites" : "11.481J or permission of instructor",
    "units" : "2-1-9",
    "optional" : null,
    "description" : "Reviews regional economic theories and models and provides students with experience in using alternative economic impact assessment models on microcomputers. Problem sets are oriented around infrastructure, housing, energy, and environmental issues. Students work with a client generally in Boston and make a presentation to the client. Emphasis on written and oral presentation skills.",
    "instructors" : "K. R. Polenske"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.484",
    "academicYear" : "2016",
    "title" : "Project Appraisal in Developing Countries",
    "cluster" : "(Subject meets with 11.144)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers techniques of financial analysis of investment expenditures, as well as the economic and distributive appraisal of development projects. Critical analysis of these tools in the political economy of international development is discussed. Topics include appraisal's role in the project cycle, planning under conditions of uncertainty, constraints in data quality and the limits of rational analysis, and the coordination of an interdisciplinary appraisal team.  Students taking graduate version complete additional assignments. Enrollment limited; preference to majors.",
    "instructors" : "J. Buckley"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.487",
    "academicYear" : "2016",
    "title" : "Innovative Budgeting and Finance for the Public Sector",
    "cluster" : "(Subject meets with 11.147)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines globally relevant challenges of adequately and effectively attending to public sector responsibilities for basic services with limited resources, particularly in the contexts of fiscal crises, rapid population growth, as well as shrinkage, through: an introduction to methods and processes of budgeting, accounting, and financial mobilization in the public sector; use of case studies and practice exercises to explore revenue strategies and to gain fiscal analytical competencies; study of pioneering examples of promising budget and accounting processes as well as innovative funding mobilization via taxation, capital markets, and experimental experiences with mechanisms such as land-value capture. Students taking graduate version are expected to explore the subject in greater depth.",
    "instructors" : "G. Carolini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.491",
    "academicYear" : "2016",
    "title" : "Economic Development and Policy Analysis",
    "cluster" : "(Same subject as 17.176J)",
    "prerequisites" : "11.701",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the process of economic development to understand why some countries or regions within countries have increased their incomes and reduced their poverty faster than others.  Economic development is treated as a process of learning, as countries weigh theories and role models as guides for policy formulation and institution building.  Historical and empirical examination of three role models for development/underdevelopment, as formulated by the Third World's new intelligentsia that emerged after de-colonization: the OPEC development role model, the East Asian role model, and the Brazilian role model.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.493",
    "academicYear" : "2016",
    "title" : "Property and Land Use Law for Planners",
    "cluster" : "(Subject meets with 11.183)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines legal and institutional arrangements for the establishment, transfer, and control over property under American and selected comparative systems including India and South Africa. Focuses on key issues of property and land use law regarding planning and economic development. Emphasizes just and efficient resource use; institutional, entitlement and social relational approaches to property; distributional and other social aspects; and the relationship between property, culture, and democracy. Students taking graduate version complete additional assignments.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.495",
    "academicYear" : "2016",
    "title" : "Governance and Law in Developing Countries",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-10",
    "optional" : null,
    "description" : "Examines the multiple dimensions of governance in international development with a focus on the role of legal norms and institutions in the balance between state and the market. Analyzes changes in the distribution of political and legal authority as a result of economic globalization. Topics include the regulation of firms; forms of state and non-state monitoring; varieties of capitalism, global governance and development; and good governance, including transparency and accountability mechanisms, the role of the judiciary and legal culture, and tools for measuring governance performance.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.520",
    "academicYear" : "2016",
    "title" : "Workshop on Geographic Information Systems",
    "cluster" : null,
    "prerequisites" : "11.205 or permission of instructor",
    "units" : "2-2-2",
    "optional" : null,
    "description" : "An introduction to geographic information systems (GIS) as applied to urban and regional planning, community development, and local government. Emphasis on learning GIS technology and spatial analysis techniques through extensive hands-on exercises using real-world data sets such as the US census of population and housing. Includes a small project on an urban planning problem involving the selection of appropriate methods, the use of primary and secondary data, computer-based modeling, and spatial analysis. Enrollment limited; preference to MCP students.",
    "instructors" : "Fall: S. Williams<br>Spring: J. Ferreira"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.521",
    "academicYear" : "2016",
    "title" : "Spatial Database Management and Advanced Geographic Information Systems",
    "cluster" : null,
    "prerequisites" : "Permission of instructor; or 11.520 and <I>Coreq: 11.220</I>",
    "units" : "3-3-6",
    "optional" : "Credit cannot also be received for 11.523, 11.524",
    "description" : "Extends the computing and geographic information systems (GIS) skills developed in 11.520 to include spatial data management in client/server environments and advanced GIS techniques. First half covers the content of 11.523, introducing database management concepts, SQL (Structured Query Language), and enterprise-class database management software. Second half explores advanced features and the customization features of GIS software that perform analyses for decision support that go beyond basic thematic mapping. Includes the half-term GIS project of 11.524 that studies a real-world planning issue.",
    "instructors" : "J. Ferreira"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.522",
    "academicYear" : "2016",
    "title" : "Research Seminar on Urban Information Systems",
    "cluster" : null,
    "prerequisites" : "11.521 or permission of instructor",
    "units" : "2-4-6",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced research seminar enhances computer and analytic skills developed in other subjects in this sequence. Students present a structured discussion of journal articles representative of their current research interests involving urban information systems and complete a short research project. Suggested research projects include topics related to ongoing UIS Group research.",
    "instructors" : "J. Ferreira"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.523",
    "academicYear" : "2016",
    "title" : "Fundamentals of Spatial Database Management",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-2-2",
    "optional" : "Credit cannot also be received for 11.521, 11.524",
    "description" : "The fundamentals of database management systems as applied to spatial analysis. Includes extensive hands-on exercises using real-world planning data. Introduces database management concepts, SQL (Structured Query Language), and enterprise-class database software. Same content as first half of 11.521.",
    "instructors" : "J. Ferreira"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.524",
    "academicYear" : "2016",
    "title" : "Advanced Geographic Information System Project",
    "cluster" : null,
    "prerequisites" : "11.523 or permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for creditCredit cannot also be received for 11.521, 11.523",
    "description" : "Learning and utilizing advanced geographic information system techniques in studio/lab setting with real-world client problem and complex digital spatial data infrastructure. Projects typically use the client and infrastructure setting for 11.521. Credit cannot also be received for 11.521 in the same term.",
    "instructors" : "J. Ferreira"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.601",
    "academicYear" : "2016",
    "title" : "Introduction to Environmental Policy and Planning",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Required introductory subject for graduate students pursuing environmental policy and planning as their specialization in the MCP Program. Also open to other graduate students interested in environmental policymaking and the practice of environmental planning. Taught comparatively, with numerous references to examples from around the world. Four major areas of focus: National Environmental Policymaking, Environmental Ethics, Environmental Forecasting and Analysis Techniques, and Strategies for Collaborative Decision-making.",
    "instructors" : "L. Susskind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.701",
    "academicYear" : "2016",
    "title" : "Introduction to International Development Planning",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Studies interaction between planners and institutions at different scales, from local to global/transnational. Emphasizes a historical and institutional approaches to development planning. Includes an overview of theories of development, state, organizational arrangements, and implementation mechanisms. Covers current topics in development planning, such as decentralization, participatory planning, urban-rural linkages, corruption, legal institutions and post-conflict development. Analyzes various roles planners play in different institutional contexts. Restricted to first-year MCP and SPURS students.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.800",
    "academicYear" : "2016",
    "title" : "Reading, Writing and Research",
    "cluster" : null,
    "prerequisites" : "Permission of instructor, <I>Coreq: 11.801</I>",
    "units" : "3-0-6 [P/D/F]",
    "optional" : null,
    "description" : "Required subject intended solely for 1st-year DUSP PhD students. Helps students prepare their first-year papers and plan for a dissertation. Focuses on how scholars get original ideas and write about them clearly and engagingly. Assignments ask students to apply generic readings and methods to individual first-year paper topics. Students work simultaneously with advisor on first-year paper, and present papers in the final weeks of the semester.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.901",
    "academicYear" : "2016",
    "title" : "Independent Study:  Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.902",
    "academicYear" : "2016",
    "title" : "Independent Study: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for independent study under regular supervision by a faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.961",
    "academicYear" : "2016",
    "title" : "Independent Study: Real Estate",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for independent study under regular supervision by a faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.962",
    "academicYear" : "2016",
    "title" : "Fieldwork: Real Estate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Practical application of real estate techniques in the field.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.985",
    "academicYear" : "2016",
    "title" : "Summer Field Work",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "Practical application of planning techniques over the summer with prior arrangement.",
    "instructors" : "S. Wellford"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.THG",
    "academicYear" : "2016",
    "title" : "Graduate Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research and writing of thesis; to be arranged by the student with supervising committee.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.435",
    "academicYear" : "2016",
    "title" : "Mixed-Income Housing Development",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides an overview of affordable and mixed-income housing development for students who wish to understand the fundamental issues and requirements of urban scale housing development, and the process of planning, financing and developing such housing.  Students gain practical experience assembling a mixed-income housing development proposal.",
    "instructors" : "P. Roth"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.163",
    "academicYear" : "2016",
    "title" : "Law and Society",
    "cluster" : "(Same subject as 17.249J, 21A.455J)\n(Subject meets with 21A.459)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "See description under subject 21A.455J.",
    "instructors" : "S. Silbey"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.153",
    "academicYear" : "2016",
    "title" : "Shanghai and China's Modernization",
    "cluster" : "(Same subject as 21H.351J)",
    "prerequisites" : "None",
    "units" : "2-0-10 HASS-H",
    "optional" : null,
    "description" : "See description under subject 21H.351J.",
    "instructors" : "C. Leighton"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.906",
    "academicYear" : "2016",
    "title" : "Research Seminar in Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Special research issues in urban planning.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.908",
    "academicYear" : "2016",
    "title" : "Urban Fieldwork",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Practical application of planning techniques to towns, cities, and regions, including problems of replanning, redevelopment, and renewal of existing communities. Includes internships, under staff supervision, in municipal and state agencies and departments.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.314",
    "academicYear" : "2016",
    "title" : "Water, Landscape and Urban Design",
    "cluster" : "(Same subject as 4.214J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-3-6",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 4.214J.",
    "instructors" : "J. Wescoat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.334",
    "academicYear" : "2016",
    "title" : "Advanced Seminar in Landscape and Urbanism",
    "cluster" : "(Same subject as 4.264J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores theories, practices, and emerging trends in the fields of landscape architecture and urbanism, such as systemic design, landscape urbanism, engineered nature, drosscapes, urban biodiversity, urban mobility, megaregions, and urban agriculture. Lectures, readings, and guest speakers present a wide array of multi-disciplinary topics, including current works from P-REX lab. Students conduct independent and group research that is future-oriented.",
    "instructors" : "A. Berger"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.318",
    "academicYear" : "2016",
    "title" : "Senseable Cities",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Studies how ubiquitous and real-time information technology can help us to understand and improve cities and regions. Explores the impact of integrating real-time information technology into the built environment. Introduces theoretical foundations of ubiquitous computing. Provides technical tools for tactile development of small-scale projects. Limited to 24.",
    "instructors" : "C. Ratti"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.477",
    "academicYear" : "2016",
    "title" : "Energy and Infrastructure Technologies",
    "cluster" : "(Same subject as 1.286J)\n(Subject meets with 11.165)",
    "prerequisites" : "14.01 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines efforts in developing and advanced nations and regions to create, finance, and regulate infrastructure from a variety of methodological and disciplinary perspectives. Explores how an energy crisis can be an opportunity for making fundamental changes to improve collapsing infrastructure networks. Introduces the challenges to modern society concerning energy security. Reviews the moral hazard aspects of infrastructure and the common arguments for withholding adequate support to the rebuilding of energy systems. Students taking the graduate version complete additional assignments.",
    "instructors" : "D. Hsu"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.144",
    "academicYear" : "2016",
    "title" : "Project Appraisal in Developing Countries",
    "cluster" : "(Subject meets with 11.484)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers techniques of financial analysis of investment expenditures, as well as the economic and distributive appraisal of development projects. Critical analysis of these tools in the political economy of international development is discussed. Topics include appraisal's role in the project cycle, planning under conditions of uncertainty, constraints in data quality and the limits of rational analysis, and the coordination of an interdisciplinary appraisal team. Students taking graduate version complete additional assignments. Enrollment limited; preference to majors.",
    "instructors" : "J. Buckley"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.909",
    "academicYear" : "2016",
    "title" : "Graduate Tutorial",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Planned programs of instruction for a minimum of three students on a planning topic not covered in regular subjects of instruction. Registration subject to prior arrangement with appropriate faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.910",
    "academicYear" : "2016",
    "title" : "Doctoral Tutorial",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Planned programs of instruction for a minimum of three students on a planning topic not covered in regular subjects of instruction. Registration subject to prior arrangement with appropriate faculty member.",
    "instructors" : "L. Vale, J. Zhao"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.015",
    "academicYear" : "2016",
    "title" : "Riots, Strikes, and Conspiracies in American History",
    "cluster" : "(Same subject as 21H.226J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-H; CI-H",
    "optional" : null,
    "description" : "See description under subject 21H.226J.",
    "instructors" : "R. M. Fogelson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.194",
    "academicYear" : "2016",
    "title" : "Supervised Readings",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Reading and discussion of topics in urban studies and planning.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.960",
    "academicYear" : "2016",
    "title" : "Independent Study: Real Estate",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.963",
    "academicYear" : "2016",
    "title" : "Independent Study: Real Estate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.964",
    "academicYear" : "2016",
    "title" : "Independent Study: Real Estate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Opportunity for independent study under regular supervision by a faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S970",
    "academicYear" : "2016",
    "title" : "Special Seminar: Real Estate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of real estate not covered in regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S938",
    "academicYear" : "2016",
    "title" : "Special Subject: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S939",
    "academicYear" : "2016",
    "title" : "Special Subject: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.316",
    "academicYear" : "2016",
    "title" : "Landscape and Urban Heritage Conservation",
    "cluster" : "(Same subject as 4.216J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-3-6",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 4.216J.",
    "instructors" : "J. Wescoat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.444",
    "academicYear" : "2016",
    "title" : "The New Global Planning Practitioner",
    "cluster" : "(Same subject as 4.232J)\n(Subject meets with 4.233)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 4.232J.",
    "instructors" : "R. Goethert"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.150",
    "academicYear" : "2016",
    "title" : "Metropolis: A Comparative History of New York City",
    "cluster" : "(Same subject as 21H.220J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-H",
    "optional" : null,
    "description" : "See description under subject 21H.220J.",
    "instructors" : "C. Wilder"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.152",
    "academicYear" : "2016",
    "title" : "The Ghetto:  From Venice to Harlem",
    "cluster" : "(Same subject as 21H.385J)",
    "prerequisites" : "None",
    "units" : "2-0-10 HASS-S",
    "optional" : null,
    "description" : "See description under subject 21H.385J.",
    "instructors" : "C. Wilder"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.904",
    "academicYear" : "2016",
    "title" : "Supervised Readings in Urban Studies",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Reading and discussion of topics in urban studies and planning.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S195",
    "academicYear" : "2016",
    "title" : "Special Subject: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S944",
    "academicYear" : "2016",
    "title" : "Special Subject: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S957",
    "academicYear" : "2016",
    "title" : "Special Seminar: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S968",
    "academicYear" : "2016",
    "title" : "Special Seminar: Real Estate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S967",
    "academicYear" : "2016",
    "title" : "Special Subject: Real Estate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S969",
    "academicYear" : "2016",
    "title" : "Special Seminar: Real Estate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.353",
    "academicYear" : "2016",
    "title" : "Securitization of Mortgages and Other Assets",
    "cluster" : "(Same subject as 15.429J)",
    "prerequisites" : "15.426, 15.401, or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 15.429J.",
    "instructors" : "W. Torous"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.022",
    "academicYear" : "2016",
    "title" : "Regulation of Chemicals, Radiation, and Biotechnology",
    "cluster" : "(Same subject as 1.802J)\n(Subject meets with 1.812J, 10.805, 11.631J, ESD.134J)",
    "prerequisites" : "1.801 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.802J.",
    "instructors" : "N. Ashford, C. Caldart"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.381",
    "academicYear" : "2016",
    "title" : "Urban Energy Systems and Policy",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines how cities use energy; the institutional, market and regulatory environment in which policymakers operate; steps cities are taking to better manage their energy use; and the challenges entrepreneurs face in trying to make the system more sustainable. Guest speakers contribute real-world perspective.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.137",
    "academicYear" : "2016",
    "title" : "Financing Economic Development",
    "cluster" : "(Subject meets with 11.437)",
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Focuses on financing tools and program models to support local economic development. Provides an overview of private capital markets and financing sources to understand capital market imperfections that constrain economic development, business accounting, financial statement analysis, federal economic development programs, and public finance tools. Covers policies and program models, including revolving loan funds, guarantee programs, venture capital funds, bank holding companies, community development loan funds and credit unions, micro enterprise funds, and the Community Reinvestment Act. Students taking graduate version complete additional assignments.",
    "instructors" : "K. Seidman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.496",
    "academicYear" : "2016",
    "title" : "Law, Social Movements, and Public Policy: Comparative and International Experience",
    "cluster" : "(Subject meets with 11.166)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Studies the interaction between law, courts, and social movements in shaping domestic and global public policy. Examines how groups mobilize to use law to affect change and why they succeed and fail. Uses case studies to explore the interplay between law, social movements, and public policy in current areas such as gender, race, labor, trade, environment, and human rights. Introduces the theories of public policy, social movements, law and society, and transnational studies. Students taking the graduate version complete additional assignments.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.497",
    "academicYear" : "2016",
    "title" : "Human Rights at Home and Abroad",
    "cluster" : "(Subject meets with 11.164J, 17.391J)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides a rigorous and critical introduction to the history, foundation, structure, and operation of the human rights movement. Focuses on key ideas, actors, methods and sources, and critically evaluates the field. Addresses current debates in human rights, including the relationship with security, democracy, development and globalization, urbanization, equality (in housing and other economic and social rights; women's rights; ethnic, religious and racial discrimination; and policing/conflict), post-conflict rebuilding and transitional justice, and technology-related issues. Students taking graduate version expected to write a research paper.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.468",
    "academicYear" : "2016",
    "title" : "SIGUS Workshop",
    "cluster" : "(Same subject as 4.230J)\n(Subject meets with 4.231)",
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 4.230J.",
    "instructors" : "R. Goethert"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.129",
    "academicYear" : "2016",
    "title" : "Educational Theory and Practice I",
    "cluster" : null,
    "prerequisites" : "None. <I>Coreq: 11.124</I>",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Concentrates on core set of skills and knowledge necessary for teaching in secondary schools. Topics include classroom management, student behavior and motivation, curriculum design, educational reform, and the teaching profession. Classroom observation is a key component. Assignments include readings from  educational literature, written reflections on classroom observations, practice teaching and constructing curriculum. The first of the three-course sequence necessary to complete the Teacher Education Program. Limited to 15; preference to juniors and seniors.",
    "instructors" : "G. Schwanbeck"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.130",
    "academicYear" : "2016",
    "title" : "Educational Theory and Practice II",
    "cluster" : null,
    "prerequisites" : "11.129",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Concentrates on the theory and psychology associated with student learning. Topics include educational theory, educational psychology, and theories of learning. Students assume responsibility for full-time teaching of two or more classes at their designated school. Class sessions focus on debriefing and problem-solving. Second of a three-course sequence necessary to complete the Teacher Education Program.",
    "instructors" : "G. Schwanbeck"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.131",
    "academicYear" : "2016",
    "title" : "Educational Theory and Practice III",
    "cluster" : null,
    "prerequisites" : "11.130",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Students continue their IAP student teaching through mid March. Topics include educational psychology, theories of learning, and using technology and evaluating its effectiveness to enhance student learning. Assignments include readings from educational literature, written reflections on student teaching, presentations on class topics and creating a project that supports student learning at the school where the MIT student is teaching. This is the third of the three-course sequence necessary to complete the Teacher Education Program.",
    "instructors" : "G. Schwanbeck"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.630",
    "academicYear" : "2016",
    "title" : "Environmental Law, Policy, and Economics: Pollution Prevention and Control",
    "cluster" : "(Same subject as 1.811J, ESD.133J)\n(Subject meets with 1.801J, 11.021J, 17.393J)",
    "prerequisites" : "Permission of instructor for undergraduates",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.811J.",
    "instructors" : "N. Ashford, C. Caldart"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.631",
    "academicYear" : "2016",
    "title" : "Regulation of Chemicals, Radiation, and Biotechnology",
    "cluster" : "(Same subject as 1.812J, ESD.134J)\n(Subject meets with 1.802J, 10.805, 11.022J)",
    "prerequisites" : "1.811 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.812J.",
    "instructors" : "N. Ashford, C.Caldart"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.338",
    "academicYear" : "2016",
    "title" : "Urban Design Studio",
    "cluster" : null,
    "prerequisites" : "11.328",
    "units" : "0-12-9",
    "optional" : null,
    "description" : "Examines the rehabilitation and re-imagination of a city.  Analyzes the city at three scales: citywide, neighborhood, and individual dwellings.  Aims to shape innovative design solutions, enhance social amenity, and improve economic equity through strategic and creative geographical, urban design and architectural thinking.  Intended for students with backgrounds in architecture, community development, and physical planning. Limited to 12 via application and lottery.",
    "instructors" : "B. Ryan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.543",
    "academicYear" : "2016",
    "title" : "Transportation Policy, the Environment, and Livable Communities",
    "cluster" : "(Same subject as 1.253J, ESD.222J)\n(Subject meets with 1.153)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.253J.",
    "instructors" : "J. Coughlin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.541",
    "academicYear" : "2016",
    "title" : "Public Transportation Systems",
    "cluster" : "(Same subject as 1.258J, ESD.226J)",
    "prerequisites" : "1.201 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.258J.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.402",
    "academicYear" : "2016",
    "title" : "Urban Politics: Race and Political Change",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the place of US cities in political theory and practice. Particular attention given to contemporary issues of racial polarization, demographic change, poverty, sprawl, and globalization. Specific cities are a focus for discussion.",
    "instructors" : "J. P. Thompson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.488",
    "academicYear" : "2016",
    "title" : "Urban Development in Conflict Cities: Planning Challenges and Policy Innovations",
    "cluster" : null,
    "prerequisites" : "Permission of Instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Economic, religious, gender and ethnic differences must be negotiated every day in the urban arena. When tensions and conflict escalates into violence, the urban space becomes the battlespace in which these tensions are negotiated. Examines urban development challenges in conflict cities through multiple disciplinary perspectives on urban conflict. Review of the literature about when violence and cities intersect. Focuses on policy innovations, and an examination of potential planning, design, and policy solutions.",
    "instructors" : "J. Samper Escobar"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.364",
    "academicYear" : "2016",
    "title" : "International Environmental Treaties and Their Implementation",
    "cluster" : null,
    "prerequisites" : "11.601, 11.255, or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Examines the history and dynamics of international environmental treaty-making, or what is called environmental diplomacy. Emphasis is on climate change and other atmospheric, marine resource, global waste management and sustainability-related treaties and the problems of implementing them. Reviews the legal, economic, and political dynamics of managing shared resources, involving civil society on a global basis, and enforcing transboundary agreements. Focuses especially on principles from international relations, international law, environmental management and negotiation theory as they relate to common-pool resource management.",
    "instructors" : "L. Susskind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.THT",
    "academicYear" : "2016",
    "title" : "Thesis Research Design Seminar",
    "cluster" : "(Same subject as 4.THTJ)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Designed for students writing a thesis in Urban Studies and Planning or Architecture. Develop research topics, review relevant research and scholarship, frame research questions and arguments, choose an appropriate methodology for analysis, and draft introductory and methodology sections.",
    "instructors" : "C. Abbanat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.164",
    "academicYear" : "2016",
    "title" : "Human Rights at Home and Abroad",
    "cluster" : "(Same subject as 17.391J)\n(Subject meets with 11.497)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Provides a rigorous and critical introduction to the history, foundation, structure, and operation of the human rights movement. Focuses on key ideas, actors, methods and sources, and critically evaluates the field. Addresses current debates in human rights, including the relationship with security, democracy, development and globalization, urbanization, equality (in housing and other economic and social rights; women's rights; ethnic, religious and racial discrimination; and policing/conflict), post-conflict rebuilding and transitional justice, and technology-related issues. Requires prior coursework, work experience, or community service that demonstrates familiarity with global affairs or ethics in social justice issues. Students taking graduate version expected to write a research paper.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.545",
    "academicYear" : "2016",
    "title" : "Transportation Systems Analysis: Demand and Economics",
    "cluster" : "(Same subject as 1.201J, ESD.210J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "See description under subject 1.201J.",
    "instructors" : "M. Ben-Akiva"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.544",
    "academicYear" : "2016",
    "title" : "Transportation Systems Analysis: Performance and Optimization",
    "cluster" : "(Same subject as 1.200J, ESD.21J)",
    "prerequisites" : "1.010, permission of instructor",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "See description under subject 1.200J.",
    "instructors" : "C. Osorio, J.Orlin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.526",
    "academicYear" : "2016",
    "title" : "Comparative Land Use and Transportation Planning",
    "cluster" : "(Same subject as 1.251J)",
    "prerequisites" : "Permission of Instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on the integration of land use and transportation planning, drawing from cases in both industrialized and developing countries. Reviews underlying theories, analytical techniques, and the empirical evidence of the land use-transportation relationship at the metropolitan, intra-metropolitan, and micro-scales.  Also covers the various ways of measuring urban structure, form, and the \"built environment.\"  Develops students' skills to assess relevant policies, interventions and impacts.",
    "instructors" : "C. Zegras"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.021",
    "academicYear" : "2016",
    "title" : "Environmental Law, Policy, and Economics: Pollution Prevention and Control",
    "cluster" : "(Same subject as 1.801J, 17.393J)\n(Subject meets with 1.811J, 11.630J, ESD.133J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "See description under subject 1.801J.",
    "instructors" : "N. Ashford, C. Caldart"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.466",
    "academicYear" : "2016",
    "title" : "Technology, Globalization, and Sustainable Development",
    "cluster" : "(Same subject as 1.813J, 15.657J, ESD.137J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject ESD.137J.",
    "instructors" : "N. Ashford"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.320",
    "academicYear" : "2016",
    "title" : "Digital City Design Workshop",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Students develop proposals, at the city and neighborhood scales, that integrate urban design, planning, and digital technology. Aims to create more efficient, responsive, and livable urban places and systems that combine physical form with digital media, sensing, communications, and data analysis. Students conduct field research, build project briefs, and deliver designs or prototypes, while supported by lectures, case studies, and involvement from experts and representatives of subject cities. Limited to 12.",
    "instructors" : "C. Ratti"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.342",
    "academicYear" : "2016",
    "title" : "Globalization and the Built Environment",
    "cluster" : "(Same subject as 1.463J, ESD.53J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 1.463J.",
    "instructors" : "F. Moavenzadeh, D. Wolff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.344",
    "academicYear" : "2016",
    "title" : "Innovative Project Delivery in the Public and Private Sectors",
    "cluster" : "(Same subject as 1.472J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Develops a strong strategic understanding of how best to deliver various types of projects in the built environment. Examines the compatibility of various project delivery methods, consisting of organizations, contracts, and award methods, with certain types of projects and owners. Six methods examined: traditional general contracting; construction management; multiple primes; design-build; turnkey; and build-operate-transfer. Includes lectures, case studies, guest speakers, and a team project to analyze a case example.",
    "instructors" : "C. M. Gordon"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.345",
    "academicYear" : "2016",
    "title" : "Entrepreneurship in Construction and Real Estate Development",
    "cluster" : "(Same subject as 1.462J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Researches the role of the entrepreneur in the built environment using case studies to outline different steps in developing real estate, construction, architectural and related enterprises in the built environment. Emphasizes strategic marketing and implementation of the plan in the development of these businesses. Addresses the progression of an idea, from an opportunity to a sustainable business. Guest lectures from entrepreneurs in the built environment outline the various entrepreneurial paths and characteristics they took to success. Team project consists of identifying an idea/opportunity and plan for developing a sustainable company.",
    "instructors" : "J. F. Kennedy"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.469",
    "academicYear" : "2016",
    "title" : "Urban Sociology in Theory and Practice",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to core writings in urban sociology. Examines key theoretical paradigms that have comprised the field since its founding. Explores the nature and changing character of the city and the urban experience in the US and abroad, providing context for development and application of planning skills and sensibilities as well as urban research. Topics include the changing nature of community, social inequality, culture, political power, socio-spatial change, technological change, and the relationship between the built environment and human behavior.",
    "instructors" : "J. Steil"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.470",
    "academicYear" : "2016",
    "title" : "The Politics of Development Policy",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the political forces and conditions that affect urban, regional, and national development policymaking.  Key protagonists include political parties, state actors, social movements, NGOs (domestic and global), business groups, and labor organizations, both formal and informal.  Primary emphasis is the developing world, but seeks parallels across a variety of comparative and historical contexts.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.161",
    "academicYear" : "2016",
    "title" : "Energy Decisions, Markets, and Policies",
    "cluster" : "(Same subject as 14.43J, 15.031J, 17.397J, 21A.415J)",
    "prerequisites" : "14.01, 15.0111, or permission of instructor",
    "units" : "4-0-8 HASS-S",
    "optional" : null,
    "description" : "See description under subject 15.031J.",
    "instructors" : "C. Warshaw"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.190",
    "academicYear" : "2016",
    "title" : "Urban Fieldwork",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Practical application of city and regional planning techniques to towns, cities, and regions, including problems of replanning, redevelopment, and renewal of existing communities. Includes internships, under staff supervision, in municipal and state agencies and departments.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.127",
    "academicYear" : "2016",
    "title" : "Design and Development of Games for Learning",
    "cluster" : "(Same subject as CMS.590J)\n(Subject meets with 11.252J, CMS.863J)",
    "prerequisites" : "None",
    "units" : "3-6-3 HASS-H",
    "optional" : null,
    "description" : "Immerses students in the process of building and testing their own digital and board games in order to better understand how we learn from games.  Explores the design and use of games in the classroom in addition to research and development issues associated with computer-based (desktop and handheld) and non-computer-based media. In developing their own games, students examine what and how people learn from them (including field testing of products), as well as how games can be implemented in educational settings.  All levels of computer experience welcome.  Students taking graduate version complete additional assignments.",
    "instructors" : "E. Klopfer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.252",
    "academicYear" : "2016",
    "title" : "Design and Development of Games for Learning",
    "cluster" : "(Same subject as CMS.863J)\n(Subject meets with 11.127J, CMS.590J)",
    "prerequisites" : "None",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "Immerses students in the process of building and testing their own digital and board games in order to better understand how we learn from games.  Explores the design and use of games in the classroom in addition to research and development issues associated with computer-based (desktop and handheld) and non-computer-based media. In developing their own games, students examine what and how people learn from them (including field testing of products), as well as how games can be implemented in educational settings.  All levels of computer experience welcome. Students taking graduate version complete additional assignments.",
    "instructors" : "E. Klopfer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.434",
    "academicYear" : "2016",
    "title" : "Tools for Analysis:  Design for Real Estate and Infrastructure Development",
    "cluster" : "(Same subject as 15.428J, ESD.712J)",
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduction to analytical tools to support design and decision-making in real estate, infrastructure development, and investment. Particular focus on identifying and valuing sources of flexibility using \"real options,\" Monte-Carlo simulation, and other techniques from the field of engineering systems. Integrates economic and engineering perspectives, and is suitable for students with various backgrounds. Provides useful preparation for thesis work in the area.",
    "instructors" : "D. Geltner, R. de Neufville"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.019",
    "academicYear" : "2016",
    "title" : "Migration and Immigration in US History",
    "cluster" : "(Same subject as 21H.310J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "See description under subject 21H.310J.",
    "instructors" : "C. Capozzola"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.027",
    "academicYear" : "2016",
    "title" : "City to City: Comparing, Researching and Writing about Cities",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Introduces client-oriented research and the use of urban planning tools. Students work directly with government and community agencies to find solutions to real world problems; interview planners and other field experts, and write and present findings to client and community audiences. Opportunity to travel for research. Limited to 14; preference to Course 11 majors.",
    "instructors" : "C. Abbanat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.533",
    "academicYear" : "2016",
    "title" : "Ecological Planning with GIS",
    "cluster" : null,
    "prerequisites" : "11.205",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Provides a practical introduction to spatial environmental assessment and planning methods, from landscape to regional scales. Lectures and discussions focus on key concepts in landscape ecology as well as the data and methods needed to incorporate these concepts in environmental planning. Weekly lab exercises demonstrate how natural systems are represented in modern geographic information systems, how to synthesize information using overlay analysis and suitability modeling, and design methods that build on the resulting syntheses. Features raster GIS analysis methods.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.378",
    "academicYear" : "2016",
    "title" : "Water Planning, Policy, and Design",
    "cluster" : "(Same subject as 4.625J)",
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "See description under subject 4.625J.",
    "instructors" : "J. Wescoat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.377",
    "academicYear" : "2016",
    "title" : "Food Systems and the Environment",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores the evolution of food production in the US and globally. Considers the science, economics, and politics behind the transition from pre-industrial to an industrial food system. Debates the costs and benefits of genetically modified food, organic agriculture, and local/regional food production. Focuses on the environmental sustainability and human-health consequences of different approaches, for both the developed and developing world.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.140",
    "academicYear" : "2016",
    "title" : "Urbanization and Development",
    "cluster" : "(Subject meets with 11.480)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Examines developmental dynamics of rapidly urbanizing locales, with a special focus on the developing world.  Case studies from India, China, Mexico, Brazil, and South Africa form the basis for discussion of social, spatial, political and economic changes in cities spurred by the decline of industry, the rise of services, and the proliferation of urban mega projects. Emphasizes the challenges of growing urban inequality, environmental risk, citizen displacement, insufficient housing, and the lack of effective institutions for metropolitan governance. Students taking graduate version complete additional assignments.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.376",
    "academicYear" : "2016",
    "title" : "Urban Sustainability in Action",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Considers the theory and practice of urban sustainability. Introduces concepts of environmental sustainability, systems dynamics, ecological footprints, and environmental indicators. Investigates cutting-edge practices of cities in the US and around the world. Drawing on those examples, students work in and around the City of Boston on local sustainability initiatives.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.483",
    "academicYear" : "2016",
    "title" : "Housing and Land Use in Rapidly Urbanizing Regions",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Studies current urban controversies over affordable housing, land redevelopment, and public space, with special attention to property rights. Reviews how law, economics, sociology and planning theories frame these issues and interplays them with spatial approaches of urban design and geography. Explores cases that use property rights strategies to increase economic growth and social justice, providing insight for future design and policymaking. Topics include land trusts for affordable housing, mixed-use public space, and critical cartography.",
    "instructors" : "Y. Hong"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.480",
    "academicYear" : "2016",
    "title" : "Urbanization and Development",
    "cluster" : "(Subject meets with 11.140)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines developmental dynamics of rapidly urbanizing locales, with a special focus on the developing world.  Case studies from India, China, Mexico, Brazil, and South Africa form the basis for discussion of social, spatial, political and economic changes in cities spurred by the decline of industry, the rise of services, and the proliferation of urban mega projects. Emphasizes the challenges of growing urban inequality, environmental risk, citizen displacement, insufficient housing, and the lack of effective institutions for metropolitan governance. Students taking graduate version complete additional assignments.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.315",
    "academicYear" : "2016",
    "title" : "Disaster Resilient Design",
    "cluster" : "(Same subject as 4.217J)",
    "prerequisites" : "None",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 4.217J.",
    "instructors" : "J. Wescoat"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.025",
    "academicYear" : "2016",
    "title" : "D-Lab: Development",
    "cluster" : "(Same subject as EC.701J)\n(Subject meets with 11.472J, EC.781J)",
    "prerequisites" : "None",
    "units" : "3-2-7 HASS-S",
    "optional" : null,
    "description" : "See description under subject EC.701J.",
    "instructors" : "S. L. Hsu, A. B. Smith, B. Sanyal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.147",
    "academicYear" : "2016",
    "title" : "Innovative Budgeting and Finance for the Public Sector",
    "cluster" : "(Subject meets with 11.487)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Examines globally relevant challenges of adequately and effectively attending to public sector responsibilities for basic services with limited resources. Particular attention to the contexts of fiscal crises, rapid population growth, as well as shrinkage: through an introduction to methods and processes of budgeting, accounting, and financial mobilization in the public sector; use of case studies and practice exercises to explore revenue strategies and to gain fiscal analytical competencies; study of pioneering examples of promising budget and accounting processes as well as innovative funding mobilization via taxation, capital markets, and experimental experiences with mechanisms such as land-value capture.  Students taking graduate version are expected to explore the subject in greater depth.",
    "instructors" : "G. Carolini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.162",
    "academicYear" : "2016",
    "title" : "Politics of Energy and the Environment",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Focuses on the politics of making local, state, national and international decisions on energy and the environment.  Topics include implementing energy efficiency measures, siting nuclear and alternative energy plants, promoting oil and gas development offshore and in wilderness, adapting to climate change, handling toxic waste, protecting endangered species, and conserving water.  Case studies include Cape Wind, disputes over oil and gas exploration in the Arctic, the response to Hurricane Katrina, and efforts to craft and comply with the greenhouse gas emissions limits.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.026",
    "academicYear" : "2016",
    "title" : "Downtown",
    "cluster" : "(Same subject as 21H.321J)\n(Subject meets with 11.339)",
    "prerequisites" : "None",
    "units" : "2-0-7 HASS-H",
    "optional" : null,
    "description" : "See description under subject 21H.321J.",
    "instructors" : "R. M. Fogelson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.903",
    "academicYear" : "2016",
    "title" : "Supervised Readings in Urban Studies",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.905",
    "academicYear" : "2016",
    "title" : "Research Seminar in Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.907",
    "academicYear" : "2016",
    "title" : "Urban Fieldwork",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.S959",
    "academicYear" : "2016",
    "title" : "Special Seminar: Urban Studies and Planning",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.005",
    "academicYear" : "2016",
    "title" : "Introduction to International Development",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Introduces the political economy of international economic development planning, using an applied, quantitative approach. Considers why some countries are able to develop faster than others. Presents major theories and models of development and underdevelopment, providing tools to understand the mechanisms and processes behind economic growth and broader notions of progress. Offers an alternative view of development, focusing on the persistence of dichotomies in current theory and practice. Using specific cases, explores how different combinations of actors and institutions at various scales may promote or inhibit economic development. Students re-examine conventional knowledge and engage critically with the assumptions behind current thinking and policy.",
    "instructors" : "C. Ferreira Cardoso"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.351",
    "academicYear" : "2016",
    "title" : "Real Estate Ventures I: Negotiating Development-Phase Agreements",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on key business and legal issues within the principal agreements used to control, entitle, capitalize, and construct a mixed-use real estate development. Through the lens of the real estate developer and its counter-parties, students identify, discuss, and negotiate the most important business issues in right of entry, purchase and sale, development, and joint-venture agreements, as well as a construction contract and construction loan agreement. Students work closely with attorneys who specialize in the construction of such agreements. Enrollment limited; preference to MSRED students.",
    "instructors" : "W. T. McGrath"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.404",
    "academicYear" : "2016",
    "title" : "Housing Policy and Planning in the US",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores the policy tools and planning techniques used to formulate and implement housing strategies at local, state and federal levels.  Topics include America's housing finance system and the causes of instability in mortgage markets; economic and social inequity in access to affordable housing; approaches to meeting community housing needs through local and state planning programs; programs for addressing homelessness; and emerging ideas about sustainable development and green building related to housing development and renovation.",
    "instructors" : "J. Buckley"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.436",
    "academicYear" : "2016",
    "title" : "Housing Studio: Neighborhood Sustainability Plan",
    "cluster" : null,
    "prerequisites" : "11.401, 11.301, or 11.601",
    "units" : "6-0-9",
    "optional" : null,
    "description" : "Explores ways to improve housing quality and affordability, increase energy savings, and promote transportation access as part of a neighborhood sustainability plan.  Students work with a local client to define the terms of local sustainability for a specific Boston neighborhood, then design an appropriate framework for action for the target site focusing on existing and future housing needs, community services, transit connections, and energy policy.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.406",
    "academicYear" : "2016",
    "title" : "Key Ideas in City Planning History and Theory",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Investigates the evolution of the ideals, the profession, and the practice of city planning throughout history by looking at key ideas that have driven theorists and practitioners.  Explores city and regional planning in the light of broader historical trends, such as changing ideas about who cities are for; different approaches to urban problem-solving; variable factors affecting how urban settlements should be organized and re-organized; the development of human understanding about relationships between the built and natural environments; and about the effects of urban form and organization on society.  Focuses substantially but not entirely upon the American experience.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.527",
    "academicYear" : "2016",
    "title" : "Advanced Seminar in Transportation Finance",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-1-9",
    "optional" : null,
    "description" : "Focuses on the theory and practice of transportation system finance, examining the range of relevant topics including basic public finance, politics, institutional structures, externalities, pricing, and the role of advanced technologies. Primarily oriented around land-based, surface transportation, although in their research students are welcome to examine air and maritime modes according to their interests. Explores issues across a range of contexts, including North America, Europe, Latin America, and Asia.",
    "instructors" : "C. Zegras"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.352",
    "academicYear" : "2016",
    "title" : "Real Estate Ventures II: Negotiating Leases, Financings, and Restructurings",
    "cluster" : null,
    "prerequisites" : "11.351 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on the key business and legal issues within the principal agreements used to lease, finance, and restructure a real estate venture. Through the lens of the real estate developer and its counter-parties, students identify, discuss and negotiate the most important business issues in office and retail leases, and permanent loan, mezzanine loan, intercreditor, standstill/forbearance, and loan modification (workout) agreements. In doing so, students work closely with attorneys who specialize in the construction of such agreements. Also touches on single-asset real estate bankruptcy and the federal income tax consequences of debt restructuring. Enrollment limited; preference to MSRED students.",
    "instructors" : "W. T. McGrath"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.380",
    "academicYear" : "2016",
    "title" : "Urban Climate Adaptation",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the challenges cities face and strategies to prepare for the impacts of climate change. Particular attention to the needs of vulnerable populations and resource-constrained cities, global and national adaptation policies and funding mechanisms, and ways in which local government and community-based activities can promote climate-readiness.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.006",
    "academicYear" : "2016",
    "title" : "Poverty and Economic Security",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-7 HASS-S",
    "optional" : null,
    "description" : "Explores the evolution of poverty and economic security in the US within a global context.  Examines the impacts of recent economic restructuring and globalization.  Reviews current debates about the fate of the middle class, sources of increasing inequality, and approaches to advancing economic opportunity and security.",
    "instructors" : "P. Clay"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.160",
    "academicYear" : "2016",
    "title" : "Re-Energizing MIT: Innovating Energy Management at the Institute",
    "cluster" : "(Same subject as 2.601J)",
    "prerequisites" : "None",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Designed to enable students to make a direct contribution to MIT's efforts to improve energy management. Working in teams, students explore how energy is used on campus and then propose and implement ideas to reduce environmental and climate impact. Projects may include topics focused on improving building and appliance efficiency, transportation choices, and energy demand in dorms, offices, and laboratories. Limited to 15; preference to freshmen and sophomores.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.407",
    "academicYear" : "2016",
    "title" : "Economic Development Tools and Techniques",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces a suite of tools representing the basic set of practices used in the development field. Presents a wealth creation framework that focuses on place, improving livelihoods, incentivizing collaboration, creating multiple forms of wealth, and promoting local ownership. Students work with web-based tools designed for use in a professional setting. Discussions are based on results from tools, their interpretation, and their meaning. Relevant to all students interested in the structure and function of local, state, national and international economic contexts. Students develop a series of memos as students they complete assignments.",
    "instructors" : "A. Glasmeier"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.383",
    "academicYear" : "2016",
    "title" : "Managing Sustainable Businesses for People and Profits",
    "cluster" : "(Same subject as 15.662J, ESD.278J)",
    "prerequisites" : "None",
    "units" : "3-6-3",
    "optional" : null,
    "description" : "See description under subject 15.662J.",
    "instructors" : "T. Kochan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.313",
    "academicYear" : "2016",
    "title" : "Advanced Research Workshop in Landscape and Urbanism",
    "cluster" : null,
    "prerequisites" : "Permission of Instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "In-depth research workshop on pressing environmental design issue of our time, includes discussion and practices of various Landscape-based disciplines used to generate design-based solutions and landscape infrastructural responses to physical urban entropy and decline. Specific focus is adjusted each year.",
    "instructors" : "A. Berger"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.382",
    "academicYear" : "2016",
    "title" : "Water Diplomacy: The Science, Policy, & Politics of Managing Shared Resources",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the history and dynamics of international environmental treaty-making, or what is called environmental diplomacy. Emphasizes climate change and other atmospheric, marine resource, global waste management and sustainability-related treaties and the problems of implementing them. Reviews the legal, economic, and political dynamics of managing shared resources, involving civil society on a global basis, and enforcing transboundary agreements. Focuses especially on principles from international relations, international law, environmental management, and negotiation theory as they relate to common-pool resource management.",
    "instructors" : "L. Susskind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.475",
    "academicYear" : "2016",
    "title" : "Navigating Power in Water and Sanitation Planning",
    "cluster" : null,
    "prerequisites" : "Open to undergraduates with permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Informs and prepares students to navigate the explicit and implicit power dynamics among stakeholders in decision-making processes that govern the planning and delivery of water and sanitation systems. Through investigations of organization, regulation, financing, physical delivery, and research designs, students examine the trajectory of decisions that shape and influence the accessibility, affordability, and adequacy of water and sanitation services, particularly in vulnerable neighborhoods in mostly urban and peri-urban areas.  Emphasis is placed on the importance of moving beyond the limited dimensions of supply and demand studies and gaining fluency in the multiplicative political-economic and social factors driving choices in water and sanitation systems planning.  In-depth, globally comparative readings inform the course, and expose basic services in water and sanitation as a misnomer.",
    "instructors" : "G. Carolini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.354",
    "academicYear" : "2016",
    "title" : "Real Estate Products Seminar",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "Examines the fundamentals of real estate development products, including residential, hotel, office, research and development/lab, retail, and industrial uses. Includes faculty lectures, guest presentations, and field trips to local case study projects. Prepares MSRED candidates for the spring Real Estate Development Studio.",
    "instructors" : "P. Roth"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.405",
    "academicYear" : "2016",
    "title" : "Political Economy & Society",
    "cluster" : null,
    "prerequisites" : "Permission of Instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Focuses on the connection (or not) between mind (theory) and matter (lived experience). Examines basic tenets of classical and recent political economic theories and their explication in ideas of market economies, centrally planned economies, social market economies, and co-creative economies. Assesses theories according to their relation to the lived experiences of people in communities and workplaces.",
    "instructors" : "J. P. Thompson"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.312",
    "academicYear" : "2016",
    "title" : "Engaging Community: Models and Methods for Designers and Planners",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Reviews a range of models for engaging communities, from a client-consultant relationship to advocacy, community organizing, consensus building, capacity building, and knowledge building. Explores the ways these different models have been used in design and planning practice and community building.",
    "instructors" : "C. McDowell"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.373",
    "academicYear" : "2016",
    "title" : "Science, Politics, and Environmental Policy",
    "cluster" : "(Same subject as 12.885J)\n(Subject meets with 12.385)",
    "prerequisites" : "12.806, 12.807, or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 12.885J.",
    "instructors" : "S. Solomon, J. Layzer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.385",
    "academicYear" : "2016",
    "title" : "Malaysia Sustainable Cities Fieldwork",
    "cluster" : null,
    "prerequisites" : "11.384",
    "units" : "3-0-3 [P/D/F]",
    "optional" : null,
    "description" : "Investigates sustainable development efforts of regional development agencies in Penang, Kuala Lumpur, or Johor Bahru.  In addition to these sites, students visit the government city of Putrajaya, the World Heritage cities of George Town in Penang and Malacca, and Kuching in East Malaysia. Selection by application.",
    "instructors" : "L. Susskind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.801",
    "academicYear" : "2016",
    "title" : "Doctoral Research Paper",
    "cluster" : null,
    "prerequisites" : "Permission of instructor, <I>Coreq: 11.800</I>",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Students develop a first-year research paper in consultation with their advisor.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.540",
    "academicYear" : "2016",
    "title" : "Urban Transportation Planning",
    "cluster" : "(Same subject as 1.252J, ESD.225J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.252J.",
    "instructors" : "F. Salvucci, M. Murga"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.145",
    "academicYear" : "2016",
    "title" : "International Housing Economics and Finance",
    "cluster" : "(Subject meets with 11.355)",
    "prerequisites" : "14.01",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Presents a theory of comparative differences in international housing outcomes. Introduces institutional differences in the ways housing expenditures are financed, and the economic determinants of housing outcomes, such as construction costs, land values, housing quality, and ownership rates. Analyzes the flow of funds to and from the different national housing finance sectors. Develops an understanding of the greater financial and macroeconomic implications of the mortgage credit sector, and how policies affect the ways in which housing asset fluctuations impact national economies. Considers the perspective of investors in international real estate markets and the risks and rewards involved. Draws on lessons from an international comparative approach, and applies them to economic and finance policies at the local, state/provincial, and federal levels within a country of choice. Students taking graduate version complete additional assignments.",
    "instructors" : "A. Saiz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.355",
    "academicYear" : "2016",
    "title" : "International Housing Economics and Finance",
    "cluster" : "(Subject meets with 11.145)",
    "prerequisites" : "11.202, 11.203, 14.01 or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Presents a theory of comparative differences in international housing outcomes. Introduces institutional differences in the ways housing expenditures are financed, and the economic determinants of housing outcomes, such as construction costs, land values, housing quality, and ownership rates. Analyzes the flow of funds to and from the different national housing finance sectors. Develops an understanding of the greater financial and macroeconomic implications of the mortgage credit sector, and how policies affect the ways in which housing asset fluctuations impact national economies. Considers the perspective of investors in international real estate markets and the risks and rewards involved. Draws on lessons from an international comparative approach, and applies them to economic and finance policies at the local, state/provincial, and federal levels within a country of choice. Students taking graduate version complete additional assignments.",
    "instructors" : "A. Saiz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.146",
    "academicYear" : "2016",
    "title" : "Urbanizing China",
    "cluster" : "(Subject meets with 11.476)",
    "prerequisites" : "None",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Discusses China's daunting urban challenges: congestion and smog, housing affordability, land reform and urban financing, migrants and locals, and social and spatial inequality. Provides examples of laudable achievements and diverse and innovative responses across more than six hundred cities. Presents China's urbanization as the joint result of natural socioeconomic processes and conscious actions by governments, markets, and the public. Presents multidisciplinary approaches and alternative narratives. Examines the intricate interaction between state and market in China's context, yielding a variety of state-market 'cocktails' devised and experimented in different cities in response to local problems, each involving a multilayered projection onto urban space. Students taking graduate version complete additional assignments.",
    "instructors" : "J. Zhao"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.478",
    "academicYear" : "2016",
    "title" : "Behavior and Policy: Connections in Transportation",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines the behavioral foundation for policy design, using urban transportation examples. Introduces multiple frameworks of understanding behavior, contrasting perspectives of classic economic theory with behavioral economics and social psychology, suggests corresponding policy interventions and establishes a mapping between behavior, theory, and policy. Presents a spectrum of instruments for positively influencing behavior and improving welfare. Challenges students to critique, design, implement and interpret experiments that nudge travel behavior. Brings behavioral insights to creative design of transport policies that are efficient and equitable as well as simple, consistent, transparent, acceptable, and adaptive to behavioral changes.",
    "instructors" : "J. Zhao"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.479",
    "academicYear" : "2016",
    "title" : "Water, Sanitation, Hygiene and Environmental Sanitation (WASH-ENV) in Low- and Middle-income Countries",
    "cluster" : "(Same subject as 1.851J)",
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : null,
    "description" : "See description under subject 1.851J.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.183",
    "academicYear" : "2016",
    "title" : "Property Land Use Law for Planners",
    "cluster" : "(Subject meets with 11.493)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines legal and institutional arrangements for the establishment, transfer, and control over property under American and selected comparative systems, including India and South Africa. Focuses on key issues of property and land use law regarding planning and economic development. Emphasizes just and efficient resource use; institutional, entitlement and social relational approaches to property; distributional and other social aspects; and the relationship between property, culture, and democracy.",
    "instructors" : "B. Rajagopal"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.139",
    "academicYear" : "2016",
    "title" : "The City in Film",
    "cluster" : "(Subject meets with 11.239)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-H; CI-H",
    "optional" : null,
    "description" : "Surveys important developments in urbanism from 1900 to the present, using film as a lens to explore and interpret aspects of the urban experience in the US and abroad. Topics include industrialization, demographics, diversity, the environment, and the relationship between the community and the individual. Films vary from year to year but always include a balance of classics from the history of film, an occasional experimental/avant-garde film, and a number of more recent, mainstream movies. Students taking undergraduate version complete writing assignments that focus on observation, analysis, and the essay, and give an oral presentation. Limited to 18.",
    "instructors" : "E. Glenn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.476",
    "academicYear" : "2016",
    "title" : "Urbanizing China",
    "cluster" : "(Subject meets with 11.146)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Discusses China's daunting urban challenges: congestion and smog, housing affordability, land reform and urban financing, migrants and locals, and social and spatial inequality. Provides examples of laudable achievements and diverse and innovative responses across more than six hundred cities. Presents China's urbanization as the joint result of natural socioeconomic processes and conscious actions by governments, markets, and the public. Presents multidisciplinary approaches and alternative narratives. Examines the intricate interaction between state and market in China's context, yielding a variety of state-market 'cocktails' devised and experimented in different cities in response to local problems, each involving a multilayered projection onto urban space. Students taking graduate version complete additional assignments.",
    "instructors" : "J. Zhao"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.236",
    "academicYear" : "2016",
    "title" : "Theory of Participatory Action Research (PAR)",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduces the theory of participatory action research (PAR) and competing ideas about the uses of social research to promote social change. Focuses on the epistemological foundation for and knowledge generation in action research, as well as on approaches to co-producing research that requires engagement of the subjects, communities, or organizations that are being studied in the design, implementation and interpretation of applied social research. Explores the ethical obligations of outsiders along with rights and responsibilities of insiders in the research findings. Emphasizes recent scholarship, including arguments for and against phronetic social science.",
    "instructors" : "L. Susskind, D. Cunningham"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.237",
    "academicYear" : "2016",
    "title" : "Practice of Participatory Action Research (PAR)",
    "cluster" : null,
    "prerequisites" : "11.236 or permission of instructor",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduces the techniques of participatory action research (PAR) and the practice of case study research. Presents competing ideas about context-independent vs. context-dependent knowledge, arguments for and against generating theory on the basis of a single case, and problems of verification in PAR (i.e., disconfirming the researchers preconceptions). Focuses on actual cases in which PAR-like methods have been used with greater or lesser success. Integrates interactions with representatives of communities, organizations, and individuals who have been the focus of PAR. Analyzes techniques for co-designing and co-conducting all aspects of applied social research.",
    "instructors" : "L. Susskind, D. Cunningham"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.239",
    "academicYear" : "2016",
    "title" : "The City in Film",
    "cluster" : "(Subject meets with 11.139)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Surveys important developments in urbanism from 1900 to the present, using film as a lens to explore and interpret aspects of the urban experience in the US and abroad. Topics include industrialization, demographics, diversity, the environment, and the relationship between the community and the individual. Films vary from year to year but always include a balance of classics from the history of film, an occasional experimental/avant-garde film, and a number of more recent, mainstream movies. Students taking undergraduate version complete writing assignments that focus on observation, analysis, and the essay, and give an oral presentation.",
    "instructors" : "E. Glenn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.142",
    "academicYear" : "2016",
    "title" : "Geography of the Global Economy",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "Analyzes implications of economic globalization for communities, regions, international businesses and economic development organizations.  Uses spatial analysis techniques to model the role of energy resources in shaping international political economy. Investigates key drivers of human, physical, and social capital flows and their roles in modern human settlement systems. Surveys contemporary models of industrialization and places them in geographic context. Connects forces of change with their implications for the distribution of wealth and human well-being.",
    "instructors" : "A. Glasmeier"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.386",
    "academicYear" : "2016",
    "title" : "Malaysia Sustainable Cities Practicum",
    "cluster" : null,
    "prerequisites" : "11.385",
    "units" : "2-0-1",
    "optional" : null,
    "description" : "Examines examples of city development that reflect a commitment to the principles of sustainability, including economic development that ensures ecological sustainability, strategies for addressing intercultural tensions, and environmental quality improvements catalyzed by city development.",
    "instructors" : "L. Susskind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.384",
    "academicYear" : "2016",
    "title" : "Preparation for Malaysia Sustainable Cities Fieldwork",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "0-0-3 [P/D/F]",
    "optional" : null,
    "description" : "Under faculty supervision, students conduct independent research to familiarize themselves with the culture, economy, politics, geography, ecology, and history of Malaysia. Selection by application.",
    "instructors" : "L. Susskind"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.458",
    "academicYear" : "2016",
    "title" : "Crowd Sourced City: Civic Tech Prototyping Class",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Investigates the use of social medial and digital technologies for planning and advocacy by working with actual planning and advocacy organizations to develop, implement, and evaluate prototype digital tools. Students use the development of their digital tools as a way to investigate new media technologies that can be used for planning.",
    "instructors" : "S. Williams"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.307",
    "academicYear" : "2016",
    "title" : "Beijing Urban Design Studio",
    "cluster" : "(Same subject as 4.173J)",
    "prerequisites" : "Permission of instructor",
    "units" : "0-18-0",
    "optional" : null,
    "description" : "Design studio that includes architects and city planners working in teams on a contemporary development project of importance in China. Students analyze conditions, explore alternatives, and synthesize architecture, city design, and implementation plans. Lectures and brief study tours expose students to history and contemporary issues of urbanism in China. Offered every other summer in residence at Tsinghua University, Beijing, involving students and faculty from both schools. Limited to 10.",
    "instructors" : "D. Frenchman, C. Zegras"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.151",
    "academicYear" : "2016",
    "title" : "Youth Political Participation",
    "cluster" : "(Same subject as STS.080J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-H",
    "optional" : null,
    "description" : "See description under subject STS.080J.",
    "instructors" : "J. S. Light"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.461",
    "academicYear" : "2016",
    "title" : "Technocracy",
    "cluster" : "(Same subject as STS.463J)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject STS.463J.",
    "instructors" : "J. S. Light"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "11.457",
    "academicYear" : "2016",
    "title" : "More than Data: Smart Cities, Big Data, Civic Technology and Policy",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Discussions of future directions in the 'smart cities' debate. Begins by framing the current smart city with past trends such as the efficient city movement of the 1930s and the Modernist city of the 1950s and 60s. Examines current trends in big data, civic apps, Code for America, the open data movement, DIY data collections devices, and their policy impacts.",
    "instructors" : "S. Williams"
  } ]
}