{
  "metadata" : {
    "size" : "209"
  },
  "items" : [ {
    "termCode" : "2016FA",
    "subjectId" : "12.611",
    "academicYear" : "2016",
    "title" : "Advanced Planetary Observations",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "0-6-3 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Individual research projects in planetary science and astrophysics involving supervised work at Lowell Observatory in Flagstaff, AZ. Projects may include observations made using Lowell's telescope facilities. Project topics and objectives vary from year to year. Written and oral reports required. Enrollment limited.",
    "instructors" : "A. Bosh"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.307",
    "academicYear" : "2016",
    "title" : "Weather and Climate Laboratory",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR), Physics I (GIR)",
    "units" : "1-4-10 Institute LAB",
    "optional" : null,
    "description" : "A laboratory subject intended to illustrate, by means of hands-on projects, the basic dynamical and physical principles which govern the general circulation of the atmosphere and the day-to-day sequence of weather events. Real-time meteorological observations are studied together with laboratory fluid experiments. Projects based on real-time observations stress the analysis and dynamical interpretation of the real phenomena, while complementary rotating tank experiments stress planning and testing of ideas in a more controlled laboratory environment. Written critical summaries of the results of each project and oral presentations are an integral part of the subject.",
    "instructors" : "L. Illari, J. Marshall"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.310",
    "academicYear" : "2016",
    "title" : "An Introduction to Weather Forecasting",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR), Calculus I (GIR)",
    "units" : "1-1-4 [P/D/F]",
    "optional" : null,
    "description" : "Basic principles of synoptic meteorology and weather forecasting. Analysis of hourly weather data and numerical weather prediction models. Regular preparation of weather forecasts.",
    "instructors" : "L. Illari"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.333",
    "academicYear" : "2016",
    "title" : "Atmospheric Dynamics",
    "cluster" : null,
    "prerequisites" : "12.003, 8.03, 18.03; or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Discusses the dynamics of the atmosphere, with emphasis on the large scale. Topics include zonally symmetric circulations and the tropical Hadley circulation; internal gravity waves; balanced flows, potential vorticity conservation and Rossby waves; stability of zonal flows; baroclinic instability and extratropical storms; tropical waves, the Walker circulation, and El Ni&ntilde;o and the Southern Oscillation; and the role of eddies in the general circulation. Students taking graduate version complete different assignments.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.400",
    "academicYear" : "2016",
    "title" : "The Solar System",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR)",
    "units" : "3-0-9 REST",
    "optional" : null,
    "description" : "Introduction to the study of the solar system with emphasis on the latest spacecraft results. Subject covers basic principles rather than detailed mathematical and physical models. Topics include an overview of the solar system, planetary orbits, rings, planetary formation, meteorites, asteroids, comets, planetary surfaces and cratering, planetary interiors, planetary atmospheres, and life in the solar system.",
    "instructors" : "R. P. Binzel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.402",
    "academicYear" : "2016",
    "title" : "Introduction to Astronomy",
    "cluster" : "(Same subject as 8.282J)",
    "prerequisites" : "Physics I (GIR)",
    "units" : "3-0-6 REST",
    "optional" : null,
    "description" : "See description under subject 8.282J.",
    "instructors" : "J. Winn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.409",
    "academicYear" : "2016",
    "title" : "Hands-On Astronomy: Observing Stars and Planets",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "0-4-2 [P/D/F]",
    "optional" : null,
    "description" : "Background for, and techniques of, visual observation and electronic imaging of the Moon, planets, satellites, stars, and brighter deep-space objects. Weekly outdoor observing sessions using 8-inch diameter telescopes when weather permits. Indoor sessions introduce skills necessary for observation. Introduction to contemporary observational astronomy including astronomical computing, image and data processing, and how astronomers work. Student must maintain a careful and complete written log which is graded. Consumes an entire evening each week; 100% attendance at observing sessions required to pass. Enrollment limited; priority to freshmen.",
    "instructors" : "A. Bosh"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.410",
    "academicYear" : "2016",
    "title" : "Observational Techniques of Optical Astronomy",
    "cluster" : "(Same subject as 8.287J)",
    "prerequisites" : "8.282J, 12.402J, 12.409, or other introductory astronomy course; <I>Coreq: 8.03</I>",
    "units" : "3-4-8 Institute LAB",
    "optional" : null,
    "description" : "Fundamental physical and optical principles used for astronomical measurements at visible wavelengths and practical methods of astronomical observations. Topics: astronomical coordinates, time, optics, telescopes, photon counting, signal-to-noise ratios, data analysis (including least-squares model fitting), limitations imposed by the Earth's atmosphere on optical observations, CCD detectors, photometry, spectroscopy, astrometry, and time variability. Project at Wallace Astrophysical Observatory. Written and oral project reports. Limited to 18; preference to Course 8 and Course 12 majors and minors.",
    "instructors" : "A. Bosh, M. Person"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.411",
    "academicYear" : "2016",
    "title" : "Astronomy Field Camp",
    "cluster" : null,
    "prerequisites" : "12.410 or 8.287",
    "units" : "0-6-3 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Individual research projects in planetary science and astrophysics, involving supervised work at Lowell Observatory in Flagstaff, AZ.  Projects may include observations made using Lowell's telescope facilities.  Project topics and objectives vary from year to year.  Written and oral reports required. Limited to 6.",
    "instructors" : "A. Bosh"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.THG",
    "academicYear" : "2016",
    "title" : "Graduate Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of an SM, PhD, or ScD thesis; to be arranged by the student and an appropriate MIT faculty member.",
    "instructors" : "Consult Department Headquarters"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.445",
    "academicYear" : "2016",
    "title" : "Communication in the Earth, Atmospheric, and Planetary Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-3 [P/D/F]",
    "optional" : null,
    "description" : "Concentrated instruction and practice in professional writing and presentation. Topics include review of various communication styles prevalent in the field; strategies for tailoring reports, technical papers, and presentations for specific audiences; and mechanics of organization and style. Weekly assignments in writing or speaking, with peer and instructor feedback. Limited to 6.",
    "instructors" : "F. D. Morgan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.450",
    "academicYear" : "2016",
    "title" : "Seminar in Geology and Geochemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Seminar on topics of current interest in geology and geochemistry. Required background preparation for students taking pre-doctoral general examinations in these subjects.",
    "instructors" : "Geology and Geochemistry Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.451",
    "academicYear" : "2016",
    "title" : "Seminar in Regional Tectonics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Applies techniques of tectonic synthesis to study the roles of particular orogenic belts in global plate tectonics. Treats different applications in different terms, so that the subject may be taken repeatedly to learn the range of orogenic responses to temporal and spatial variations of activity at plate boundaries.",
    "instructors" : "B. C. Burchfiel, L. H. Royden"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.456",
    "academicYear" : "2016",
    "title" : "Seminar in Rock Mechanics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Discussion of current research or advanced topics in continental tectonics, rock mechanics, or experimental structural geology.",
    "instructors" : "B. Evans"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.461",
    "academicYear" : "2016",
    "title" : "Current Research in Geology and Geochemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations on problems in geology, petrology, mineralogy, geochemistry, or geobiology. 12.460 is letter-graded.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.463",
    "academicYear" : "2016",
    "title" : "Geomorphology",
    "cluster" : "(Subject meets with 12.163)",
    "prerequisites" : "12.001, Physics I (GIR), Calculus I (GIR); or permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Quantitative examination of processes that shape Earth's surface. Introduction to fluvial, hillslope, and glacial mechanics. Essentials of weathering, soil formation, runoff, erosion, slope stability, sediment transport, and river morphology. Landscape evolution in response to climatic and tectonic forcing. Application of terrestrial theory to planetary surfaces. Additional instruction in geographic information systems (GIS) and remote sensing analysis, field measurement techniques, and numerical modeling of surface processes. Students taking the graduate version complete different assignments.",
    "instructors" : "T. Perron"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.467",
    "academicYear" : "2016",
    "title" : "Seminar in Geomorphology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Discussion of current research or advanced topics in landscape evolution, surface hydrology, mechanics of sediment transport, basin analysis, or experimental geomorphology. Advanced instruction in process geomorphology.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.474",
    "academicYear" : "2016",
    "title" : "Origin and Evolution of the Earth's Crust",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Broad overview of the origin and evolution of Earth's crust and mantle with emphasis on the study of the Precambrian rock record. Topics include: processes of crustal growth, stabilization, and reactivation; evaluation of secular change; and use of radiogenic isotopes in geochronology and as tracers of crust forming processes.",
    "instructors" : "O. Jagoutz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.475",
    "academicYear" : "2016",
    "title" : "Plate Tectonics and Continental Deformation",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "First half covers basic elements of plate tectonics, including sea floor spreading, magnetic anomalies, and subduction zone. Second half covers implications of plate tectonics for continental processes, including continental rifting, continental collision, and mountain building. Emphasis will be on correlating plate tectonic and continental processes using specific examples from around the world.",
    "instructors" : "L. H. Royden"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.476",
    "academicYear" : "2016",
    "title" : "Radiogenic Isotope Geology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Applications of the variations in the relative abundance of radiogenic isotopes to problems of petrology, geochemistry, and tectonics. Topics: geochronology; isotopic evolution of Earth's crust and mantle; petrogenesis; and analytical techniques.",
    "instructors" : "S. Bowring"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.480",
    "academicYear" : "2016",
    "title" : "Thermodynamics for Geoscientists",
    "cluster" : null,
    "prerequisites" : "5.60 or 3.00",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Principles of thermodynamics are used to infer the physical conditions of formation and modification of igneous and metamorphic rocks. Includes phase equilibria of homogeneous and heterogeneous systems and thermodynamic modelling of non-ideal crystalline solutions. Surveys the processes that lead to the formation of metamorphic and igneous rocks in the major tectonic environments in the Earth's crust and mantle.",
    "instructors" : "T. L. Grove"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.481",
    "academicYear" : "2016",
    "title" : "Advanced Field Geology I",
    "cluster" : null,
    "prerequisites" : "12.113, 12.114",
    "units" : "2-2-2 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Introduction to the problems to be investigated in 12.482, as well as the regional setting and local geology of the field area. Various special techniques may be introduced and preparatory investigations may be conducted that are specific to the area to be studied in 12.482.",
    "instructors" : "B. C. Burchfiel, O. Jagoutz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.482",
    "academicYear" : "2016",
    "title" : "Advanced Field Geology II",
    "cluster" : null,
    "prerequisites" : "12.481",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "In January, a geological and geomorphological study of a selected field area is conducted during a four-week excursion. The following term includes: preparation of maps and report based on field study conducted in January; and laboratory analysis of samples.",
    "instructors" : "B. C. Burchfiel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.484",
    "academicYear" : "2016",
    "title" : "Directed Field Studies",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "0-6-0",
    "optional" : "Can be repeated for credit",
    "description" : "Intensive training in field geological methods. Includes specific exercises selected to complement the backgrounds of the students enrolled and provides supervised experience in applying field analytical techniques to geological problems. Cannot be taken as a substitute for 12.115. Preference will be given to students associated with Course 12. Enrollment limited; students should apply early.",
    "instructors" : "B. C. Burchfiel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.485",
    "academicYear" : "2016",
    "title" : "Advanced Directed Field Studies",
    "cluster" : null,
    "prerequisites" : "12.484",
    "units" : "0-6-0",
    "optional" : "Can be repeated for credit",
    "description" : "Continuation of 12.484. Designed to provide more advanced training in specific field geological methods. Can be taken during the same IAP period as 12.484. Preference will be given to students associated with Course 12. Enrollment limited; students should apply early.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.501",
    "academicYear" : "2016",
    "title" : "Essentials of Global Geophysics",
    "cluster" : "(Subject meets with 12.201)",
    "prerequisites" : "Physics II (GIR), 18.03",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Overview of basic topics in solid-earth geophysics, such as the Earth's rotation, gravity and magnetic field, seismology, and thermal structure. Formulation of physical principles presented in three one-hour lectures per week. Current applications discussed in an additional one-hour tutorial each week. Students taking graduate version complete different assignments.",
    "instructors" : "R. van der Hilst"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.507",
    "academicYear" : "2016",
    "title" : "Essentials of Applied Geophysics",
    "cluster" : "(Subject meets with 12.214)",
    "prerequisites" : "18.03",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Introduces the application of geophysical methods to all aspects of near-surface environmental and engineering geophysics, including the exploration for petroleum, water, and minerals. Topics include seismic, electrical, electromagnetic, ground penetrating radar, magnetics, gravity, rock physics and chemistry, borehole geophysics and the global positioning system (GPS). Uses a quantitative approach to emphasize basic principles and a physical /chemical understanding of each method. Discusses specific illustrative field examples. Lab work is mainly devoted to local field work and equipment preparation for the IAP Field Geophysics class. Students taking graduate version complete additional assignments.",
    "instructors" : "F. D. Morgan, T. A. Herring, B. H. Hager"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.510",
    "academicYear" : "2016",
    "title" : "Introduction to Seismology",
    "cluster" : null,
    "prerequisites" : "18.075 or 18.085",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "A basic study in seismology and the utilization of seismic waves for the study of Earth's interior. Introduces techniques necessary for understanding of elastic wave propagation in stratified media and for calculation of synthetic seismograms (WKBJ and mode summation). Ray theory; interpretation of travel times. (e.g., tomography); surface wave dispersion in layered media; Earth's free oscillations; and seismicity, (earthquake locations, magnitude, moment, and source properties).",
    "instructors" : "G. Prieto"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.515",
    "academicYear" : "2016",
    "title" : "Data and Models",
    "cluster" : null,
    "prerequisites" : "18.075 or 18.085",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Surveys a number of methods of inverting data to obtain model parameter estimates. Topics include review of matrix theory and statistics, random and grid-search methods, linear and non-linear least squares, maximum-likelihood estimation, ridge regression, stochastic inversion, sequential estimation, singular value decomposition, solution of large systems, genetic and simulated annealing inversion, regularization, parameter error estimates, and solution uniqueness and resolution. Computer laboratory and algorithm development.",
    "instructors" : "F. D. Morgan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.520",
    "academicYear" : "2016",
    "title" : "Geodynamics",
    "cluster" : null,
    "prerequisites" : "12.005; 18.075 or 18.085",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Mechanics of deformation of the crust and mantle, with emphasis on the importance of different rheological descriptions: brittle, elastic, linear and nonlinear fluids, and viscoelastic.",
    "instructors" : "B. H. Hager"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.522",
    "academicYear" : "2016",
    "title" : "Geological Fluid Mechanics",
    "cluster" : null,
    "prerequisites" : "8.03; 18.076 or 18.085",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Treats heat transfer and fluid mechanics in the Earth, low Reynolds number flows, convection instability, double diffusion, Non-Newtonian flows, flow in porous media, and the interaction of flows with accreting and deforming boundaries. Applications include: the flow under plates, postglacial rebound, diapirism, magma dynamics, and the mantle convection problem.",
    "instructors" : "J. A. Whitehead (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.524",
    "academicYear" : "2016",
    "title" : "Mechanical Properties of Rocks",
    "cluster" : null,
    "prerequisites" : "8.03, 18.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A survey of the mechanical behavior of rocks in natural geologic situations. Topics: brief survey of field evidence of rock deformation, physics of plastic deformation in minerals, brittle fracture and sliding, and pressure-solution processes. Results of field petrologic and structural studies compared to data from experimental structural geology.",
    "instructors" : "B. Evans"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.533",
    "academicYear" : "2016",
    "title" : "Rock Physics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Fundamentals of experimental and theoretical rock physics taught at an advanced level. Rocks viewed as complex composite media with behavior dependent both on the physical and chemical properties of the constituent phases, and on their geometries. Electrical, fluid transport, and seismic properties covered in detail. Other topics such as magnetic, mechanical, and thermal responses briefly discussed. Weekly laboratory.",
    "instructors" : "F. D. Morgan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.540",
    "academicYear" : "2016",
    "title" : "Principles of Global Positioning System",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR), Calculus II (GIR), 18.06",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "The principles and applications of the Global Positioning System (GPS) and other space geodetic systems, including very-long-baseline interferometry (VLBI) and satellite laser ranging (SLR). The nature and uses of the course acquisition (CA), the precise positioning (P) codes, and the differential carrier phase observable. Techniques for estimating geodetic and geophysical quantities from these data. Other topics include: atmospheric refraction modeling, effects of Selective Availability (SA), estimation techniques (including Kalman filtering). Statistical and spectral analysis of data.",
    "instructors" : "T. A. Herring"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.561",
    "academicYear" : "2016",
    "title" : "Advanced Seminar in Exploration Geophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced seminar focusing on areas of current interest in exploration geophysics and seismology. 12.560 is letter-graded.",
    "instructors" : "Geophysics Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.570",
    "academicYear" : "2016",
    "title" : "Topical Issues in  Global Geophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Series of formal lectures and seminars with the specific content varying by term to reflect current issues in research.  Meets jointly with relevant Harvard course.",
    "instructors" : "R. D. van der Hilst"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.571",
    "academicYear" : "2016",
    "title" : "Seminar in Geophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Problems of current interest in geophysics; subject matter varying from term to term.",
    "instructors" : "Geophysics Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.581",
    "academicYear" : "2016",
    "title" : "Current Research in Geophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or fieldwork in geophysics. 12.580 is letter-graded.",
    "instructors" : "Geophysics Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.601",
    "academicYear" : "2016",
    "title" : "Essentials of Planetary Science",
    "cluster" : "(Subject meets with 12.420)",
    "prerequisites" : "8.03, 18.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Reviews fundamental physical concepts pertaining to the study of the solar system, and highlights recent spacecraft results. Topics include: meteorites, orbital dynamics, asteroids, impact craters, surfaces, atmospheres, atmospheric dynamics, interiors, magnetospheres, rings, comets, formation of the solar system.",
    "instructors" : "B. P. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.602",
    "academicYear" : "2016",
    "title" : "Asteroids and Small Bodies",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR), 18.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to the study of asteroids and the ground-based and space-based techniques used to explore them. Topics include asteroid orbital properties, surface structure, physical properties, classifications, as well as their origin, thermal and collisional evolution, and interrelationships with meteorites and comets. Also covers the near-Earth asteroids, the probabilities and consequences of terrestrial collisions, and the possible utilization of asteroids as space resources.",
    "instructors" : "R. P. Binzel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.603",
    "academicYear" : "2016",
    "title" : "Solar System Dynamics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Studies the dynamics of the solar system and its major subsystems, and the dynamics of exoplanets, with a modern emphasis on the qualitative structure of phase space. Topics may include rotational dynamics, spin-orbit coupling, Cassini states, and orbital dynamics, resonances, and Kozai oscillations, tidal evolution and tidal heating.",
    "instructors" : "J. Wisdom"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.620",
    "academicYear" : "2016",
    "title" : "Classical Mechanics: A Computational Approach",
    "cluster" : "(Same subject as 6.946J, 8.351J)",
    "prerequisites" : "Physics I (GIR), 18.03, permission of instructor",
    "units" : "3-3-6",
    "optional" : "Credit cannot also be received for 12.008",
    "description" : "Classical mechanics in a computational framework, Lagrangian formulation, action, variational principles, and Hamilton's principle. Conserved quantities, Hamiltonian formulation, surfaces of section, chaos, and Liouville's theorem. Poincar&eacute; integral invariants, Poincar&eacute;-Birkhoff and KAM theorems. Invariant curves and cantori. Nonlinear resonances, resonance overlap and transition to chaos. Symplectic integration. Adiabatic invariants. Applications to simple physical systems and solar system dynamics. Extensive use of computation to capture methods, for simulation, and for symbolic analysis. Programming experience required. Students taking the graduate version complete additional assignments.",
    "instructors" : "J. Wisdom, G. J. Sussman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.650",
    "academicYear" : "2016",
    "title" : "Current Topics in Planetary Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "In-depth discussion of current and classic literature on selected topics in planetary science. Topics vary from year to year.",
    "instructors" : "J. Wisdom"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.691",
    "academicYear" : "2016",
    "title" : "Current Research in Planetary Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or fieldwork in planetary science. 12.690 is letter-graded.",
    "instructors" : "Planetary Science Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.707",
    "academicYear" : "2016",
    "title" : "The History of Earth's Climate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Climate history of the Earth from the formation of the early atmosphere and ocean to the present. Evaluation of geochemical, sedimentological, and paleontological evidence for changes in ocean circulation, global temperatures, and atmospheric carbon dioxide levels. Theories and models of Phanerozoic climate change. Long-term history of the global carbon cycle.",
    "instructors" : "D. McGee"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.708",
    "academicYear" : "2016",
    "title" : "Advanced Seminar in Paleoclimatology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced seminar focusing on areas of current interest in paleoceanography and paleoclimatology. Includes discussion of current and classic literature. Topics vary from year to year.",
    "instructors" : "D. Oppo, J. Marchal, O. Marchal (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.710",
    "academicYear" : "2016",
    "title" : "Geological Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides a high level survey of a broad range of active science topics in Geological Oceanography.  Presents background material that graduate students are expected to know in the disciplines of solid-earth geophysics, geochemistry, sedimentology and stratigraphy, coastal processes, and climate, including a representative set of canonical science papers, and builds on this material to give a sense of the current state of the science in these fields.  Broad topics include the formation of the earth, petrogenesis, volcanism, plate tectonics, geodynamics, sedimentation in the oceans, coastal morphodynamics, paleo-oceanography, and climate.  The interconnectedness of and feedbacks between processes discussed under these various topics is emphasized.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.712",
    "academicYear" : "2016",
    "title" : "Advanced Marine Seismology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : "Can be repeated for credit",
    "description" : "Focuses on synthetic seismograms, ocean bottom refraction seismology, and multi-channel reflection seismology as applied to studies of the ocean sediments, crust, and lithosphere. Topics include: the wave equations for elastic/anelastic, isotropic/anisotropic, homogeneous/heterogeneous and fluid/solid media; ray theory and WKBJ approximations; the Sommerfeld/Weyl integrals, asymptotic analysis, and Lamb's problem for a fluid/solid interface; reflectivity and related methods; finite difference and finite element methods; and special topics of interest to the class. Extensive readings of geophysical and seismological literature.",
    "instructors" : "R. Stephen (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.021",
    "academicYear" : "2016",
    "title" : "Earth Science, Energy, and the Environment",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR), Calculus I (GIR), Chemistry (GIR)",
    "units" : "3-1-8",
    "optional" : null,
    "description" : "Provides understanding of the Earth System most relevant to production of our planet's natural energy resources, including the physics, chemistry, and biology of conventional and alternative energy sources. Includes a broad overview of traditional and alternative energy sources: hydrocarbons (conventional and unconventional), nuclear, geothermal, hydroelectric, and wind and tides, along with their potentials and limitations. Develops detailed knowledge of the formation, concentration, and production of fossil and nuclear fuels, as well as the waste products associated with their consumption. An examination of conventional and alternative energy sources includes the environmental issues associated with the exploitation of these resources, both regional and global.",
    "instructors" : "B. H. Hager"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.714",
    "academicYear" : "2016",
    "title" : "Computational Data Analysis",
    "cluster" : null,
    "prerequisites" : "18.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "An introduction to the theory and practice of analyzing discrete data such as are normally encountered in geophysics and geology. Emphasizes statistical aspects of data interpretation and the nonparametric discrete-time approach to spectral analysis. Topics include: elements of probability and statistics, statistical inference, robust and nonparametric statistics, the method of least squares, univariate and multivariate spectral analysis, digital filters, and aspects of multidimensional data analysis.",
    "instructors" : "A. D. Chave, T. A. Herring"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.716",
    "academicYear" : "2016",
    "title" : "Igneous Processes at Oceanic Margins",
    "cluster" : null,
    "prerequisites" : "12.710 or permission of instructor",
    "units" : "3-2-4",
    "optional" : "Can be repeated for credit",
    "description" : "Quantitative analysis of melting, melt transport, and igneous crustal accretion at oceanic spreading centers, rifted continental margins, and subduction-related arcs, applied to understanding variation in composition and volume of the Earth's crust in different tectonic environments. Theoretical methods for calculation of melt volume and composition, solid-liquid equilibria and reaction rates, and liquid density and viscosity combined with field, petrographic, geochemical, and computational techniques. Topics vary from year to year.",
    "instructors" : "H. Dick, G. Gaetani  (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.721",
    "academicYear" : "2016",
    "title" : "Current Research in Marine Geology and Geophysics at Woods Hole",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or fieldwork in marine geology and geophysics.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.722",
    "academicYear" : "2016",
    "title" : "Current Research in Chemical Oceanography at Woods Hole",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or fieldwork in chemical oceanography.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.731",
    "academicYear" : "2016",
    "title" : "Current Research in Marine Geology and Geophysics at MIT",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or fieldwork in marine geology and geophysics under the supervision of a faculty member in residence at MIT. For students in the MIT/WHOI Joint Program. 12.730 is letter-graded.",
    "instructors" : "Marine Geology and Geophysics Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.736",
    "academicYear" : "2016",
    "title" : "Current Research in Chemical Oceanography at MIT",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or fieldwork in chemical oceanography under the supervision of a faculty member in residence at MIT. For students in the MIT/WHOI Joint Program. 12.735 is letter-graded.",
    "instructors" : "Chemical Oceanography Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.740",
    "academicYear" : "2016",
    "title" : "Paleoceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Studies the basic principles of techniques for reconstructing the history of ocean climate from marine sediment cores, corals, ice cores, and other paleoclimate archives. Examines this data in the light of proposed climate change mechanisms. Micropaleontological, isotopic, geochemical, and mineralogical changes are used to infer changes in seawater composition, atmospheric chemistry, and climate. Observations are interpreted as consequences of changes in ocean temperature, circulation, and chemistry, and are used to evaluate theories proposed to account for glacial/interglacial cycles. Focuses on the past two million years, but major processes and events from the past 100 million years are also included.",
    "instructors" : "E. A. Boyle"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.742",
    "academicYear" : "2016",
    "title" : "Marine Chemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "An introduction to chemical oceanography. Reservoir models and residence time. Major ion composition of seawater. Inputs to and outputs from the ocean via rivers, the atmosphere, and the sea floor. Biogeochemical cycling within the oceanic water column and sediments, emphasizing the roles played by the formation, transport, and alteration of oceanic particles and the effects that these processes have on seawater composition. Cycles of carbon, nitrogen, phosphorus, oxygen, and sulfur.  Uptake of anthropogenic carbon dioxide by the ocean. Material presented through lectures and student-led presentation and discussion of recent papers.",
    "instructors" : "B. Van Mooy (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.743",
    "academicYear" : "2016",
    "title" : "Geochemistry of Marine Sediments",
    "cluster" : null,
    "prerequisites" : "Chemistry (GIR), 5.60",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on processes that control the composition of sediments in coastal, shelf, and deep-sea environments and processes that define their roles in biogeochemical cycles. Topics include calculating chemical fluxes across the sediment-water interface; evaluating the sources and reactivity of carbonate, silicic, and detrital sediments; using pore water gradients to calculate diffusion, reaction, and flux rates; sediment dating; estimating accumulation rates; and using stable isotopes and natural-series radioisotopes. Covers evaluation of the links between sedimentary and water column processes; the effects of anthropogenic disturbances (e.g., eutrophication, acidification, warming) on sedimentary processes; and the role of sediments in global biogeochemical cycles. Introduces sampling techniques and mathematical modeling of sedimentary processes.",
    "instructors" : "D. McCorkle, W. Martin, A. Spivak (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.744",
    "academicYear" : "2016",
    "title" : "Marine Isotope Chemistry",
    "cluster" : null,
    "prerequisites" : "Permission of the instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Fundamentals of using isotopes to study processes and timescales for marine chemistry and geochemistry. Starts with a basic introduction to the nature, origins, and reasons for the distributions of isotopes in nature, then develops theory and approaches for radioactive dating methods. These are used to constrain the timing and nature of the geochemical evolution of the elements, solar system, earth, ocean and atmosphere. Cosmogenic isotopes and their applications are covered. Basics of mass spectrometry are briefly discussed, and then the principles and applications of isotope fractionation are more thoroughly dealt with. Introduction to mass independent fractionation and clumped isotope methods. Explores applications of isotope methods to a number of water column processes, including particle scavenging, sedimentation, long term element budgets, redox processes, and air-sea exchange. Emphasis will be on quantitative methods and problem-solving, and there will be four problem sessions with development of problem solutions.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.746",
    "academicYear" : "2016",
    "title" : "Marine Organic Geochemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Provides an understanding of the distribution of organic carbon (OC) in marine sediments from a global and molecular-level perspective. Surveys the mineralization and preservation of OC in the water column and within anoxic and oxic marine sediments. Topics include: OC composition, reactivity and budgets within, and fluxes through, major reservoirs; microbial recycling pathways for OC; models for OC degradation and preservation; role of anoxia in OC burial; relationships between dissolved and particulate (sinking and suspended) OC; methods for characterization of sedimentary organic matter; application of biological markers as tools in oceanography. Both structural and isotopic aspects are covered.",
    "instructors" : "D. Repeta, T. I. Eglinton (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.747",
    "academicYear" : "2016",
    "title" : "Modeling, Data Analysis, and Numerical Techniques for Geochemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Emphasizes the basic skills needed for handling and assimilating data as well as the basic tool-set for numerical modeling. Uses MATLAB as its computation engine; begins with an introduction to MATLAB to ensure familiarity with software. Topics include: probability distributions, error propagation, least squares and regression techniques, principle component and factor analysis, objective mapping, Fourier and spectral analysis, numerical solutions to ODEs and PDEs, finite difference techniques, inverse models, and scientific visualization.",
    "instructors" : "D. Glover, W. Jenkins, S. Doney  (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.759",
    "academicYear" : "2016",
    "title" : "Seminar in Oceanography at Woods Hole",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Topics in marine geology and geophysics, physical, dynamical, and chemical oceanography. Content varies from term to term. 12.754, 12.755, and 12.756 are letter-graded.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.761",
    "academicYear" : "2016",
    "title" : "Seminar in Marine Geology and Geophysics at MIT",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Topics in marine geology and geophysics taught at MIT. Content varies from term to term. 12.760 is letter-graded.",
    "instructors" : "Marine Geology and Geophysics Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.771",
    "academicYear" : "2016",
    "title" : "Seminar in Chemical Oceanography at MIT",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Topics in chemical oceanography taught at MIT. Content varies from term to term. 12.770 is letter-graded.",
    "instructors" : "Chemical Oceanography Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.800",
    "academicYear" : "2016",
    "title" : "Fluid Dynamics of the Atmosphere and Ocean",
    "cluster" : null,
    "prerequisites" : "8.03, 18.04",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to fluid dynamics. Students acquire an understanding of some of the basic concepts of fluid dynamics that are needed as a foundation for advanced courses in atmospheric science, physical oceanography, ocean engineering, climate science, etc. Emphasizes fluid fundamentals, with an atmosphere/ocean twist.",
    "instructors" : "J. Marshall"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.801",
    "academicYear" : "2016",
    "title" : "Large-scale Ocean Dynamics",
    "cluster" : null,
    "prerequisites" : "12.800",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Applies fundamental principles of geophysical fluid dynamics to understand the general patterns of the ocean circulation and stratification. Includes the mid-latitude wind-driven circulation, the Southern Ocean circulation, and the global overturning circulation. Uses a combination of theory, numerical simulations, and observations to illustrate the concepts.",
    "instructors" : "R. Ferrari"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.802",
    "academicYear" : "2016",
    "title" : "Small-scale Ocean Dynamics",
    "cluster" : null,
    "prerequisites" : "12.800",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Basic ideas of geophysical wave motion in rotating, stratified, and rotating-stratified fluids. Subject begins with general wave concepts of phase and group velocity. The dynamics and kinematics of gravity waves with a focus on dispersion, energy flux, initial value problems, etc. Subject foundation used to study internal and inertial waves, Kelvin, Poincare, and Rossby waves in homogeneous and stratified fluids. Laplace tidal equations are applied to equatorial waves. Other topics include: resonant interactions, potential vorticity, wave-mean flow interactions, and instability.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.805",
    "academicYear" : "2016",
    "title" : "Data Analysis in Physical Oceanography",
    "cluster" : null,
    "prerequisites" : "12.808",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Introduction to standard data analysis methods, including time series analysis, objective mapping, and empirical orthogonal functions. Focuses on working with data in a computer laboratory setting. Emphasizes how statistical information can be used to improve experimental design. Some attention given to the instruments and algorithms used to acquire the data.",
    "instructors" : "G. Gebbie"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.806",
    "academicYear" : "2016",
    "title" : "Atmospheric Physics and Chemistry",
    "cluster" : "(Same subject as 10.571J)\n(Subject meets with 12.306)",
    "prerequisites" : "5.60 or 5.61; 18.075; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to the physics and chemistry of the atmosphere including experience with computer codes. Aerosols and theories of their formation, evolution, and removal. Gas and aerosol transport from urban to continental scales. Coupled models of radiation, transport, and chemistry. Solution of inverse problems to deduce emissions and removal rates. Emissions control technology and costs. Applications to air pollution and climate.",
    "instructors" : "R. G. Prinn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.808",
    "academicYear" : "2016",
    "title" : "Introduction to Observational Physical Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Results and techniques of observations of the ocean in the context of its physical properties and dynamical constraints. Emphasis on large-scale steady circulation and the time-dependent processes that contribute to it. Includes the physical setting of the ocean, atmospheric forcing, application of conservation laws, description of wind-driven and thermohaline circulation, eddy processes, and interpretive techniques.",
    "instructors" : "M. Andres, G. Gebbie  (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.809",
    "academicYear" : "2016",
    "title" : "Hydraulic Phenomena in Geophysical Fluid Flows",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Examination of the hydraulics of nonrotating flows (Long's experiments, hydraulic control, upstream influence, nonlinear wave steepening, hydraulic jump and bores, application to severe downslope winds). Other topics may include: nonrotating stratified flows (two-layer hydraulics, virtual and approach controls, maximal and submaximal flow, application to the Strait of Gibraltar and the Bab al Mandab); and deep ocean straits and sills (steady theories for rotating channel flow, nonlinear Kelvin and frontal waves, rotating hydraulic jumps, geostrophic adjustment in a rotating channel, and applications to the Denmark Strait and other deep passages).",
    "instructors" : "L. Pratt, K. Helfrich  (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.810",
    "academicYear" : "2016",
    "title" : "Dynamics of the Atmosphere",
    "cluster" : null,
    "prerequisites" : "12.800",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Discusses the dynamics of the atmosphere, with emphasis on the large scale. Topics include zonally symmetric circulations and the tropical Hadley circulation; internal gravity waves; balanced flows, potential vorticity conservation and Rossby waves; stability of zonal flows; baroclinic instability and extratropical storms; tropical waves, the Walker circulation, and El Ni&ntilde;o and the Southern Oscillation; and the role of eddies in the general circulation. Students taking graduate version complete different assignments.",
    "instructors" : "P. O'Gorman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.811",
    "academicYear" : "2016",
    "title" : "Tropical Meteorology",
    "cluster" : null,
    "prerequisites" : "12.810 or <I>Coreq: 12.843</I>",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A description of the large-scale circulation systems of the tropical atmosphere and analysis of the dynamics of such systems. Topics include: Radiative-convective equilibrium; the Hadley and walker circulation; monsoons; tropical boundary layers; theory of the response of the tropical atmosphere to localized sea-surface temperature anomalies; intraseasonal oscillations; equatorial waves; El Ni&ntilde;o/Southern Oscillation; easterly waves; and tropical cyclones.",
    "instructors" : "K. A. Emanuel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.812",
    "academicYear" : "2016",
    "title" : "The General Circulation of the Atmosphere and Climate Change",
    "cluster" : null,
    "prerequisites" : "12.843 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explains the main features of the general circulation of the Earth's atmosphere. Final part of the course explores possible changes in the general circulation associated with climate change.",
    "instructors" : "P. O'Gorman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.815",
    "academicYear" : "2016",
    "title" : "Atmospheric Radiation and Convection",
    "cluster" : null,
    "prerequisites" : "5.61, 12.800, 18.075, or permission of instructor",
    "units" : "5-2-5",
    "optional" : null,
    "description" : "Introduction to the physics of atmospheric radiation, remote sensing, and convection, including use of computer codes. Radiative transfer equation including emission and scattering, spectroscopy, Mie theory, and numerical solutions. Physics of dry and moist convection, including moist thermodynamics. Radiative-convective equilibrium. Solution of inverse problems in remote sensing of atmospheric temperature and composition.",
    "instructors" : "S. Seager, K. Emanuel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.818",
    "academicYear" : "2016",
    "title" : "Introduction to Atmospheric Data and Synoptic Meteorology",
    "cluster" : null,
    "prerequisites" : "None. <I>Coreq: 12.800</I>",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Provides a general introduction to meteorological data and analysis techniques, and their use in the MIT Synoptic Laboratory to study the phenomenology and dynamics of large-scale atmospheric flow. Balance concepts as applied to the dynamics of frontal and synoptic scales are illustrated using real-time upper air and surface station data and gridded analyzed fields. Advanced meteorological software packages are used to access, manipulate, and graphically display the data.",
    "instructors" : "L. Illari"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.820",
    "academicYear" : "2016",
    "title" : "Turbulence in the Ocean and Atmosphere",
    "cluster" : null,
    "prerequisites" : "12.843",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers phenomena, theory and modeling of turbulence in the Earth's oceans and atmosphere. The scope will range from centimeter- to planetary-scale motions. Includes homogeneous isotropic three- and two-dimensional turbulence, convection, stratified turbulence, quasi-gesotrophic turbulence, baroclinic turbulence, and macroturbulence in the ocean and atmosphere.",
    "instructors" : "R. Ferrari, G. Flierl"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.830",
    "academicYear" : "2016",
    "title" : "Topics in Waves and Instability",
    "cluster" : null,
    "prerequisites" : "12.843",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A detailed presentation of selected advanced topics in waves and instability in the atmosphere. The precise selection varies from year to year. Topics have included wave-mean flow interaction, the quasi-biennial oscillation, sudden warmings, critical-level behavior, wave overreflection, nonlinear equilibration, wave breaking, tropical waves, and stationary waves.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.842",
    "academicYear" : "2016",
    "title" : "Climate Physics and Chemistry",
    "cluster" : "(Subject meets with 12.301)",
    "prerequisites" : "Chemistry (GIR), 18.03, or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to climate studies, including beginnings of the solar system, time scales, and climate in human history; methods for detecting climate change, including proxies, ice cores, instrumental records, and time series analysis; physical and chemical processes in climate, including primordial atmosphere, ozone chemistry, carbon and oxygen cycles, and heat and water budgets; internal feedback mechanisms, including ice, aerosols, water vapor, clouds, and ocean circulation; climate forcing, including orbital variations, volcanism, plate tectonics, and solar variability; climate models and mechanisms of variability, including energy balance, coupled models, and global ocean and atmosphere models; and outstanding problems. Students taking the graduate version complete different assignments.",
    "instructors" : "K. Emanuel, E. Boyle, D. McGee"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.848",
    "academicYear" : "2016",
    "title" : "Global Climate Change: Economics, Science, and Policy",
    "cluster" : "(Same subject as 15.023J, ESD.128J)\n(Subject meets with 12.348J, 15.026J)",
    "prerequisites" : "Calculus II (GIR); 5.60; 14.01 or 15.010; or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 15.023J.",
    "instructors" : "R. G. Prinn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.862",
    "academicYear" : "2016",
    "title" : "Coastal Physical Oceanography",
    "cluster" : null,
    "prerequisites" : "12.800",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to the dynamics of flow over the continental shelf, nearshore, and estuaries, emphasizing both theory and observations.  Content varies somewhat according to student and staff interests. Possible topics include fronts, buoyant plumes, surface and bottom boundary layers, wind-driven upwelling, coastal-trapped waves, internal waves, quasi-steady flows, high-latitude shelf processes, tides, and shelf-open ocean interactions.",
    "instructors" : "R. Todd, D. Clark (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.863",
    "academicYear" : "2016",
    "title" : "Advanced Topics in Coastal Physical Oceanography",
    "cluster" : null,
    "prerequisites" : "12.862 or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "More specialized topics in the dynamics of flow over the continental shelf, including coastal-trapped waves, wind-driving, and mean flows. Emphasis on the relationship between theory and observations. Instrumentation and the application of statistical techniques also covered.",
    "instructors" : "Woods Hole Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.866",
    "academicYear" : "2016",
    "title" : "Theory of the General Circulation of the Ocean",
    "cluster" : null,
    "prerequisites" : "12.800, 12.801, 12.802",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "A review of wind-driven circulation, and the development of the baroclinic theory of the wind-driven circulation. Potential vorticity homohenization and the ventilated thermocline. Wind-driven circulation with continuous stratification, subduction/obduction. Equatorial thermocline and its relation to ENSO. Decadal climate variability. Thermohaline circulation and variability. Abyssal circulation. Mixing and energetics of the oceanic general circulation.",
    "instructors" : "R. X. Huang (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.870",
    "academicYear" : "2016",
    "title" : "Air-Sea Interaction: Boundary Layers",
    "cluster" : null,
    "prerequisites" : "Graduate-level fluid mechanics and a subject on waves, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Addresses the interaction of the atmosphere and ocean on temporal scales from seconds to days and spatial scales from centimeters to kilometers.  Topics include the generation, propagation, and decay of surface waves; the processes by which mass, heat, momentum, and energy are transported vertically within the coupled atmospheric and oceanic boundary layers and across the air-sea interface; and the statistical tools, mathematical models, and observational methods that are used to quantify these processes.",
    "instructors" : "J. Trowbridge, E. Terray (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.951",
    "academicYear" : "2016",
    "title" : "Seminar in Physical Oceanography at MIT",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Topics in physical and dynamical oceanography. Content varying from term to term. 12.950 is letter-graded.",
    "instructors" : "Physical Oceanography Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.961",
    "academicYear" : "2016",
    "title" : "Current Research in Physical Oceanography at MIT",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or fieldwork in oceanography. 12.960 is letter-graded.",
    "instructors" : "Physical Oceanography Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.971",
    "academicYear" : "2016",
    "title" : "Current Research in Physical Oceanography at Woods Hole",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or field work on oceanographic problems. 12.970 is letter-graded.",
    "instructors" : "Woods Hole Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.981",
    "academicYear" : "2016",
    "title" : "Current Research in Atmospheric Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations on problems in atmospheric science. 12.980 is letter-graded.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.348",
    "academicYear" : "2016",
    "title" : "Global Climate Change: Economics, Science, and Policy",
    "cluster" : "(Same subject as 15.026J)\n(Subject meets with 12.848J, 15.023J, ESD.128J)",
    "prerequisites" : "Calculus II (GIR); 5.60; 14.01 or 15.010; or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 15.026J.",
    "instructors" : "R. G. Prinn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.UR",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.URG",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Undergraduate research opportunities in Earth, Atmospheric, and Planetary Sciences.",
    "instructors" : "Consult Department UROP Coordinator"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.TIP",
    "academicYear" : "2016",
    "title" : "Thesis Preparation",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Definition of and early-stage work on the thesis project. Students develop a written research proposal and begin writing the supporting text of the thesis concurrent with conducting research for the thesis project. Supervision of the writing continues into the spring term which concludes with an oral presentation of the research results.",
    "instructors" : "J. Connor"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.IND",
    "academicYear" : "2016",
    "title" : "Independent Study",
    "cluster" : null,
    "prerequisites" : "12.TIP",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Independent reading, laboratory, or fieldwork in Earth, Atmospheric, and Planetary Sciences. To be arranged by student and an appropriate EAPS faculty member. A written report may be required at the discretion of the advisor. Units arranged should reflect the project requirements.",
    "instructors" : "Consult EAPS Education Office"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.THU",
    "academicYear" : "2016",
    "title" : "Undergraduate Thesis",
    "cluster" : null,
    "prerequisites" : "12.TIP",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of a thesis; to be arranged by the student and an appropriate MIT faculty member.",
    "instructors" : "EAPS Faculty"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.000",
    "academicYear" : "2016",
    "title" : "Solving Complex Problems",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-2-6",
    "optional" : null,
    "description" : "Provides an opportunity for entering freshmen to gain firsthand experience in integrating the work of small teams to develop effective solutions to complex problems in Earth system science and engineering. Each year's class explores a different problem in detail through the study of complementary case histories and the development of creative solution strategies. Includes exercises in website development, written and oral communication, and team building. Subject required for students in the Terrascope freshman program, but participation in Terrascope is not required of all 12.000 students. Students who pass 12.000 are eligible to participate in the Terrascope field trip the following spring. Limited to freshmen.",
    "instructors" : "S. Bowring"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.001",
    "academicYear" : "2016",
    "title" : "Introduction to Geology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-4-5 REST",
    "optional" : null,
    "description" : "Major minerals and rock types, rock-forming processes, and time scales. Temperatures, pressures, compositions, structure of the Earth, and measurement techniques. Geologic structures and relationships observable in the field. Sediment movement and landform development by moving water, wind, and ice. Crustal processes and planetary evolution in terms of global plate tectonics with an emphasis on ductile and brittle processes. Includes laboratory exercises on minerals, rocks, mapping, plate tectonics, rheology, glaciers. Two one-day field trips (optional).",
    "instructors" : "O. Jagoutz, T. Perron"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.002",
    "academicYear" : "2016",
    "title" : "Introduction to Geophysics and Planetary Science",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR), Calculus II (GIR)",
    "units" : "3-1-8 REST",
    "optional" : null,
    "description" : "Study of the structure, composition, and physical processes governing the terrestrial planets, including their formation and basic orbital properties. Topics include plate tectonics, earthquakes, seismic waves, rheology, impact cratering, gravity and magnetic fields, heat flux, thermal structure, mantle convection, deep interiors, planetary magnetism, and core dynamics. Suitable for majors and non-majors seeking general background in geophysics and planetary structure.",
    "instructors" : "L. H. Royden, B. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.003",
    "academicYear" : "2016",
    "title" : "Introduction to Atmosphere, Ocean, and Climate Dynamics",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR), Physics I (GIR)",
    "units" : "3-1-8 REST",
    "optional" : null,
    "description" : "The laws of classical mechanics and thermodynamics are used to explore how the properties of fluids on a rotating Earth manifest themselves in, and help shape, the global patterns of atmospheric winds, ocean currents, and the climate of the Earth. Theoretical discussion focuses on the physical processes involved. Underlying mechanisms are illustrated through laboratory demonstrations, using a rotating table, and through analysis of atmospheric and oceanic data.",
    "instructors" : "J. Marshall"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.005",
    "academicYear" : "2016",
    "title" : "Applications of Continuum Mechanics to Earth, Atmospheric, and Planetary Sciences",
    "cluster" : null,
    "prerequisites" : "Physics II (GIR), Calculus II (GIR); <I>Coreq: 18.03</I>",
    "units" : "3-2-7",
    "optional" : null,
    "description" : "Practical applications of the continuum concept for deformation of solids and fluids, emphasizing force balance. Stress tensor, infinitesimal and finite strain, and rotation tensors are developed. Constitutive relations applicable to geological materials, including elastic, viscous, brittle, and plastic deformation. Laboratory component provides specific examples of elastic and inelastic mechanical behavior of rocks and illustrates several methods of measurement in the laboratory.",
    "instructors" : "B. Hager, B. Evans"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.006",
    "academicYear" : "2016",
    "title" : "Nonlinear Dynamics: Chaos",
    "cluster" : "(Same subject as 2.050J, 18.353J)",
    "prerequisites" : "18.03 or 18.034; Physics II (GIR)",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to nonlinear dynamics and chaos in dissipative systems. Forced and parametric oscillators. Phase space. Periodic, quasiperiodic, and aperiodic flows. Sensitivity to initial conditions and strange attractors. Lorenz attractor. Period doubling, intermittency, and quasiperiodicity. Scaling and universality. Analysis of experimental data: Fourier transforms, Poincare sections, fractal dimension, and Lyapunov exponents. Applications to mechanical systems, fluid dynamics, physics, geophysics, and chemistry. See 12.207J/18.354J for Nonlinear Dynamics: Continuum Systems.",
    "instructors" : "P-T. Brun"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.007",
    "academicYear" : "2016",
    "title" : "Geobiology: History of Life on Earth",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Surveys the interactive Earth system: biology in geologic, environmental and climate change throughout Earth's history. Introduces the concept of \"life as a geological agent\" and examines the interaction between biology and the Earth system during the roughly 4 billion years since life first appeared. Topics include the origin of the solar system and the early Earth atmosphere; the origin and evolution of life and its influence on climate up through and including the modern age and the problem of global warming; the global carbon cycle; and astrobiology.",
    "instructors" : "T. Bosak, G. Fournier"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.008",
    "academicYear" : "2016",
    "title" : "Classical Mechanics: A Computational Approach",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR), 18.03, permission of instructor",
    "units" : "3-3-6",
    "optional" : "Credit cannot also be received for 6.946, 8.351, 12.620",
    "description" : "Classical mechanics in a computational framework, Lagrangian formulation, action, variational principles, and Hamilton's principle. Conserved quantities, Hamiltonian formulation, surfaces of section, chaos, and Liouville's theorem. Poincar&eacute; integral invariants, Poincar&eacute;-Birkhoff and KAM theorems. Invariant curves and cantori. Nonlinear resonances, resonance overlap and transition to chaos. Symplectic integration. Adiabatic invariants. Applications to simple physical systems and solar system dynamics. Extensive use of computation to capture methods, for simulation, and for symbolic analysis. Programming experience required. Students taking the graduate version complete additional assignments.",
    "instructors" : "J. Wisdom, G. J. Sussman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.090",
    "academicYear" : "2016",
    "title" : "Current Topics in Earth, Atmospheric, and Planetary Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.091",
    "academicYear" : "2016",
    "title" : "Current Topics in Earth, Atmospheric, and Planetary Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory or field work in earth, atmospheric, and planetary sciences. Consult with department Education Office.",
    "instructors" : "EAPS Faculty"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.092",
    "academicYear" : "2016",
    "title" : "Current Topics in Geology and Geochemistry",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.093",
    "academicYear" : "2016",
    "title" : "Current Topics in Geology and Geochemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory or field work in geology and geochemistry. To be arranged with department faculty. Consult with department Education Office.",
    "instructors" : "EAPS Faculty"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.094",
    "academicYear" : "2016",
    "title" : "Current Topics in Geophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.095",
    "academicYear" : "2016",
    "title" : "Current Topics in Geophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory or field work in geophysics. To be arranged with department faculty. Consult with department Education Office.",
    "instructors" : "EAPS Faculty"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.096",
    "academicYear" : "2016",
    "title" : "Current Topics in Atmospheric Science and Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.097",
    "academicYear" : "2016",
    "title" : "Current Topics in Atmospheric Science and Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory or field work in atmospheric science and oceanography. To be arranged with department faculty. Consult with department Education Office.",
    "instructors" : "EAPS Faculty"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.098",
    "academicYear" : "2016",
    "title" : "Current Topics in Planetary Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory or field work in planetary science. To be arranged with department faculty. Consult with department Education Office.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.099",
    "academicYear" : "2016",
    "title" : "Current Topics in Planetary Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Laboratory or field work in planetary science. To be arranged with department faculty. Consult with department Education Office.",
    "instructors" : "EAPS Faculty"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.102",
    "academicYear" : "2016",
    "title" : "Environmental Earth Science",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9 REST",
    "optional" : null,
    "description" : "The geologic record demonstrates that our environment has changed over a variety of time scales from seconds to billions of years. Explores the many ways in which geologic processes control and modify the Earth's environment. Topics include chemical and physical interactions between the solid Earth, its oceans and atmosphere; the effect of catastrophic events such as volcanic eruptions and earthquakes on the environment; geologic hazards; and our role in modifying the environment through Earth resource development. Serves as an introduction to 12.120, which addresses field applications of these principles in the American Southwest.",
    "instructors" : "S. A. Bowring"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.104",
    "academicYear" : "2016",
    "title" : "Geochemistry of the Earth and Planets",
    "cluster" : null,
    "prerequisites" : "Calculus II (GIR)",
    "units" : "3-2-7",
    "optional" : null,
    "description" : "Focuses on low-temperature geochemistry and the Earth's biogeochemical cycles, including the biologic and inorganic chemical processes that create chemical variability and element partitioning among lithosphere, hydrosphere and atmosphere. Covers basic thermodynamics, aqueous chemistry, major and trace element geochemistry, and stable isotopic geochemistry.",
    "instructors" : "S. Ono, D. McGee"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.108",
    "academicYear" : "2016",
    "title" : "Structure of Earth Materials",
    "cluster" : null,
    "prerequisites" : "Chemistry (GIR)",
    "units" : "3-4-5",
    "optional" : null,
    "description" : "Provides a comprehensive introduction to crystalline structure, crystal chemistry, and bonding in rock-forming minerals. Introduces the theory relating crystal structure and crystal symmetry to physical properties such as refractive index, elastic modulus, and seismic velocity. Surveys the distribution of silicate, oxide, and metallic minerals in the interiors and on the surfaces of planets, and discusses the processes that led to their formation.",
    "instructors" : "T. L. Grove"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.109",
    "academicYear" : "2016",
    "title" : "Petrology",
    "cluster" : null,
    "prerequisites" : "12.108",
    "units" : "3-6-6",
    "optional" : null,
    "description" : "Surveys the distribution, chemical composition, and mineral associations in rocks of the Earth's crust and upper mantle, and establishes its relation to tectonic environment. Emphasis is on the use of chemistry and physics to interpret rock forming processes. Topics include dynamics of crust and mantle melting as preserved in the chemical composition of igneous rocks and minerals, the long-term record of global climate change as preserved in the minerals of sedimentary rocks, and the time-temperature-depth record preserved in minerals of metamorphosed crustal rocks.",
    "instructors" : "T. L. Grove"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.113",
    "academicYear" : "2016",
    "title" : "Structural Geology",
    "cluster" : null,
    "prerequisites" : "12.001",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Introduces mechanics of rock deformation. Discusses recognition, interpretation, and mechanics of faults, folds, structural features of igneous and metamorphic rocks, and superposed deformations. Introduces regional structural geology and tectonics. Laboratory includes techniques of structural analysis, recognition and interpretation of structures on geologic maps, and construction of interpretive cross sections.",
    "instructors" : "B. C. Burchfiel and O. Jagoutz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.114",
    "academicYear" : "2016",
    "title" : "Field Geology I",
    "cluster" : null,
    "prerequisites" : "12.108 or permission of instructor; or <I>Coreq: 12.113</I>",
    "units" : "2-2-2 [P/D/F]",
    "optional" : null,
    "description" : "Introduces techniques of geological field study. Weather permitting, several weekend field exercises provide practical experience in preparation for 12.115. Presents introductory material on the regional geology of the locale of 12.115.",
    "instructors" : "B. C. Burchfiel, O. Jagoutz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.115",
    "academicYear" : "2016",
    "title" : "Field Geology II",
    "cluster" : null,
    "prerequisites" : "12.113, 12.114",
    "units" : "0-12-0 Institute LAB",
    "optional" : null,
    "description" : "During January, students practice methods of modern geological field study off-campus during an intensive four-week experience. Exercises include geological and geomorphological mapping on topographic and photographic base maps of a wide variety of bedrock and surficial rocks. Where feasible, geochemical and geophysical field measurements are corrrelated with geology.",
    "instructors" : "B. C. Burchfiel, O. Jagoutz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.119",
    "academicYear" : "2016",
    "title" : "Analytical Techniques for Studying Environmental and Geologic Samples",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-6-4 Institute LAB",
    "optional" : null,
    "description" : "Focuses on analytical facilities that are used to determine elemental and isotopic abundances in soils, rocks, minerals, and fluids. Emphasis is on isotopic ratios Sr, Nd, and Pb, whose isotopic ratios can be used for geochronology, and abundances of trace elements such as Rb, Sr, Cu, Cd, Hg, rare-earths, Pb, Th, and U. Analytical techniques include mass spectrometry, emission spectrometry, atomic absorption, neutron activation, and electron microprobe. A major lab project utilizes these techniques to address specific environmental and geologic problems.",
    "instructors" : "E. Boyle, T. Grove"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.120",
    "academicYear" : "2016",
    "title" : "Environmental Earth Science Field Course",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "1-5-0",
    "optional" : null,
    "description" : "Field study to foster understanding of natural hazards and human influence on the environment. Class conducted in the western United States, at locations such as Death Valley and the White Mountain Research Station in Bishop California. Topics include water use and availability, climate change, earthquakes and faulting, and landslides. Also examines volcanic hazards and geothermal power, effects of river diversion, and the geology of the Yucca  Mountain facility for the storage of radioactive waste. Students partially responsible for travel expenses. Designed to follow 12.001 or 12.102; other students will be accepted when space is available.",
    "instructors" : "T. L. Grove"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.141",
    "academicYear" : "2016",
    "title" : "Electron Microprobe Analysis",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-1-4 [P/D/F]",
    "optional" : null,
    "description" : "Introduction to the theory of x-ray microanalysis through the electron microprobe including ZAF matrix corrections. Techniques to be discussed are wavelength and energy dispersive spectrometry, scanning backscattered electron, secondary electron, cathodoluminescence, and x-ray imaging. Lab sessions involve use of the electron microprobe.",
    "instructors" : "N. Chatterjee"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.163",
    "academicYear" : "2016",
    "title" : "Geomorphology",
    "cluster" : "(Subject meets with 12.463)",
    "prerequisites" : "12.001, Physics I (GIR), Calculus I (GIR); or permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Quantitative examination of processes that shape Earth's surface. Introduction to fluvial, hillslope, and glacial mechanics. Essentials of weathering, soil formation, runoff, erosion, slope stability, sediment transport, and river morphology. Landscape evolution in response to climatic and tectonic forcing. Application of terrestrial theory to planetary surfaces. Additional instruction in geographic information systems (GIS) and remote sensing analysis, field measurement techniques, and numerical modeling of surface processes. Students taking the graduate version complete different assignments.",
    "instructors" : "T. Perron"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.201",
    "academicYear" : "2016",
    "title" : "Essentials of Global Geophysics",
    "cluster" : "(Subject meets with 12.501)",
    "prerequisites" : "Physics II (GIR), 18.03",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Overview of basic topics in solid-earth geophysics, such as the Earth's rotation, gravity and magnetic field, seismology, and thermal structure. Formulation of physical principles presented in three one-hour lectures per week. Current applications discussed in an additional one-hour tutorial each week. Students taking graduate version complete different assignments.",
    "instructors" : "R. van der Hilst"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.207",
    "academicYear" : "2016",
    "title" : "Nonlinear Dynamics: Continuum Systems",
    "cluster" : "(Same subject as 1.062J, 18.354J)\n(Subject meets with 18.3541)",
    "prerequisites" : "18.03 or 18.034; Physics II (GIR)",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 18.354J.",
    "instructors" : "L. Bourouiba"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.213",
    "academicYear" : "2016",
    "title" : "Alternate Energy Sources",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "1-4-1 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Explores a number of alternative energy sources such as geothermal energy (heat from the Earth's interior), wind, natural gas, and solar energy. Includes a field trip to visit sites where alternative energy is being harvested or generated. Content and focus of subject varies from year to year.",
    "instructors" : "F. D. Morgan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.214",
    "academicYear" : "2016",
    "title" : "Essentials of Applied Geophysics",
    "cluster" : "(Subject meets with 12.507)",
    "prerequisites" : "18.03",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "Introduces the application of geophysical methods to all aspects of near-surface environmental and engineering geophysics, including the exploration for petroleum, water, and minerals. Topics include seismic, electrical, electromagnetic, ground penetrating radar, magnetics, gravity, rock physics and chemistry, borehole geophysics and the global positioning system (GPS). Uses a quantitative approach to emphasize basic principles and a physical /chemical understanding of each method. Discusses specific illustrative field examples. Lab work is mainly devoted to local field work and equipment preparation for the IAP Field Geophysics class. Students taking graduate version complete additional assignments.",
    "instructors" : "F. D. Morgan, T. A. Herring, B. H. Hager"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.221",
    "academicYear" : "2016",
    "title" : "Field Geophysics",
    "cluster" : "(Subject meets with 12.511)",
    "prerequisites" : "12.214",
    "units" : "1-4-1 [P/D/F]",
    "optional" : null,
    "description" : "Covers practical methods of modern geophysics, including the global positioning system (GPS), gravity, and magnetics. Field work is conducted in western US and includes intensive 10-day field exercise. Focuses on measurement techniques and their interpretation. Introduces the science of gravity, magnetics, and the GPS. Measures crustal structure, fault motions, tectonic deformations, and the local gravity and magnetic fields. Students perform high-precision measurements and participate in data analysis. Emphasizes principles of geophysical data collection and the relevance of these data for tectonic faulting, crustal structure, and the dynamics of the earthquake cycle. Students taking graduate version complete additional assignments.",
    "instructors" : "T. A. Herring, B. H. Hager, F. D. Morgan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.222",
    "academicYear" : "2016",
    "title" : "Field Geophysics Analysis",
    "cluster" : "(Subject meets with 12.512)",
    "prerequisites" : "12.221",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Focuses on in-depth data analysis and development of skills needed to report results both in writing and orally. Students use data collected in 12.221 to develop written and oral reports of the results, with each student focusing on a different area. For example, students can develop the geophysical modeling or synthesis of the results into other studies in the area. The final written and oral reports are combined into a comprehensive report and presentation of the field camp and its results. Students taking graduate version complete additional assignments.",
    "instructors" : "T. A. Herring, B. H. Hager, F. D. Morgan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.301",
    "academicYear" : "2016",
    "title" : "Past and Present Climate",
    "cluster" : "(Subject meets with 12.842)",
    "prerequisites" : "Chemistry (GIR), 18.03, or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to climate studies, including beginnings of the solar system, time scales, and climate in human history; methods for detecting climate change, including proxies, ice cores, instrumental records, and time series analysis; physical and chemical processes in climate, including primordial atmosphere, ozone chemistry, carbon and oxygen cycles, and heat and water budgets; internal feedback mechanisms, including ice, aerosols, water vapor, clouds, and ocean circulation; climate forcing, including orbital variations, volcanism, plate tectonics, and solar variability; climate models and mechanisms of variability, including energy balance, coupled models, and global ocean and atmosphere models; and outstanding problems. Students taking the graduate version complete different assignments.",
    "instructors" : "K. Emanuel, E. Boyle, D. McGee"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.306",
    "academicYear" : "2016",
    "title" : "Atmospheric Physics and Chemistry",
    "cluster" : "(Subject meets with 10.571J, 12.806J)",
    "prerequisites" : "5.60 or 5.61; 18.075; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to the physics and chemistry of the atmosphere including experience with computer codes. Aerosols and theories of their formation, evolution, and removal. Gas and aerosol transport from urban to continental scales. Coupled models of radiation, transport, and chemistry. Solution of inverse problems to deduce emissions and removal rates. Emissions control technology and costs. Applications to air pollution and climate. Students taking the graduate version complete different assignments.",
    "instructors" : "R. G. Prinn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.300",
    "academicYear" : "2016",
    "title" : "Global Change Science",
    "cluster" : "(Same subject as 1.071J)",
    "prerequisites" : "18.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.071J.",
    "instructors" : "E. A. B. Eltahir"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.431",
    "academicYear" : "2016",
    "title" : "Space Systems Development",
    "cluster" : "(Same subject as 16.831J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-10-6 Institute LAB",
    "optional" : null,
    "description" : "See description under subject 16.831J.",
    "instructors" : "J. A. Hoffman, A. Saenz-Otero"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.320A",
    "academicYear" : "2016",
    "title" : "Introduction to Hydrology and Water Resources",
    "cluster" : "(Same subject as 1.070AJ)",
    "prerequisites" : "1.060A; <I>Coreq: 1.061A, 1.106</I>",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 1.070AJ.",
    "instructors" : "D. Entekhabi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.320B",
    "academicYear" : "2016",
    "title" : "Introduction to Hydrology Modeling",
    "cluster" : "(Same subject as 1.070BJ)",
    "prerequisites" : "1.070A",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 1.070BJ.",
    "instructors" : "D. Entekhabi"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.385",
    "academicYear" : "2016",
    "title" : "Science, Politics, and Environmental Policy",
    "cluster" : "(Subject meets with 11.373J, 12.885J)",
    "prerequisites" : "12.306 or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Examines the role of science in US and international environmental policymaking. Surveys the methods by which scientists learn about the natural world; the treatment of science by experts, advocates, the media, and the public and the way science is used in legislative, administrative and judicial decision making. Through lectures, group discussions, and written essays, students develop a critical understanding of the role of science in environmental policy. Potential case studies include fisheries management, ozone depletion, global warming, smog, and endangered species. Students taking the graduate version complete different assignments.",
    "instructors" : "S. Solomon, J. Layzer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.116",
    "academicYear" : "2016",
    "title" : "Analysis of Geologic Data",
    "cluster" : null,
    "prerequisites" : "12.115",
    "units" : "0-2-4",
    "optional" : null,
    "description" : "Includes in-depth laboratory analysis of samples, interpretation of geological data, and where possible, geophysical and geochemical data.  Includes the preparation of reports based on the field studies conducted in 12.115 during January; report generally exceeds 30 pages in length and includes one major revision and rewrite. Instruction in writing techniques provided.",
    "instructors" : "B. C. Burchfiel, O. Jagoutz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.158",
    "academicYear" : "2016",
    "title" : "Molecular Biogeochemistry",
    "cluster" : "(Subject meets with 12.458)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-4-3 [P/D/F]",
    "optional" : null,
    "description" : "Covers all aspects of molecular biosignatures, such as their pathways of lipid biosynthesis, the distribution patterns of lipid biosynthetic pathways with regard to phylogeny and physiology, isotopic contents, occurrence in modern organisms and environments, diagenetic pathways, analytical techniques and the occurrence of molecular fossils through the geological record. Students analyze in depth the recent literature on chemical fossils. Lectures provide background on the subject matter. Basic knowledge of organic chemistry required. Students taking graduate version complete additional assignments.",
    "instructors" : "R. Summons"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.338",
    "academicYear" : "2016",
    "title" : "Aerosol and Cloud Microphysics and Chemistry",
    "cluster" : "(Subject meets with 1.842J, 12.814J)",
    "prerequisites" : "12.335, 12.336 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on understanding how aerosol particles form droplets or ice crystals during several atmospheric processes: determining Earth's radiative balance; heterogeneous chemistry and acid rain; understanding where, when and how much precipitation occurs. Provides tools for understanding the physics of aerosol and cloud element motion; the interaction of particles with water vapor, including phase changes and droplet and ice nucleation; the chemical composition of particles and the effect on cloud formation processes; and the effect of cloud processing on aerosol chemistry. Discusses relevant topics of contemporary interest, e.g., geoengineering and weather modification and volcanic effects. Students taking the graduate version complete different assignments.",
    "instructors" : "D. Cziczo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.845",
    "academicYear" : "2016",
    "title" : "Sustainability Science and Engineering",
    "cluster" : "(Same subject as ESD.120J)",
    "prerequisites" : "None. <I>Coreq: ESD.83</I> or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject ESD.120J.",
    "instructors" : "N. Selin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.012",
    "academicYear" : "2016",
    "title" : "MatLab, Statistics, Regression, Signal Processing",
    "cluster" : "(Subject meets with 12.444)",
    "prerequisites" : "None. <I>Coreq: 18.06</I>",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the basic tools needed for data analysis and interpretation in the Geosciences, as well as other sciences. Composed of four modules, targeted at introducing students to the basic concepts and applications in each module. MatLab: Principles and practice in its uses, script and function modules, basic approaches to solving problems. Statistics: Correlation, means, dispersion, precision, accuracy, distributions, central limit theorem, skewness, probability, Chi-Square, Gaussian and other common distributions used in hypothesis testing. Regression: Random and grid search methods, basic least squares and algorithms applicable to regression, inversion and parameter estimation. Signal Processing: Analog and digital signals, Z-transform, Fourier series, fast Fourier transforms, spectral analysis leakage and bias, digital filtering. Students taking the graduate version complete different assignments.",
    "instructors" : "F. D. Morgan, T. A. Herring, S. Ravela"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.336",
    "academicYear" : "2016",
    "title" : "Air Pollution",
    "cluster" : "(Same subject as 1.085J)",
    "prerequisites" : "18.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.085J.",
    "instructors" : "C. Heald"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.340",
    "academicYear" : "2016",
    "title" : "Global Warming Science",
    "cluster" : null,
    "prerequisites" : "Physics I (GIR),Calculus I (GIR), or permission of instructor; <I>Coreq: 5.60</I>",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Provides students with a scientific foundation of anthropogenic climate change and an introduction to climate models. Focuses on fundamental physical processes that shape climate (e.g. solar variability, orbital mechanics, greenhouse gases, atmospheric and oceanic circulation, and volcanic and soil aerosols) and on evidence for past and present climate change. Discusses material consequences of climate change, including sea level change, variations in precipitation, vegetation, storminess, and the incidence of disease. Examines the science behind mitigation and adaptation proposals.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.486",
    "academicYear" : "2016",
    "title" : "Advanced Igneous Petrology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-2-7",
    "optional" : "Can be repeated for credit",
    "description" : "Comprehensive overview of igneous rocks from the Earth, Moon, and meteorite parent bodies. Discusses the compositional diversity of igneous rocks and how it can be used to elucidate rock forming processes in the major tectonic provinces on modern Earth, including mid-ocean ridges, subduction zones, ocean islands, and inter-continental rifting environments. Also covers magma generation processes in the terrestrial planets prior to 2.6 billion years ago. Laboratory exercises on selected suites of igneous rocks reinforce readings and classroom discussions. Uses evidence from related geo-science disciplines to develop an integrative approach to understanding processes that lead to the chemical differentiation of planetary bodies through time. Subject matter may be modified to reflect the interests of the group.",
    "instructors" : "T. L. Grove"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.S491",
    "academicYear" : "2016",
    "title" : "Special Seminar in Geology and Geochemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Organized lecture or laboratory subject on an aspect of geology or geochemistry not normally covered in regularly scheduled subjects. 12.490 is letter-graded.",
    "instructors" : "Geology and Geochemistry Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.009",
    "academicYear" : "2016",
    "title" : "Theoretical Environmental Analysis",
    "cluster" : "(Same subject as 18.352J)",
    "prerequisites" : "Physics I (GIR), Calculus II (GIR); <I>Coreq: 18.03</I>",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Analyzes cooperative processes that shape the natural environment, now and in the geologic past. Emphasizes the development of theoretical models that relate the physical and biological worlds, the comparison of theory to observational data, and associated mathematical methods. Topics include carbon cycle dynamics; ecosystem structure, stability and complexity; mass extinctions; biosphere-geosphere coevolution; and climate change. Employs techniques such as stability analysis; scaling; null model construction; time series and network analysis.",
    "instructors" : "D. H. Rothman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.473",
    "academicYear" : "2016",
    "title" : "Paleomagnetism and Planetary Magnetism",
    "cluster" : null,
    "prerequisites" : "12.002, 18.03; or permission of instructor",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Introduces the study of natural remanent magnetization and the generation of planetary magnetic fields.  Topics include paleomagnetism, rock magnetism, geomagnetism, magnetostratigraphy, paleomagnetic measurement techniques, polar wander and continental drift, biomagnetism, dynamo theory, and the history and evolution of magnetic fields on the Earth and planets.",
    "instructors" : "B. P. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.011",
    "academicYear" : "2016",
    "title" : "Archaeological Science",
    "cluster" : "(Same subject as 3.985J, 5.24J)",
    "prerequisites" : "Chemistry (GIR) or Physics I (GIR)",
    "units" : "3-1-5 HASS-S",
    "optional" : null,
    "description" : "See description under subject 3.985J.",
    "instructors" : "H. N. Lechtman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.844",
    "academicYear" : "2016",
    "title" : "Modeling and Assessment for Policy",
    "cluster" : "(Same subject as ESD.864J)",
    "prerequisites" : "None",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject ESD.864J.",
    "instructors" : "N. Selin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.471",
    "academicYear" : "2016",
    "title" : "Essentials of Geobiology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-4-5",
    "optional" : null,
    "description" : "Introduces basic concepts of microbial structure, growth, energetics, molecular biology, and biochemistry. Presents examples of microbial interactions with environments throughout Earth's history as well as current topics in astrobiology. Includes lectures, discussions of literature, and a field trip. Lab focuses on student-designed projects that involve cultivation, modeling, or sample analyses. Intended for students whose background is not in biology, but who want to learn more about the contribution of microbes to geochemistry and planetary evolution.",
    "instructors" : "T. Bosak"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.458",
    "academicYear" : "2016",
    "title" : "Molecular Biogeochemistry",
    "cluster" : "(Subject meets with 12.158)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-4-3 [P/D/F]",
    "optional" : null,
    "description" : "Covers all aspects of molecular biosignatures, such as their pathways of lipid biosynthesis, the distribution patterns of lipid biosynthetic pathways with regard to phylogeny and physiology, isotopic contents, occurrence in modern organisms and environments, diagenetic pathways, analytical techniques and the occurrence of molecular fossils through the geological record. Students analyze in depth the recent literature on chemical fossils. Lectures provide background on the subject matter. Basic knowledge of organic chemistry required. Students taking graduate version complete additional assignments.",
    "instructors" : "R. Summons"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.552",
    "academicYear" : "2016",
    "title" : "Advanced Seismology: Theory and Applications of Seismic Imaging",
    "cluster" : null,
    "prerequisites" : "12.510",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces fundamental principles of seismic imaging used in both exploration and solid earth applications. Topics include ray theoretical approaches, scattering theory, and seismic waveform modeling. Through lectures, projects and student-led discussions of journal articles, the class covers the whole process of seismic imaging, from data preprocessing to model generation and geological interpretation of the results.",
    "instructors" : "EAPS Faculty"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.441",
    "academicYear" : "2016",
    "title" : "Collaborative Seminar in Geology and Geophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Focuses on problems of current interest in geology and geophysics; subject matter varies from term to term. Includes guest speakers from outside of EAPS. 12.441 is graded P/D/F.",
    "instructors" : "Geology and Geophysics Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.470",
    "academicYear" : "2016",
    "title" : "Essentials of Geology",
    "cluster" : "(Subject meets with 12.170)",
    "prerequisites" : "Physics II (GIR), Calculus II (GIR); or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Geology of planetary interiors and surfaces, including plate tectonics, as a unifying theory of terrestrial geology, surface processes, and the Earth's interior. Igneous, metamorphic, and sedimentary processes associated with tectonic settings and the typical rock suites created. Mineral and rock identification. Causes of compositional differences on many scales: mineral grains, rocks, regions of the Earth, different planets. Conditions required for melting and melting processes. Rock structure and field techniques. Earth history.  Treatment of these topics includes discussions of the geochemical, petrologic, geochronological, experimental, or field techniques used to investigate them; the limitations of current geological techniques and geological controversies; and great geological expeditions, experiments, and studies from the past, their premises, and their results. Students taking graduate version complete additional assignments.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.335",
    "academicYear" : "2016",
    "title" : "Experimental Atmospheric Chemistry",
    "cluster" : "(Subject meets with 12.835)",
    "prerequisites" : "Chemistry (GIR)",
    "units" : "2-4-6 Institute LAB",
    "optional" : null,
    "description" : "Introduces the atmospheric chemistry involved in climate change, air pollution, and ozone depletion using a combination of interactive laboratory and field studies and simple computer models. Uses instruments for trace gas and aerosol measurements and methods for inferring fundamental information from these measurements. Provides instruction and practice in written and oral communication. Students taking the graduate version complete different assignments.",
    "instructors" : "R. Prinn, S. Ono, K. Dryer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.652",
    "academicYear" : "2016",
    "title" : "Current Topics in Planetary Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "In-depth discussion of current and classic literature on selected topics in the specialty areas of asteroids and the Pluto-Charon system. Topics vary from year to year.",
    "instructors" : "R. P. Binzel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.823",
    "academicYear" : "2016",
    "title" : "Modeling the Biology and Physics of the Ocean",
    "cluster" : null,
    "prerequisites" : "18.075 or 18.085",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Principles and examples of the construction of physical/ biological models for oceanic systems.  Individual-based and continuum representations. Food webs and structured population models. Fluid transport, stirring, and mixing. Effects of rotation and stratification. Advection, diffusion, reaction dynamics. Oceanic examples of physical-biological dynamics: surface mixed layer, upwelling regimes, mesoscale eddies, and oceanic gyres.",
    "instructors" : "G. Flierl, D. McGillicuddy"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.521",
    "academicYear" : "2016",
    "title" : "Computational Geophysical Modeling",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces theory, design, and practical methods of computational modeling in geodynamics and geophysical fluid dynamics. Covers the most effective and widely used numerical modeling approaches (e.g., boundary element, finite difference, finite element) and emphasizes problem-solving skills through illustrative examples of heat and mass transfer in the mantle and the ocean. Students acquire experience with various numerical methods through regularly assigned computational exercises and a term-long modeling project of each student's choice.",
    "instructors" : "J. Lin, O. Marchal, M. Behn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.170",
    "academicYear" : "2016",
    "title" : "Essentials of Geology",
    "cluster" : "(Subject meets with 12.470)",
    "prerequisites" : "Physics II (GIR), Calculus II (GIR); or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Studies the geology of planetary interiors and surfaces, including plate tectonics, as a unifying theory of terrestrial geology, surface processes, and the Earth's interior. Covers igneous, metamorphic, and sedimentary processes associated with tectonic settings and the typical rock suites created; mineral and rock identification; and causes of compositional differences on many scales (mineral grains, rocks, regions of the Earth, different planets). Also addresses conditions required for melting and melting processes; rock structure and field techniques; and Earth history. Treatment of these topics includes discussions of the geochemical, petrologic, geochronological, experimental, or field techniques used to investigate them; the limitations of current geological techniques and geological controversies; and major geological expeditions, experiments, and studies from the past, along with their premises and results. Students taking graduate version complete additional assignments.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.525",
    "academicYear" : "2016",
    "title" : "Mechanisms of Faulting and Earthquakes",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores the fundamental mechanics of faulting and earthquakes from four related perspectives: seismology, geodesy, geodynamics, and rheology.  Topics to be covered include (1) the physical processes that control the rheology of faults, including friction and fracture, (2) how these rheological processes are manifest in faulting and earthquakes in the earth from a geodynamics perspective, and (3) how the mechanics of faulting and earthquakes are constrained by seismological and geodetic observations.  Both continental and oceanic examples of faulting and earthquakes will be featured.",
    "instructors" : "J. McGuire, G. Prieto"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.749",
    "academicYear" : "2016",
    "title" : "Solid Earth Geochemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Integrates methods in mineralogy, petrology (both igneous and metamorphic), and trace element and isotope geochemistry to address scientific issues of the solid earth. Covers processes in the solar nebula, accretion, and early differentiation of the earth. Discusses topics in three representative geodynamic environments - mid-ocean ridges, subduction zones, and mantle plumes with respect to physical framework and petrological/geochemical aspects.",
    "instructors" : "N. Shimizu, S. Nielsen (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.824",
    "academicYear" : "2016",
    "title" : "Stability Theory for Oceanic & Atmospheric Flows",
    "cluster" : null,
    "prerequisites" : "12.802 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Basic theory of hydrodynamic instability with special application to flows of interest in oceanography and meteorology.  Topics covered include general formulation of stability theory; concept of normal modes and linearization; fundamental stability theorems; baroclinic instability: Charney model, Eady model and the Phillips two-layer model; energy transformations; initial value theory and non-modal instability; barotropic instability for jets and shear layers; radiating instabilities; initial value problems applied to the concepts of convective, absolute and spatial instabilities; finite amplitude theory; stability of non-parallel flows.",
    "instructors" : "G. Flierl"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.010",
    "academicYear" : "2016",
    "title" : "Computational Methods of Scientific Programming",
    "cluster" : null,
    "prerequisites" : "Calculus I (GIR), Calculus II (GIR), Physics I (GIR)",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduces programming languages and techniques used by physical scientists: FORTRAN, C, C++, MatLab, and Mathematica. Emphasis on program design, algorithm development and verification, and comparative advantages and disadvantages of different languages. Students first learn the basic usage of each language, common types of problems encountered, and techniques for solving a variety of problems encountered in contemporary research: examination of data with visualization techniques, numerical analysis, and methods of dissemination and verification. No prior programming experience is required.",
    "instructors" : "T. Herring, C. Hill"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.860",
    "academicYear" : "2016",
    "title" : "Climate Variability and Diagnostics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Practical insight into characteristics and mechanisms of climate variability from regional to global scale in the modern world with applications to past and future climates. Major emphasis is placed on the salient features of the mean climate system and their dominant modes of natural variability (e.g., El Nino-Southern Oscillation, North Atlantic Oscillation) as well as observed and projected manifestations of anthropogenic climate change. Learning is driven by exploration of data and supplemented by lectures and published literature. Through inter-active learning students gain experience accessing and analyzing a wide range of gridded data including instrumental, satellite, and reanalysis products as well as IPCC global climate model simulations.",
    "instructors" : "K. Karnauskas"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.983",
    "academicYear" : "2016",
    "title" : "Current Research in Climate Physics and Chemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Original investigations, laboratory work, or fieldwork in problems related to climate.  12.982 is letter-graded",
    "instructors" : "PAOC faculty"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.741",
    "academicYear" : "2016",
    "title" : "Marine Bioinorganic Chemistry",
    "cluster" : null,
    "prerequisites" : "Permission of Instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Provides an overview of trace element biogeochemistry and marine bioinorganic chemistry. Topics include controls on oceanic trace metal distributions; co-evolution of biological metal requirements and metal availability during early Earth history; chemical speciation and its influence on microbial bioavailability; applications of metal isotopes; roles of metalloenzymes and metal proteins in biogeochemical cycles; and biogeochemical applications of metagenomics, metaproteomics, and bioinformatics.",
    "instructors" : "M. Saito"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.443",
    "academicYear" : "2016",
    "title" : "Collaborative Seminar in Planetary Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Focuses on problems of current interest in planetary science; subject matter varies from term to term. Includes guest speakers from outside of EAPS. 12.443 is graded P/D/F.",
    "instructors" : "Planetary Science Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.449",
    "academicYear" : "2016",
    "title" : "Collaborative Seminar in Atmospheres, Oceans and Climate",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Focuses on problems of current interest in atmospheres, oceans, and climate; subject matter varies from term to term. Includes guest speakers from outside of EAPS. 12.449 is graded P/D/F.",
    "instructors" : "PAOC Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.454",
    "academicYear" : "2016",
    "title" : "Crosby Lectures in Geology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "A series of presentations on an advanced topic in the field of geology by the visiting William Otis Crosby lecturer. The Crosby lectureship is awarded to a distinguished international scientist each year to introduce new scientific perspectives to the MIT community. Subject content and structure vary from year to year.",
    "instructors" : "Consult Department Education Office"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.817",
    "academicYear" : "2016",
    "title" : "Atmospheric Composition in the Changing Earth System",
    "cluster" : "(Same subject as 1.841J)",
    "prerequisites" : "1.84",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 1.841J.",
    "instructors" : "C. Heald"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.S681",
    "academicYear" : "2016",
    "title" : "Special Seminar in Planetary Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Organized lecture or laboratory subject on an aspect of planetary science not normally covered in regularly scheduled subjects. 12.S680 is letter-graded.",
    "instructors" : "Planetary Science Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.S493",
    "academicYear" : "2016",
    "title" : "Special Seminar in Geobiology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Organized lecture or laboratory subject on an aspect of geobiology not normally covered in regularly scheduled subjects. 12.492 is letter-graded.",
    "instructors" : "Geobiology Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.420",
    "academicYear" : "2016",
    "title" : "Physics and Chemistry of the Solar System",
    "cluster" : "(Subject meets with 12.601)",
    "prerequisites" : "12.002 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Advanced applications of physical and chemical principles to the study of the solar system. Topics include terrestrial and giant planets, meteorites, asteroids, comets, Kuiper belt objects, rings, impact craters, interiors, surfaces, atmospheres, geomagnetism, cosmochemistry, remote sensing, formation and evolution of the solar system.",
    "instructors" : "B. P. Weiss"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.43",
    "academicYear" : "2016",
    "title" : "Space Systems Engineering",
    "cluster" : "(Same subject as 16.83J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-3-6",
    "optional" : null,
    "description" : "See description under subject 16.83J.",
    "instructors" : "J. A. Hoffman, A. Saenz-Otero"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.446",
    "academicYear" : "2016",
    "title" : "Teaching Experience in EAPS",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Recognizes the educational value derived from satisfactory performance of assigned duties as a Teaching Assistant. Laboratory, field, recitation, or classroom teaching under supervision of a faculty member. Credit for this subject may not be used for any degree granted by Course 12. Total enrollment limited by availability of suitable teaching assignments.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.625",
    "academicYear" : "2016",
    "title" : "Extrasolar Planets: Physics and Detection Techniques",
    "cluster" : "(Subject meets with 8.290J, 12.425J)",
    "prerequisites" : "8.03, 18.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "In-depth study of current topics in exoplanets, such as exoplanet transits, radial velocity curves, current survey missions, the mass-radius relation, and super Earths. Class activities consist of reading the current literature, problem sets, and a term project. Students taking graduate version complete additional assignments.",
    "instructors" : "H. Schlichting"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.586",
    "academicYear" : "2016",
    "title" : "Modeling Environmental Complexity",
    "cluster" : "(Subject meets with 12.086)",
    "prerequisites" : "18.03 or permission of the instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to mathematical and physical models of environmental processes. Emphasis on the development of macroscopic continuum or statistical descriptions of complex microscopic dynamics. Problems of interest include: random walks and statistical geometry of landscapes; percolation theory and transport in disordered media; fractals, scaling, and universality; ecological dynamics and the structure of ecosystems, food webs, and other natural networks; kinetics of biogeochemical cycles. Appropriate for advanced undergraduates. Beginning graduate students are encouraged to register for 12.586. Students taking the graduate version complete different assignments.",
    "instructors" : "D. H. Rothman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.086",
    "academicYear" : "2016",
    "title" : "Modeling Environmental Complexity",
    "cluster" : "(Subject meets with 12.586)",
    "prerequisites" : "18.03",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to mathematical and physical models of environmental processes. Emphasis on the development of macroscopic continuum or statistical descriptions of complex microscopic dynamics. Problems of interest include: random walks and statistical geometry of landscapes; percolation theory and transport in disordered media; fractals, scaling, and universality; ecological dynamics and the structure of ecosystems, food webs, and other natural networks; kinetics of biogeochemical cycles. Appropriate for advanced undergraduates. Beginning graduate students are encouraged to register for 12.586. Students taking the graduate version complete different assignments.",
    "instructors" : "D. H. Rothman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.835",
    "academicYear" : "2016",
    "title" : "Experimental Atmospheric Chemistry",
    "cluster" : "(Subject meets with 12.335)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-4-6",
    "optional" : null,
    "description" : "Introduces the atmospheric chemistry involved in climate change, air pollution, and ozone depletion using a combination of interactive laboratory and field studies and simple computer models. Uses instruments for trace gas and aerosol measurements and methods for inferring fundamental information from these measurements. Students taking the graduate version complete different assignments.",
    "instructors" : "R. Prinn, S. Ono, K. Dryer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.330",
    "academicYear" : "2016",
    "title" : "Fluid Physics",
    "cluster" : "(Same subject as 8.292J)",
    "prerequisites" : "8.044, 5.60, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 8.292J.",
    "instructors" : "D. Cziczo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.S993",
    "academicYear" : "2016",
    "title" : "Special Subject in Climate Physics and Chemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Organized lecture or laboratory subject on an aspect of climate not normally covered in the regularly scheduled subjects.  12.S992 is letter-graded.",
    "instructors" : "PAOC Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.846",
    "academicYear" : "2016",
    "title" : "Global Environmental Science and Negotiations",
    "cluster" : "(Same subject as ESD.110J)\n(Subject meets with 12.346J, ESD.046J)",
    "prerequisites" : "None",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject ESD.110J.",
    "instructors" : "N. Selin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.447",
    "academicYear" : "2016",
    "title" : "Strategies for Writing Successful Fellowship Proposals",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-0 [P/D/F]",
    "optional" : null,
    "description" : "Focuses on developing writing skills appropriate for preparing successful fellowship proposals. Includes writing practice, self-evaluation, and faculty feedback.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.S489",
    "academicYear" : "2016",
    "title" : "Special Seminar in Structural Geology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Organized lecture or laboratory subject on an aspect of structural geology not normally covered in regularly scheduled subjects. 12.488 is letter-graded.",
    "instructors" : "Geology and Geochemistry Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.S591",
    "academicYear" : "2016",
    "title" : "Special Seminar in Geophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Organized lecture or laboratory subject on an aspect of geophysics not normally covered in regularly scheduled subjects. 12.S590 is letter-graded.",
    "instructors" : "Consult EAPS Education Office"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.S593",
    "academicYear" : "2016",
    "title" : "Special Seminar in Earth, Atmospheric and Planetary Sciences",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Organized lecture or laboratory subject on an aspect of the earth sciences, planetary sciences, or astronomy not normally covered in regularly scheduled subjects. 12.592 is letter-graded.",
    "instructors" : "EAPS Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.S991",
    "academicYear" : "2016",
    "title" : "Special Subject in Atmospheric Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Organized lecture or laboratory subject on an aspect of atmospheric science not normally covered in regularly scheduled subjects. 12.S990 is letter-graded.",
    "instructors" : "PAOC Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.444",
    "academicYear" : "2016",
    "title" : "MatLab, Statistics, Regression, Signal Processing",
    "cluster" : "(Subject meets with 12.012)",
    "prerequisites" : "18.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduces the basic tools needed for data analysis and interpretation in the Geosciences, as well as other sciences. Composed of four modules, targeted at introducing students to the basic concepts and applications in each module. MatLab: Principles and practice in its uses, script and function modules, basic approaches to solving problems. Statistics: Correlation, means, dispersion, precision, accuracy, distributions, central limit theorem, skewness, probability, Chi-Square, Gaussian and other common distributions used in hypothesis testing. Regression: Random and grid search methods, basic least squares and algorithms applicable to regression, inversion and parameter estimation. Signal Processing: Analog and digital signals, Z-transform, Fourier series, fast Fourier transforms, spectral analysis leakage and bias, digital filtering. Students taking the graduate version complete different assignments.",
    "instructors" : "F. D. Morgan, T. A. Herring, S. Ravela"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.346",
    "academicYear" : "2016",
    "title" : "Global Environmental Science and Negotiations",
    "cluster" : "(Same subject as ESD.046J)\n(Subject meets with 12.846J, ESD.110J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject ESD.046J.",
    "instructors" : "N. Selin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.425",
    "academicYear" : "2016",
    "title" : "Extrasolar Planets: Physics and Detection Techniques",
    "cluster" : "(Same subject as 8.290J)\n(Subject meets with 12.625)",
    "prerequisites" : "8.03, 18.03",
    "units" : "2-1-9 REST",
    "optional" : null,
    "description" : "Presents basic principles of planet atmospheres and interiors applied to the study of extrasolar planets. Focuses on fundamental physical processes related to observable extrasolar planet properties. Provides a quantitative overview of detection techniques. Introduction to the feasibility of the search for Earth-like planets, biosignatures and habitable conditions on extrasolar planets. Students taking graduate version complete additional assignments.",
    "instructors" : "H. Schlichting"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.885",
    "academicYear" : "2016",
    "title" : "Science, Politics, and Environmental Policy",
    "cluster" : "(Same subject as 11.373J)\n(Subject meets with 12.385)",
    "prerequisites" : "12.806, 12.807, or permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Examines the role of science in US and international environmental policymaking. Surveys the methods by which scientists learn about the natural world; the treatment of science by experts, advocates, the media, and the public and the way science is used in legislative, administrative and judicial decision making.  Through lectures, group discussions, and written essays, students develop a critical understanding of the role of science in environmental policy.  Potential case studies include fisheries management, ozone depletion, global warming, smog, and endangered species. Students taking the graduate version complete different assignments.",
    "instructors" : "S. Solomon, J. Layzer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.031A",
    "academicYear" : "2016",
    "title" : "Fundamentals of Ecology I",
    "cluster" : "(Same subject as 1.018AJ, 7.30AJ)",
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 1.018AJ.",
    "instructors" : "S. Chisholm, M. Follows"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.849",
    "academicYear" : "2016",
    "title" : "Mechanisms and Models of the Global Carbon Cycle",
    "cluster" : "(Subject meets with 12.349)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Addresses changes in the ocean, terrestrial biosphere and rocks modulation of atmospheric carbon dioxide on timescales from months to millions of years. Includes feedbacks between carbon cycle and climate. Combines hands-on data analysis with the formulation of simple models rooted in basic physical, chemical and biological principles. Students create individual \"toy\" global carbon cycle models. Students taking graduate version complete different assignments.",
    "instructors" : "M. Follows"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.031B",
    "academicYear" : "2016",
    "title" : "Fundamentals of Ecology II",
    "cluster" : "(Same subject as 1.018BJ, 7.30BJ)",
    "prerequisites" : "1.018A",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 1.018BJ.",
    "instructors" : "S. Chisholm, M. Follows"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.349",
    "academicYear" : "2016",
    "title" : "Mechanisms and Models of the Global Carbon Cycle",
    "cluster" : "(Subject meets with 12.849)",
    "prerequisites" : "Calculus II (GIR), Physics I (GIR)",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Addresses changes in the ocean, terrestrial biosphere and rocks modulation of atmospheric carbon dioxide on timescales from months to millions of years. Includes feedbacks between carbon cycle and climate. Combines hands-on data analysis with the formulation of simple models rooted in basic physical, chemical and biological principles. Students create individual \"toy\" global carbon cycle models. Students taking graduate version complete different assignments.",
    "instructors" : "M. Follows"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.717",
    "academicYear" : "2016",
    "title" : "Coastal Geomorphology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores mechanisms behind the formation and reshaping of coastal environments. Focuses on a process-based understanding of both the fluid dynamic and sediment transport aspects of coastal landforms, and, especially, the importance of feedbacks between the two. Investigates coastal evolution at various scales - from ripples to coastline formation - with an emphasis on the behavior of coastal environments over integrated timescales of days and years to centuries and millennia. Students investigate the effect of storms, sea-level rise, and interactions with biological and anthropogenic influences. Covers a broad array of coastal environments, including beaches, barrier islands, spits, inlets, tidal flats, deltas, rocky coasts, arctic shores, and carbonate atolls.",
    "instructors" : "A. Ashton"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.718",
    "academicYear" : "2016",
    "title" : "Kinetics and Mass Transport",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "Offers a broad overview of various kinetic and transport processes in geology, including volume and grain boundary solid-state diffusion, defects in minerals, rates of mineral reaction and transformation, crystal nucleation and growth, advective transport in porous media and partially molten aggregates, and percolation theory. Emphasis on processes in crystalline rocks. Covers theoretical, phenomenological, and experimental constraints, with a consistent application to \"real-world\" settings and actual case histories.",
    "instructors" : "M. Behn and G. Gaetani (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.739",
    "academicYear" : "2016",
    "title" : "Marine Microbiology and Biogeochemistry",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Integrates the fields of microbiology and biogeochemistry, and is centered on elucidating the linkages between microorganisms and geochemical processes in the oceans. Divided into modules that first lay the theoretical framework to familiarize students of diverse backgrounds (biologists, chemists, physical oceanographers). Next, introduces specific and general linkages between the topics and the major tools and techniques that have advanced their integrated study. Concludes with a synthesis module examining the role of microorganisms in the biogeochemical cycles of diverse ocean biomes",
    "instructors" : "A. Apprill, S. Sievert (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.850",
    "academicYear" : "2016",
    "title" : "Computational Ocean Modeling",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Numerical modeling in oceanography and environmental fluid mechanics. Focuses on the building of computational models that describe processes such as transport (advection, diffusion), reaction (ecosystems), and boundary forcing, of relevance in the ocean. Models are developed in a hierarchical manner, starting from the simple (zero-dimensional in space), and incrementally advancing toward more complex, time-evolving systems in one-, two- (shallow water) and three-dimensions (Primitive equations). Students build their own models using the finite volume approach with an appreciation and understanding of the working of general circulation models",
    "instructors" : "A. Mahadevan (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.853",
    "academicYear" : "2016",
    "title" : "Advanced geophysical fluid dynamics",
    "cluster" : null,
    "prerequisites" : "12.843 or permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Follow-on to 12.843, with a more mathematical treatment and extension of material to current topics of interest involving rotating, stratified flows of oceans and atmospheres.",
    "instructors" : "G. Flierl"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.843",
    "academicYear" : "2016",
    "title" : "Large-scale Atmosphere and Ocean Dynamics",
    "cluster" : null,
    "prerequisites" : "12.801, 12.810, or permission of instructor",
    "units" : "2-4-9",
    "optional" : null,
    "description" : "Project-based with lectures covering the relevant theory. Students work in groups on four projects. Each of these comprises a numerical part, to illuminate and illustrate the theory, and a data part (drawn from laboratory tank experiments, atmospheric, or ocean observations), to illustrate the phenomena.  Topics include: barotropic vorticity dynamics including inversion and evolution, geostrophic and higher order balance, baroclinic dynamics and the evolution of balanced flows, and stability with emphasis on the mutual interaction of disturbances. Projects include a verbal presentation and writeup covering both the numerical and geophysical parts plus additional derivations as needed.",
    "instructors" : "G. Flierl, L. Illari"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.701",
    "academicYear" : "2016",
    "title" : "Classic Papers in Physical Oceanography",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-3 [P/D/F]",
    "optional" : null,
    "description" : "Provides a historical perspective on fundamental topics in oceanography by considering individual works which, when pieced together, contribute to the more cohesive description of how the ocean works. In class discussions, students consider various aspects of the work in question, including motivation, approach, and implications for the broader context. They also synthesize information and make oral presentations. Develops basic analytical and critical skills in paper reading and writing.",
    "instructors" : "Y. Kwon (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.512",
    "academicYear" : "2016",
    "title" : "Field Geophysics Analysis",
    "cluster" : "(Subject meets with 12.222)",
    "prerequisites" : "12.511",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "Focuses on in-depth data analysis and development of skills needed to report results both in writing and orally. Students use data collected in 12.511 to develop written and oral reports of the results, with each student focusing on a different area. For example, students can develop the geophysical modeling or synthesis of the results into other studies in the area. The final written and oral reports are combined into a comprehensive report and presentation of the field camp and its results. Students taking graduate version complete additional assignments.",
    "instructors" : "T. A. Herring, B. H. Hager, F. D. Morgan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.492",
    "academicYear" : "2016",
    "title" : "Fundamentals of Stable Isotope Fractionation",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "2-4-6",
    "optional" : null,
    "description" : "Designed for bio-geo-chemists to gain a first order understanding of the origin of stable isotope effects and their application in understanding important geochemical processes on earth and planets.  Includes an introduction of relevant physical chemistry, simple numerical integration methods of time-forward modeling to solve isotope systematics of complex systems, and discussion of the latest as well as classic papers of the topic.",
    "instructors" : "S. Ono"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.814",
    "academicYear" : "2016",
    "title" : "Aerosol and Cloud Microphysics and Chemistry",
    "cluster" : "(Same subject as 1.842J)\n(Subject meets with 12.338)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Focuses on understanding how aerosol particles form droplets or ice crystals during several atmospheric processes: determining Earth's radiative balance; heterogeneous chemistry and acid rain; understanding where, when and how much precipitation occurs. Provides tools for understanding the physics of aerosol and cloud element motion; the interaction of particles with water vapor, including phase changes and droplet and ice nucleation; the chemical composition of particles and the effect on cloud formation processes; and the effect of cloud processing on aerosol chemistry. Discusses relevant topics of contemporary interest, e.g., geoengineering and weather modification and volcanic effects. Students taking the graduate version complete different assignments.",
    "instructors" : "D. Cziczo"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.493",
    "academicYear" : "2016",
    "title" : "Microbial Genetics and Evolution",
    "cluster" : "(Same subject as 1.87J, 7.493J, 20.446J)",
    "prerequisites" : "7.03, 7.05, 7.28 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 7.493J.",
    "instructors" : "A. D. Grossman, G. Fournier"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.511",
    "academicYear" : "2016",
    "title" : "Field Geophysics",
    "cluster" : "(Subject meets with 12.221)",
    "prerequisites" : "None",
    "units" : "1-4-1 [P/D/F]",
    "optional" : null,
    "description" : "Covers practical methods of modern geophysics, including the global positioning system (GPS), gravity, and magnetics. Field work is conducted in western US and includes intensive 10-day field exercise. Focuses on measurement techniques and their interpretation. Introduces the science of gravity, magnetics, and the GPS. Measures crustal structure, fault motions, tectonic deformations, and the local gravity and magnetic fields. Students perform high-precision measurements and participate in data analysis. Emphasizes principles of geophysical data collection and the relevance of these data for tectonic faulting, crustal structure, and the dynamics of the earthquake cycle. Students taking graduate version complete additional assignments.",
    "instructors" : "T. A. Herring, B. H. Hager, F. D. Morgan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.702",
    "academicYear" : "2016",
    "title" : "Elements of Modern Oceanography",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Examines a series of crosscutting topics that exemplify current directions in interdisciplinary oceanography. Focuses on current themes in oceanography, their inter-disciplinary nature, and the role of ocean sciences in society.  Introduces core concepts across the disciplines of biological, physical, and chemical oceanography as well as marine geology. Emphasis on the inter-disciplinary aspects of these core concepts, the kinds of approaches and modes of thinking common to all of the disciplines, and the technological developments underpinning current advances.",
    "instructors" : "G. Lawson, A. Kirincich (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "12.703",
    "academicYear" : "2016",
    "title" : "Presenting Scientific Research",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "3-0-3",
    "optional" : null,
    "description" : "Presenting scientific research geared toward a scientific audience.  Each student gives one 30-minute talk, one AGU-style 15-minute talk, and one poster presentation.  Students present their ongoing research and use the class as a forum to practice for upcoming talks in more formal settings.  Abstracts are prepared for each presentation and discussed in class.  Students provide comments, questions, encouragement, critiques, etc. on their peers' presentations.",
    "instructors" : "M. Behn, S. Nielsen"
  } ]
}