{
  "metadata" : {
    "size" : "122"
  },
  "items" : [ {
    "termCode" : "2016FA",
    "subjectId" : "7.02",
    "academicYear" : "2016",
    "title" : "Introduction to Experimental Biology and Communication",
    "cluster" : "(Same subject as 10.702J)",
    "prerequisites" : "Biology (GIR)",
    "units" : "4-8-6 Institute LAB",
    "optional" : null,
    "description" : "Introduction to the experimental concepts and methods of molecular biology, biochemistry, and genetic analysis. Emphasis on experimental design, critical data analysis, and the development of written communications skills. 12 units may be applied to the General Institute Laboratory Requirement. Concurrent registration with 7.03 strongly recommended. Enrollment limited.",
    "instructors" : "Fall: S. Bell, O. Yilmaz, K. D. Wittrup<br>Spring: T. Baker, M. Gehring, K. D. Wittrup"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.933",
    "academicYear" : "2016",
    "title" : "Research Rotations in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Introduces students to faculty participating in the Biology graduate program through a series of lab rotations, which provide broad exposure to biology research at MIT. Students select a lab for thesis research by the end of their first year. Limited to students in the Biology graduate program.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.S391",
    "academicYear" : "2016",
    "title" : "Special Subject in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Covers material in various fields of biology not offered by the regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.26",
    "academicYear" : "2016",
    "title" : "Molecular Basis of Infectious Disease",
    "cluster" : "(Subject meets with 7.66)",
    "prerequisites" : "7.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Focuses on the principles of host-pathogen interactions with an emphasis on infectious diseases of humans. Presents key concepts of pathogenesis through the study of various human pathogens. Includes critical analysis and discussion of assigned readings.  Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "D. Kim"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.55",
    "academicYear" : "2016",
    "title" : "Case Studies in Modern Experimental Design",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-7",
    "optional" : null,
    "description" : "Focuses on enhancing students' ability to analyze, design and present experiments, emphasizing modern techniques. Class discussions begin with papers that developed or utilized contemporary approaches (e.g., quantitative microscopy, biophysical and molecular genetic methods) to address important problems in biology. Each student prepares one specific aim of a standard research proposal for a project that emphasizes research strategy, experimental design, and writing.",
    "instructors" : "L. Guarente,  F. Solomon"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.65",
    "academicYear" : "2016",
    "title" : "Molecular and Cellular Neuroscience Core I",
    "cluster" : "(Same subject as 9.015J)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 9.015J.",
    "instructors" : "J. T. Littleton, H. Sive, F. Gertler"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.S392",
    "academicYear" : "2016",
    "title" : "Special Subject in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Covers material in various fields of biology not offered by the regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.S932",
    "academicYear" : "2016",
    "title" : "Special Subject in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Covers material in various fields of biology not offered by the regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.S931",
    "academicYear" : "2016",
    "title" : "Special Subject in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Covers material in various fields of biology not offered by the regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.74",
    "academicYear" : "2016",
    "title" : "Topics in Biophysics and Physical Biology",
    "cluster" : "(Same subject as 8.590J, 20.416J)",
    "prerequisites" : "None",
    "units" : "2-0-4 [P/D/F]",
    "optional" : null,
    "description" : "See description under subject 20.416J.",
    "instructors" : "M. Bathe, I. Cisse"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.UR",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "Permission of department.",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.URG",
    "academicYear" : "2016",
    "title" : "Undergraduate Research",
    "cluster" : null,
    "prerequisites" : "Permission of department",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Undergraduate research opportunities in the Department of Biology. For further information, consult departmental coordinator, Gene Brown.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.03",
    "academicYear" : "2016",
    "title" : "Genetics",
    "cluster" : null,
    "prerequisites" : "Biology (GIR)",
    "units" : "4-0-8 REST",
    "optional" : null,
    "description" : "The principles of genetics with application to the study of biological function at the level of molecules, cells, and multicellular organisms, including humans. Structure and function of genes, chromosomes, and genomes. Biological variation resulting from recombination, mutation, and selection. Population genetics. Use of genetic methods to analyze protein function, gene regulation, and inherited disease.",
    "instructors" : "Fall: G. Fink, P. Gupta, P. Reddien<br>Spring: M. Hemann, A. Regev"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.05",
    "academicYear" : "2016",
    "title" : "General Biochemistry",
    "cluster" : null,
    "prerequisites" : "5.12, Biology (GIR), or permission of instructor",
    "units" : "5-0-7 REST",
    "optional" : "Credit cannot also be received for 5.07, 20.507",
    "description" : "Contributions of biochemistry toward an understanding of the structure and functioning of organisms, tissues, and cells. Chemistry and functions of constituents of cells and tissues and the chemical and physical-chemical basis for the structures of nucleic acids, proteins, and carbohydrates. Basic enzymology and biochemical reaction mechanisms involved in macromolecular synthesis and degradation, signaling, transport, and movement. General metabolism of carbohydrates, fats, and nitrogen-containing materials such as amino acids, proteins, and related compounds.",
    "instructors" : "M. Vander Heiden, M. Yaffe"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.06",
    "academicYear" : "2016",
    "title" : "Cell Biology",
    "cluster" : null,
    "prerequisites" : "7.03, 7.05",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Presents the biology of cells of higher organisms.  Studies the structure, function, and biosynthesis of cellular membranes and organelles; cell growth and oncogenic transformation; transport, receptors, and cell signaling; the cytoskeleton, the extracellular matrix, and cell movements; cell division and cell cycle; functions of specialized cell types.  Emphasizes the current molecular knowledge of cell biological processes as well as the genetic, biochemical, and other experimental approaches that resulted in these discoveries.",
    "instructors" : "Fall: A. Martin, F. Solomon<br>Spring: I. Cheeseman, T. Orr-Weaver"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.11",
    "academicYear" : "2016",
    "title" : "Biology Teaching",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "For qualified undergraduate students interested in gaining some experience in teaching. Laboratory, tutorial, or classroom teaching under the supervision of a faculty member. Students selected by interview.",
    "instructors" : "Consult Biology Education Office"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.16",
    "academicYear" : "2016",
    "title" : "Experimental Molecular Biology",
    "cluster" : null,
    "prerequisites" : "7.02, 7.03, 7.05",
    "units" : "4-16-10",
    "optional" : null,
    "description" : "Applies high-throughput genetic approaches to study the  response of mammalian cells to cytotoxic or infectious stimuli. RNA interference (RNAi) screening and microarray expression analysis will be used to examine the genetics of cellular pro-survival and pro-death pathways.  Teams of two or three students design and carry out experiments to address questions regarding the mechanisms that govern the regulation and execution of cellular responses. Some projects involve the use of DNA damaging agents or other cytotoxic drugs to help understand the pathways that control a cell's response to chemotherapy. Other projects examine the genes that underlie the cellular response to conserved pathogen molecules. Instruction and practice in written and oral communication provided.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.18",
    "academicYear" : "2016",
    "title" : "Topics in Experimental Biology",
    "cluster" : "(Subject meets with 7.19)",
    "prerequisites" : "7.02, 7.03, 7.05",
    "units" : "4-16-10",
    "optional" : null,
    "description" : "Independent experimental study under the direction of a member of the Biology Department faculty. Allows students with a strong interest in independent research to fulfill the project laboratory requirement for the Biology Department Program in the context of a research laboratory at MIT. The research must be conducted on the MIT campus and be a continuation of a previous 12-unit UROP project or full-time work over the summer. Written and oral presentation of the research results is required. Journal club discussions are used to help students evaluate and write scientific papers. Instruction and practice in written and oral communication is provided. Permission of the faculty research supervisor and the Biology Education Office must be obtained in advance.",
    "instructors" : "Fall: D. Kim, A.J. Sinskey, C. Kaiser<br>Spring: D. Kim, C. Kaiser, U. Rajbhandary"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.21",
    "academicYear" : "2016",
    "title" : "Microbial Physiology",
    "cluster" : "(Subject meets with 7.62)",
    "prerequisites" : "7.03, 7.05",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Biochemical properties of bacteria and other microorganisms that enable them to grow under a variety of conditions. Interaction between bacteria and bacteriophages. Genetic and metabolic regulation of enzyme action and enzyme formation. Structure and function of components of the bacterial cell envelope. Protein secretion with a special emphasis on its various roles in pathogenesis. Additional topics include bioenergetics, symbiosis, quorum sensing, global responses to DNA damage, and biofilms.  Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "G. C. Walker, A. J. Sinskey"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.22",
    "academicYear" : "2016",
    "title" : "Development and Evolution",
    "cluster" : null,
    "prerequisites" : "7.06",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Topics include development of animal body plans, tissue patterning, cell type determination, organogenesis, morphogenesis, stem cells, and the evolution of developmental diversity and processes. Covers experimental approaches to problems of development and evolution, such as the study of vertebrate (mouse, chick, frog, fish) and invertebrate (fly, worm) models.",
    "instructors" : "R. O. Hynes, P. Reddien"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.23",
    "academicYear" : "2016",
    "title" : "Immunology",
    "cluster" : "(Subject meets with 7.63)",
    "prerequisites" : "7.06 or permission of instructor",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Comprehensive survey of molecular, genetic, and cellular aspects of the immune system. Topics include innate and adaptive immunity; cells and organs of the immune system; immunoglobulin, T cell receptor, and major histocompatibility complex (MHC) proteins and genes; development and functions of B and T lymphocytes; immune responses to infections and tumors; hypersensitivity, autoimmunity, and immunodeficiencies. Particular attention to the development and function of the immune system as a whole, as studied by modern methods and techniques. Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "H. Ploegh, L. Steiner"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.27",
    "academicYear" : "2016",
    "title" : "Principles of Human Disease",
    "cluster" : null,
    "prerequisites" : "7.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Covers current understanding of and modern approaches to human disease, emphasizing the molecular and cellular basis of both genetic disease and cancer. Topics include the genetics of simple and complex traits; karyotypic analysis and positional cloning; genetic diagnosis; the roles of oncogenes and tumor suppressors in tumor initiation, progression, and treatment; the interaction between genetics and environment; animal models of human disease; cancer; aging and disease; and conventional and gene therapy treatment strategies.",
    "instructors" : "D. Housman, L. Guarente"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.28",
    "academicYear" : "2016",
    "title" : "Molecular Biology",
    "cluster" : "(Subject meets with 7.58)",
    "prerequisites" : "7.03; <I>Coreq: 7.05</I>",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Detailed analysis of the biochemical mechanisms that control the maintenance, expression, and evolution of prokaryotic and eukaryotic genomes. Topics covered in lecture and readings of relevant literature include: gene regulation, DNA replication, genetic recombination, and mRNA translation. Logic of experimental design and data analysis emphasized. Presentations include both lectures and group discussions of representative papers from the literature. Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "S. Bell, W. Gilbert"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.29",
    "academicYear" : "2016",
    "title" : "Cellular and Molecular Neurobiology",
    "cluster" : "(Same subject as 9.09J)",
    "prerequisites" : "7.05 or 9.01",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduction to the structure and function of the nervous system. Emphasizes the cellular properties of neurons and other excitable cells. Includes the structure and biophysical properties of excitable cells, synaptic transmission, neurochemistry, neurodevelopment, integration of information in simple systems, and detection and information coding during sensory transduction.",
    "instructors" : "W. G. Quinn, T. Littleton"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.31",
    "academicYear" : "2016",
    "title" : "Current Topics in Mammalian Biology: Medical Implications",
    "cluster" : null,
    "prerequisites" : "7.06 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Covers recent advances in mammalian cell and developmental biology with particular emphasis on approaches that utilize mouse genetics. Combines formal lectures on selected topics with readings of original papers which are discussed in class. Major emphasis on the implications of mechanisms of human genetic diseases. Topics include early mammalian development; genomic imprinting; X inactivation; embryonic stem cells; nuclear reprogramming of somatic cells; cell migration; nervous system development; and central nervous system degenerative diseases such as Alzheimer's and Huntington's disease. Limited to 20.",
    "instructors" : "F. Gertler, R. Jaenisch"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.37",
    "academicYear" : "2016",
    "title" : "Molecular and Engineering Aspects of Biotechnology",
    "cluster" : "(Same subject as 10.441J, 20.361J)",
    "prerequisites" : "2.005, 3.012, 5.60, 20.110, or 20.111; 7.06; or permission of instructor",
    "units" : "4-0-8",
    "optional" : "Credit cannot also be received for 7.371",
    "description" : "Covers biological and bioengineering principles underlying the development and therapeutic use of recombinant proteins and stem cells; glycoengineering of recombinant proteins; normal and pathological signaling by growth factors and their receptors; receptor trafficking; monoclonal antibodies as therapeutics; protein pharmacology and delivery; stem cell-derived tissues as therapeutics; RNA therapeutics; combinatorial protein engineering; and new antitumor drugs.",
    "instructors" : "H. Lodish, L. Griffith"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.391",
    "academicYear" : "2016",
    "title" : "Independent Study in Biology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.410",
    "academicYear" : "2016",
    "title" : "Applied Statistics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : "Can be repeated for credit",
    "description" : "Provides an introduction to modern applied statistics. Topics include likelihood-based methods for estimation, confidence intervals, and hypothesis-testing; bootstrapping; time series modeling; linear models; nonparametric regression; and model selection. Organized around examples drawn from the recent literature.",
    "instructors" : "A. Solow"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.411",
    "academicYear" : "2016",
    "title" : "Seminars in Biological Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Selected topics in biological oceanography.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.421",
    "academicYear" : "2016",
    "title" : "Problems in Biological Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Advanced problems in biological oceanography with assigned reading and consultation.",
    "instructors" : "Information: M. Neubert (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.431",
    "academicYear" : "2016",
    "title" : "Topics in Marine Ecology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussions on ecological principles and processes in marine populations, communities, and ecosystems. Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.432",
    "academicYear" : "2016",
    "title" : "Topics in Marine Physiology and Biochemistry",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussions on physiological and biochemical processes in marine organisms. Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.434",
    "academicYear" : "2016",
    "title" : "Topics in Zooplankton Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussions on the biology of marine zooplankton. Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.435",
    "academicYear" : "2016",
    "title" : "Topics in Benthic Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussions on the biology of marine benthos. Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.436",
    "academicYear" : "2016",
    "title" : "Topics in Phytoplankton Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussion on the biology of marine phytoplankton. Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.437",
    "academicYear" : "2016",
    "title" : "Topics in Molecular Biological Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussion on molecular biological oceanography. Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.438",
    "academicYear" : "2016",
    "title" : "Topics in the Behavior of Marine Animals",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussion on the behavioral biology of marine animals. Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.439",
    "academicYear" : "2016",
    "title" : "Topics in Marine Microbiology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussion on the biology of marine prokaryotes. Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.440",
    "academicYear" : "2016",
    "title" : "An Introduction to Mathematical Ecology",
    "cluster" : null,
    "prerequisites" : "Calculus I (GIR), 7.30B, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers the basic models of population growth, demography, population interaction (competition, predation, mutualism), food webs, harvesting, and infectious disease, and the mathematical tools required for their analysis. Because these tools are also basic to the analysis of models in biochemistry, physiology, and behavior, subject also broadly relevant to students whose interests are not limited to ecological problems.",
    "instructors" : "M. Neubert, H. Caswell (WHOI)"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.491",
    "academicYear" : "2016",
    "title" : "Research in Biological Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Directed research in biological oceanography not leading to graduate thesis and initiated prior to the qualifying exam.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.THG",
    "academicYear" : "2016",
    "title" : "Graduate Biology Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of a Ph.D. thesis; to be arranged by the student and an appropriate MIT faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.50",
    "academicYear" : "2016",
    "title" : "Method and Logic in Molecular Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor or <I>Coreq: 7.51, 7.52</I>",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Logic, experimental design and methods in biology, using discussions of the primary literature to discern the principles of biological investigation in making discoveries and testing hypotheses.  In collaboration with faculty, students also apply those principles to generate a potential research project, presented in both written and oral form. Limited to Course 7 graduate students.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.51",
    "academicYear" : "2016",
    "title" : "Principles of Biochemical Analysis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "6-0-6",
    "optional" : null,
    "description" : "Principles of biochemistry, emphasizing structure, equilibrium studies, kinetics, informatics, single-molecule studies, and experimental design. Topics include macromolecular binding and specificity, protein folding and unfolding, allosteric systems, transcription factors, kinases, membrane channels and transporters, and molecular machines.",
    "instructors" : "A. Keating, R. T. Sauer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.52",
    "academicYear" : "2016",
    "title" : "Genetics for Graduate Students",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Principles and approaches of genetic analysis, including Mendelian inheritance and prokaryotic genetics, yeast genetics, developmental genetics, neurogenetics, and human genetics.",
    "instructors" : "A. Amon, D. Housman, H. R. Horvitz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.547",
    "academicYear" : "2016",
    "title" : "Principles and Practice of Drug Development",
    "cluster" : "(Same subject as 10.547J, 15.136J, ESD.691J, HST.920J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 15.136J.",
    "instructors" : "T. J. Allen, C. L. Cooney, S. N. Finkelstein, A. J. Sinskey, G. K. Raju"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.58",
    "academicYear" : "2016",
    "title" : "Molecular Biology",
    "cluster" : "(Subject meets with 7.28)",
    "prerequisites" : "7.03; 7.05",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Detailed analysis of the biochemical mechanisms that control the maintenance, expression, and evolution of prokaryotic and eukaryotic genomes. Topics covered in lecture and readings of relevant literature include: gene regulation, DNA replication, genetic recombination, and mRNA translation. Logic of experimental design and data analysis emphasized. Presentations include both lectures and group discussions of representative papers from the literature. Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "S. Bell, W. Gilbert"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.59",
    "academicYear" : "2016",
    "title" : "Teaching College-Level Science and Engineering",
    "cluster" : "(Same subject as 1.95J, 5.95J, 6.982J, 8.395J, 18.094J)\n(Subject meets with 2.978)",
    "prerequisites" : "None",
    "units" : "2-0-2 [P/D/F]",
    "optional" : null,
    "description" : "See description under subject 5.95J.",
    "instructors" : "J. Rankin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.60",
    "academicYear" : "2016",
    "title" : "Cell Biology: Structure and Functions of the Nucleus",
    "cluster" : null,
    "prerequisites" : "7.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Eukaryotic genome structure, function, and expression, processing of RNA, and regulation of the cell cycle.  Emphasis on the techniques and logic used to address important problems in nuclear cell biology. Lectures on broad topic areas in nuclear cell biology and discussions on representative recent papers.",
    "instructors" : "P. Sharp, R. Young"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.61",
    "academicYear" : "2016",
    "title" : "Eukaryotic Cell Biology: Principles and Practice",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Emphasizes methods and logic used to analyze structure and function of eukaryotic cells in diverse systems (e.g., yeast, fly, worm, mouse, human; development, stem cells, neurons). Combines lectures and in-depth roundtable discussions of literature readings with the active participation of faculty experts. Focuses on membranes (structure, function, traffic), organelles, the cell surface, cytoskeleton and extracellular matrix. Ranges from basic studies to applications to human disease, while stressing critical analysis of experimental approaches. Enrollment limited.",
    "instructors" : "R. O. Hynes, M. Krieger"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.63",
    "academicYear" : "2016",
    "title" : "Immunology",
    "cluster" : "(Subject meets with 7.23)",
    "prerequisites" : "Permission of instructor",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Comprehensive survey of molecular, genetic, and cellular aspects of the immune system. Topics include innate and adaptive immunity; cells and organs of the immune system; immunoglobulin, T cell receptor, and major histocompatibility complex (MHC) proteins and genes; development and functions of B and T lymphocytes; immune responses to infections and tumors; hypersensitivity, autoimmunity, and immunodeficiencies. Particular attention to the development and function of the immune system as a whole, as studied by modern methods and techniques. Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "H. Ploegh, L. Steiner"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.67",
    "academicYear" : "2016",
    "title" : "Genetic Methods in Neurobiology",
    "cluster" : "(Same subject as 9.322J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 9.322J.",
    "instructors" : "W. G. Quinn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.68",
    "academicYear" : "2016",
    "title" : "Molecular and Cellular Neuroscience Core II",
    "cluster" : "(Same subject as 9.013J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 9.013J.",
    "instructors" : "G. Feng, L.-H. Tsai, Y. Lin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.69",
    "academicYear" : "2016",
    "title" : "Developmental Neurobiology",
    "cluster" : "(Same subject as 9.181J)\n(Subject meets with 7.49J, 9.18J)",
    "prerequisites" : "9.011 or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 9.181J.",
    "instructors" : "E. Nedivi, M. Heiman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.70",
    "academicYear" : "2016",
    "title" : "Regulation of Gene Expression",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Seminar examines basic principles of biological regulation of gene expression. Focuses on examples that underpin these principles, as well as those that challenge certain long-held views. Topics covered may include the role of transcription factors, enhancers, DNA modifications, non-coding RNAs, and chromatin structure in the regulation of gene expression and mechanisms for epigenetic inheritance of transcriptional states. Limited to 40.",
    "instructors" : "L. Boyer, M. Gehring"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.72",
    "academicYear" : "2016",
    "title" : "Principles and Frontiers of Developmental Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Covers fundamental principles and frontiers of animal development. Focuses on molecular mechanisms, experimental approaches, evolutionary context, human disorders, and topics of societal importance. Compares vertebrate (mouse, chick, frog, fish) and invertebrate (fly, worm) models. Modules include patterning and asymmetry of the body plan, cell type determination and diversity, organogenesis, morphogenesis, maternal control, organismal growth, stem cells, and issues in human development.",
    "instructors" : "H. Sive, T. Orr-Weaver"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.76",
    "academicYear" : "2016",
    "title" : "Topics in Macromolecular Structure and Function",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "In-depth analysis and discussion of classic and current literature, with an emphasis on the structure, function, and mechanisms of proteins and other biological macromolecules.",
    "instructors" : "C. Drennan, R. T. Sauer"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.77",
    "academicYear" : "2016",
    "title" : "Nucleic Acids, Structure, Function, Evolution and Their Interactions with Proteins",
    "cluster" : null,
    "prerequisites" : "7.05 or 7.51",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Surveys primary literature, focusing on biochemical, biophysical, genetic, and combinatorial approaches for understanding nucleic acids.  Topics include the general properties, functions, and structural motifs of DNA and RNA; RNAs as catalysts and as regulators of gene expression; RNA editing and surveillance, and the interaction of nucleic acids with proteins, such as zinc-finger proteins, modification enzymes, aminoacyl-tRNA synthetases and other proteins of the translational machinery. Includes some lectures but is mostly analysis and discussion of current literature in the context of student presentations.",
    "instructors" : "D. Bartel, U. RajBhandary"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.82",
    "academicYear" : "2016",
    "title" : "Topics of Mammalian Development and Genetics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9 [P/D/F]",
    "optional" : null,
    "description" : "Seminar covering embryologic, molecular, and genetic approaches to development in mice and humans. Topics include preimplantation development; gastrulation; embryonic stem cells, gene targeting and nuclear  reprogramming of somatic cells; genomic imprinting; X-inactivation; sex determination; and germ cells.",
    "instructors" : "R. Jaenisch, R. Young"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.931",
    "academicYear" : "2016",
    "title" : "Independent Study in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.932",
    "academicYear" : "2016",
    "title" : "Independent Study in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of study or research to be arranged with a department faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.941",
    "academicYear" : "2016",
    "title" : "Research Problems",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.942",
    "academicYear" : "2016",
    "title" : "Research Problems",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Directed research in a field of biological science, but not contributory to graduate thesis.",
    "instructors" : "Consult Biology Education Office"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.95",
    "academicYear" : "2016",
    "title" : "Cancer Biology",
    "cluster" : null,
    "prerequisites" : "7.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Intensive analysis of historical and current developments in cancer biology.  Topics include principles of transformation, viral and cellular oncogenes, tumor suppressor genes, tumor-cell growth, apoptosis, principles of cancer biology, and cancer genetics. Detailed analyses of the current research literature including important research reports published in recent years. Enrollment limited.",
    "instructors" : "R. Weinberg"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.98",
    "academicYear" : "2016",
    "title" : "Neural Plasticity in Learning and Memory",
    "cluster" : "(Same subject as 9.301J)",
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-6",
    "optional" : null,
    "description" : "See description under subject 9.301J.",
    "instructors" : "S. Tonegawa, W. Quinn"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.33",
    "academicYear" : "2016",
    "title" : "Evolutionary Biology:  Concepts, Models and Computation",
    "cluster" : "(Same subject as 6.049J)",
    "prerequisites" : "7.03; 6.0002, 6.01, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Explores and illustrates how evolution explains biology, with an emphasis on computational model building for analyzing evolutionary data.  Covers key concepts of biological evolution, including adaptive evolution, neutral evolution, evolution of sex, genomic conflict, speciation, phylogeny and comparative methods, life's history, coevolution, human evolution, and evolution of disease.",
    "instructors" : "R. Berwick, D. Bartel"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.013",
    "academicYear" : "2016",
    "title" : "Introductory Biology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "5-0-7 BIOLOGY",
    "optional" : "Credit cannot also be received for 7.012, 7.014, 7.015, 7.016, ES.7012, ES.7013",
    "description" : "Genomic approaches to human biology, focusing on neuroscience, development, repair and disease (including infectious agents, inherited diseases and cancer). Enrollment limited to seating capacity of classroom. Admittance may be controlled by lottery.",
    "instructors" : "L. Boyer, H. Sive"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.014",
    "academicYear" : "2016",
    "title" : "Introductory Biology",
    "cluster" : null,
    "prerequisites" : null,
    "units" : "5-0-7 BIOLOGY",
    "optional" : "Credit cannot also be received for 7.012, 7.013, 7.015, 7.016, ES.7012, ES.7013",
    "description" : "Studies the fundamental principles of biology and their application towards understanding the Earth as a dynamical system shaped by life. Focuses on molecular ecology in order to show how processes at the molecular level can illuminate macroscopic properties, including evolution and maintenance of biogeochemical cycles, and ecological interactions in ecosystems ranging from the ocean to the human gut. Includes quantitative analysis of population growth, community structure, competition, mutualism and predation; highlights their role in shaping the biosphere. Enrollment limited to seating capacity of classroom. Admittance may be controlled by lottery.",
    "instructors" : "G. C. Walker, S. W. Chisholm, M. Polz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.344",
    "academicYear" : "2016",
    "title" : "Advanced Undergraduate Seminar",
    "cluster" : null,
    "prerequisites" : "7.06 or 7.28",
    "units" : "2-0-4 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Seminars covering topics of current interest in biology with a focus on how to understand experimental methods and design and how to critically read the primary research literature. Small class size facilitates discussions and interactions with an active research scientist. Students visit research laboratories to see firsthand how biological research is conducted. Contact Biology Education Office for topics.",
    "instructors" : "H. R. Horvitz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.349",
    "academicYear" : "2016",
    "title" : "Advanced Undergraduate Seminar",
    "cluster" : null,
    "prerequisites" : "7.06 or 7.28",
    "units" : "2-0-4 [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Seminars covering topics of current interest in biology with a focus on how to understand experimental methods and design and how to critically read the primary research literature. Small class size facilitates discussions and interactions with an active research scientist. Students visit research laboratories to see firsthand how biological research is conducted. Contact Biology Education Office for topics.",
    "instructors" : "H. R. Horvitz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.66",
    "academicYear" : "2016",
    "title" : "Molecular Basis of Infectious Disease",
    "cluster" : "(Subject meets with 7.26)",
    "prerequisites" : "7.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Focuses on the principles of host-pathogen interactions with an emphasis on infectious diseases of humans. Presents key concepts of pathogenesis through the study of various human pathogens. Includes critical analysis and discussion of assigned readings.  Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "D. Kim"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.499",
    "academicYear" : "2016",
    "title" : "Research Rotations in Microbiology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor; <I>Coreq: 7.492, or 7.493</I>",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Introduces students to faculty participating in the interdepartmental Microbiology graduate program through a series of three lab rotations, which provide broad exposure to microbiology research at MIT. Students select a lab for thesis research by the end of their first year. Given the interdisciplinary nature of the program and the many research programs available, students may be able to work jointly with more than one research supervisor. Limited to students in the Microbiology graduate program. Limited to students in the microbiology program.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.MTHG",
    "academicYear" : "2016",
    "title" : "Microbiology Graduate Thesis",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Program of research leading to the writing of a PhD thesis. To be arranged by the student and the appropriate MIT faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.08",
    "academicYear" : "2016",
    "title" : "Biological Chemistry II",
    "cluster" : "(Same subject as 5.08J)\n(Subject meets with 7.80)",
    "prerequisites" : "5.12; 5.07 or 7.05",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 5.08J.",
    "instructors" : "J. Stubbe, E. Nolan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.392",
    "academicYear" : "2016",
    "title" : "Independent Study in Biology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.430",
    "academicYear" : "2016",
    "title" : "Topics in Quantitative Marine Science",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussions on quantitative marine ecology.  Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.433",
    "academicYear" : "2016",
    "title" : "Topics in Biological Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-4",
    "optional" : "Can be repeated for credit",
    "description" : "Lectures and discussions on biological oceanography.  Topics vary from year to year.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.81",
    "academicYear" : "2016",
    "title" : "Systems Biology",
    "cluster" : "(Same subject as 8.591J)\n(Subject meets with 7.32)",
    "prerequisites" : "18.03, 18.05; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 8.591J.",
    "instructors" : "J. Gore"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.62",
    "academicYear" : "2016",
    "title" : "Microbial Physiology",
    "cluster" : "(Subject meets with 7.21)",
    "prerequisites" : "7.03, 7.05",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Biochemical properties of bacteria and other microorganisms that enable them to grow under a variety of conditions. Interaction between bacteria and bacteriophages. Genetic and metabolic regulation of enzyme action and enzyme formation. Structure and function of components of the bacterial cell envelope. Protein secretion with a special emphasis on its various roles in pathogenesis. Additional topics include bioenergetics, symbiosis, quorum sensing, global responses to DNA damage, and biofilms. Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "G. C. Walker, A. J. Sinskey"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.80",
    "academicYear" : "2016",
    "title" : "Biological Chemistry II",
    "cluster" : "(Subject meets with 5.08J, 7.08J)",
    "prerequisites" : "5.12; 5.07 or 7.05",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "More advanced treatment of biochemical mechanisms that underlie biological processes. Topics include macromolecular machines such as the ribosome, the proteosome, fatty acid synthases as a paradigm for polyketide synthases and non-ribosomal polypeptide synthases, and polymerases. Emphasis is on experimental methods used to unravel these processes and how these processes fit into the cellular context and coordinate regulation.  Students taking the graduate version are expected to explore the subject in greater depth.",
    "instructors" : "J. Stubbe, E. Nolan"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.32",
    "academicYear" : "2016",
    "title" : "Systems Biology",
    "cluster" : "(Subject meets with 7.81J, 8.591J)",
    "prerequisites" : "18.03, 18.05; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Introduction to cellular and population-level systems biology with an emphasis on synthetic biology, modeling of genetic networks, cell-cell interactions, and evolutionary dynamics.  Cellular systems include genetic switches and oscillators, network motifs, genetic network evolution, and cellular decision-making.  Population-level systems include models of pattern formation, cell-cell communications, and evolutionary systems biology.  Students taking graduate version explore the subject in more depth.",
    "instructors" : "J. Gore"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.540",
    "academicYear" : "2016",
    "title" : "Frontiers in Chemical Biology",
    "cluster" : "(Same subject as 5.54J, 20.554J)",
    "prerequisites" : "5.13, 5.07, 7.06, permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "See description under subject 5.54J.",
    "instructors" : "B. Pentelute, M. Shoulders"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.492",
    "academicYear" : "2016",
    "title" : "Methods and Problems in Microbiology",
    "cluster" : "(Same subject as 1.86J, 20.445J)",
    "prerequisites" : "None",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Students will read and discuss primary literature covering key areas of microbial research with emphasis on methods and approaches used to understand and manipulate microbes. Preference to first-year Microbiology and Biology students.",
    "instructors" : "M. Laub"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.493",
    "academicYear" : "2016",
    "title" : "Microbial Genetics and Evolution",
    "cluster" : "(Same subject as 1.87J, 12.493J, 20.446J)",
    "prerequisites" : "7.03, 7.05, 7.28 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Covers aspects of microbial genetic and genomic analyses, central dogma, horizontal gene transfer, and evolution.",
    "instructors" : "A. D. Grossman, G. Fournier"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.498",
    "academicYear" : "2016",
    "title" : "Teaching Experience in Microbiology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "For qualified graduate students in the Microbiology graduate program interested in teaching. Classroom or laboratory teaching under the supervision of a faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.57",
    "academicYear" : "2016",
    "title" : "Quantitative Biology for Graduate Students",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Introduces the fundamental concepts and tools of quantitative approaches to molecular and cellular biology.  Covers a wide range of mathematical, computational, and statistical methods, although no previous expertise in these areas is required. Focuses on understanding quantitative approaches through the analysis of particular problems and examples drawn from classical genetics, molecular biology, cell biology, genomics, and systems biology.",
    "instructors" : "P. Gupta, A. Regev"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.89",
    "academicYear" : "2016",
    "title" : "Topics in Computational and Systems Biology",
    "cluster" : "(Same subject as CSB.100J)",
    "prerequisites" : "Permission of instructor",
    "units" : "2-0-10",
    "optional" : null,
    "description" : "See description under subject CSB.100J.",
    "instructors" : "C. Burge"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.20",
    "academicYear" : "2016",
    "title" : "Human Physiology",
    "cluster" : "(Same subject as HST.540J)",
    "prerequisites" : "7.05",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "Comprehensive subject in human physiology, emphasizing the molecular basis and applied aspects of organ function and regulation in health and disease. Includes a review of cell structure and function, as well as the mechanisms by which the endocrine and nervous systems integrate cellular metabolism. Special emphasis on examining the cardiovascular, pulmonary, gastrointestinal, and renal systems.",
    "instructors" : "M. Krieger, D. Sabatini"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.38",
    "academicYear" : "2016",
    "title" : "Mechanical Cell Biology",
    "cluster" : "(Subject meets with 7.83)",
    "prerequisites" : "7.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers current topics in eukaryotic cell biology, with a focus on understanding how physical forces are generated in cells and how these forces organize and shape cells and tissues. Combines lectures and the analysis of the primary literature to explore concepts and experimental approaches related to forces in cell biology at the molecular, cellular, and organismal level. Also considers the journal publication process, providing insights and experience into writing a cover letter, paper submission, reviewer critique, and communicating the significance of one's research. Students taking the graduate version explore the subject in greater depth.",
    "instructors" : "I. Cheeseman, A. Martin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.19",
    "academicYear" : "2016",
    "title" : "Communication in Experimental Biology",
    "cluster" : "(Subject meets with 7.18)",
    "prerequisites" : "7.02, 7.03, 7.05",
    "units" : "4-4-4",
    "optional" : null,
    "description" : "Students carry out independent literature research. Meets with the seminar and writing tutorial portions of 7.18. Journal club discussions are used to help students evaluate and write scientific papers. Instruction and practice in written and oral communication is provided. Permission of the instructor and the Biology Education Office must be obtained in advance.",
    "instructors" : "Fall: D. Kim, A.J. Sinskey, C. Kaiser<br>Spring: D. Kim, C. Kaiser, U. Rajbhandary"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.71",
    "academicYear" : "2016",
    "title" : "Biophysical Chemistry Techniques",
    "cluster" : "(Subject meets with 5.78)",
    "prerequisites" : "5.13, 5.60; 5.07 or 7.05",
    "units" : "5-0-7",
    "optional" : null,
    "description" : "For students who want to understand the benefits and caveats of biophysical techniques used to ascertain the structure of macromolecules, especially on the 3-D level. The first half of the course focuses on x-ray crystallography, the single most important technique used in determining the 3-D structure of macromolecules. Discussion of crystallographic theory is complemented with exercises such as crystallization, data processing, and model building. In the second half of the course, biophysical techniques are covered that supplement the 3-D characterization of biological macromolecules. Topics include CD spectroscopy, isothermal calorimetry, analytical ultracentrifugation, dynamic light scattering, and surface plasmon resonance (BIAcore). Theoretical principles behind the techniques are covered, applications are discussed, and students are performing practical exercises using instrumentation available at MIT. Meets with 5.78 when offered concurrently.",
    "instructors" : "C. Drennan, T. Schwartz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.012",
    "academicYear" : "2016",
    "title" : "Introductory Biology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "5-0-7 BIOLOGY",
    "optional" : "Credit cannot also be received for 7.013, 7.014, 7.015, 7.016, ES.7012, ES.7013",
    "description" : "Exploration into areas of current research in cell biology, immunology, neurobiology, human genetics, developmental biology, and evolution. Enrollment limited to seating capacity of classroom. Admittance may be controlled by lottery.",
    "instructors" : "E. Lander, R. Weinberg"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.549",
    "academicYear" : "2016",
    "title" : "Case Studies and Strategies in Drug Discovery and Development",
    "cluster" : "(Same subject as 15.137J, 20.486J, HST.916J)",
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 20.486J.",
    "instructors" : "A. W. Wood, A. J. Sinskey, S. R. Tannenbaum"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.934",
    "academicYear" : "2016",
    "title" : "Teaching Experience in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "For qualified graduate students in the Biology graduate program interested in teaching.  Classroom or laboratory teaching under the supervision of a faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.494",
    "academicYear" : "2016",
    "title" : "Research Problems in Microbiology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Directed research in the fields of microbial science and engineering.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.394",
    "academicYear" : "2016",
    "title" : "Independent Study in Biochemistry",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.49",
    "academicYear" : "2016",
    "title" : "Developmental Neurobiology",
    "cluster" : "(Same subject as 9.18J)\n(Subject meets with 7.69J, 9.181J)",
    "prerequisites" : "9.01, 7.03, 7.05, or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Considers molecular control of neural specification, formation of neuronal connections, construction of neural systems, and the contributions of experience to shaping brain structure and function. Topics include: neural induction and pattern formation, cell lineage and fate determination, neuronal migration, axon guidance, synapse formation and stabilization, activity-dependent development and critical periods, development of behavior. Students taking graduate version complete additional assignments.",
    "instructors" : "E. Nedivi, M. Heiman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.10",
    "academicYear" : "2016",
    "title" : "Physical Chemistry of Biomolecular Systems",
    "cluster" : "(Same subject as 20.111J)",
    "prerequisites" : "Calculus II (GIR), Chemistry (GIR), Physics I (GIR); <I>Coreq: Physics II (GIR)</I>",
    "units" : "5-0-7",
    "optional" : "Credit cannot also be received for 2.772, 20.110",
    "description" : "Provides a quantitative approach to understanding the physical and chemical laws that govern the behavior of biological macromolecules.  Basic thermodynamics, state of a system, state variables. Work, heat, first, second, and third laws of thermodynamics.  Entropy and its statistical basis, free energy representations, Legendre transforms, Maxwell relations, Gibbs function, Boltzmann distribution and partition functions.  Equilibrium properties of macroscopic and microscopic systems; macromolecular structure and interactions in solution. Driving forces for molecular self-assembly. Binding, cooperativity, solvation, and titration of macromolecules. Meets with 5.60 first half of term.",
    "instructors" : "E. Alm, C. Voigt"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.64",
    "academicYear" : "2016",
    "title" : "Molecular Mechanisms, Pathology and Therapy of Human Neuromuscular Disorders",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Investigates the molecular and clinical basis of central nervous system and neuromuscular disorders with particular emphasis on strategies for therapeutic intervention. Considers the in-depth analysis of clinical features, pathological mechanisms, and responses to current therapeutic interventions. Covers neurodegenerative diseases, such as Huntington's disease, Parkinson's disease, Alzheimer's disease, Amyotropic Lateral Schlerosis, Frontal Temporal Dementia, and neuromuscular disorders, such as Myotonic Dystrophy, Facio Scapular Humoral Dystrophy, and Duchenne Muscular Dystrophy.",
    "instructors" : "D. Housman"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.36",
    "academicYear" : "2016",
    "title" : "Foundations of Computational and Systems Biology",
    "cluster" : "(Same subject as 6.802J, 20.390J)\n(Subject meets with 6.874J, 7.91, 20.490J, HST.506J)",
    "prerequisites" : "Biology (GIR), 6.0002 or 6.01; or 7.05; or permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "See description under subject 6.802J.",
    "instructors" : "D. K. Gifford, T. S. Jaakkola"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.393",
    "academicYear" : "2016",
    "title" : "Independent Study in Genetics",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.395",
    "academicYear" : "2016",
    "title" : "Independent Study in Cell and Molecular Biology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : null,
    "instructors" : null
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.396",
    "academicYear" : "2016",
    "title" : "Independent Study in Experimental Biology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Program of study or research to be arranged with a department faculty member.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.016",
    "academicYear" : "2016",
    "title" : "Introductory Biology",
    "cluster" : null,
    "prerequisites" : "None",
    "units" : "5-0-7 BIOLOGY",
    "optional" : "Credit cannot also be received for 7.012, 7.013, 7.014, 7.015, ES.7012, ES.7013",
    "description" : "Introduction to fundamental principles of biochemistry, molecular biology and genetics for understanding the functions of living systems. Covers examples of the use of chemical biology and 21st-century molecular genetics in understanding human health and therapeutic intervention. Enrollment limited to seating capacity of classroom. Admittance may be controlled by lottery.",
    "instructors" : "A. Amon, B. Imperiali"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.83",
    "academicYear" : "2016",
    "title" : "Mechanical Cell Biology",
    "cluster" : "(Subject meets with 7.38)",
    "prerequisites" : "7.06",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Covers current topics in eukaryotic cell biology, with a focus on understanding how physical forces are generated in cells and how these forces organize and shape cells and tissues. Combines lectures and the analysis of the primary literature to explore concepts and experimental approaches related to forces in cell biology at the molecular, cellular, and organismal level. Also considers the journal publication process, providing insights and experience into writing a cover letter, paper submission, reviewer critique, and communicating the significance of one's research. Students taking the graduate version explore the subject in greater depth.",
    "instructors" : "I. Cheeseman, A. Martin"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.15",
    "academicYear" : "2016",
    "title" : "Experimental Molecular Genetics",
    "cluster" : null,
    "prerequisites" : "7.02, 7.03",
    "units" : "4-16-10",
    "optional" : null,
    "description" : "In this project-based laboratory subject, students carry out independent molecular genetics experiments that develop skills in the planning, execution, and analysis of original experimental biological research. Specific research topic, which is determined by teaching staff, involves the application of modern biological methods, such as next-generation sequencing and metabolomics. Reading and writing assignments focus on the critical evaluation and discussion of relevant scientific literature. Emphasizes instruction in laboratory methods and the testing of hypotheses, as well as the critical analysis of experimental results.",
    "instructors" : "J. Weng"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.015",
    "academicYear" : "2016",
    "title" : "Introductory Biology",
    "cluster" : null,
    "prerequisites" : "Advanced high school course covering cellular and molecular biology, or permission of instructor",
    "units" : "5-0-7 BIOLOGY",
    "optional" : "Credit cannot also be received for 7.012, 7.013, 7.014, 7.016, ES.7012, ES.7013",
    "description" : "Emphasizes the application of fundamental biological principles to trending topics in microbiology and immunology. Specific modules focus on antibiotic resistance, influenza, genome-wide association studies, biotechnology (such as genetically modified organisms and personal genomics), the microbiome, and diabetes. Includes discussion of the social and ethical issues surrounding modern biology. Limited to 60; admittance may be controlled by lottery.",
    "instructors" : "M. Laub, H. Ploegh"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.S390",
    "academicYear" : "2016",
    "title" : "Special Subject in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Covers material in various fields of biology not offered by the regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.S930",
    "academicYear" : "2016",
    "title" : "Special Subject in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : "Can be repeated for credit",
    "description" : "Covers material in various fields of biology not offered by the regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.78",
    "academicYear" : "2016",
    "title" : "Methods and Topics in Protein Biochemistry and Biophysics",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Students read and discuss papers dealing with protein structure and function and biophysical techniques used to characterize biological macromolecules. Topics include cooperativity and allostery, protein folding and misfolding, pathways of macromolecular assembly, molecular motors, and protein design. Methods include CD spectroscopy, isothermal calorimetry, analytical ultracentrifugation, light scattering, and real-time kinetic measurements. Covers theoretical principles behind the techniques. Students complete practical exercises using instrumentation available at MIT.",
    "instructors" : "R. T. Sauer, T. Schwartz"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.935",
    "academicYear" : "2016",
    "title" : "Responsible Conduct in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged [P/D/F]",
    "optional" : null,
    "description" : "Sessions focus on the responsible conduct of science. Considers recordkeeping and reporting; roles of mentor and mentee; authorship, review, and confidentiality; resolving conflicts; misfeasance and malfeasance; collaborations, competing interests, and intellectual property; and proper practices in the use of animal and human subjects. Limited to second-year graduate students in Biology.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.45",
    "academicYear" : "2016",
    "title" : "The Hallmarks of Cancer",
    "cluster" : "(Subject meets with 7.85)",
    "prerequisites" : "7.06",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Provides a comprehensive introduction to the fundamentals of cancer biology and cancer treatment. Topics include cancer genetics, genomics, and epigenetics; familial cancer syndromes; signal transduction, cell cycle control, and apoptosis; cancer metabolism; stem cells and cancer; metastasis; cancer immunology and immunotherapy; conventional and molecularly-targeted therapies; and early detection and prevention. Students taking graduate version complete additional assignments.",
    "instructors" : "T. Jacks, M. Vander Heiden"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.371",
    "academicYear" : "2016",
    "title" : "Biological and Engineering Principles Underlying Novel Biotherapeutics",
    "cluster" : null,
    "prerequisites" : "7.06",
    "units" : "4-0-8",
    "optional" : "Credit cannot also be received for 7.37, 10.441, 20.361",
    "description" : "Covers biological and bioengineering principles underlying the development and therapeutic use of recombinant proteins and immune cells. Special attention to monoclonal antibodies and engineered immune system cells as therapeutics; protein- and glyco- engineering to enhance protein function; protein pharmacology and delivery; nucleic acid- based biotherapeutics; generation of functional cells and tissues from embryonic stem cells and iPS cells; and macrophages in health and diseases.",
    "instructors" : "J. Chen, H. Lodish"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.S399",
    "academicYear" : "2016",
    "title" : "Special Subject in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Covers material in various fields of biology not offered by the regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.09",
    "academicYear" : "2016",
    "title" : "Quantitative and Computational Biology",
    "cluster" : null,
    "prerequisites" : "7.03, 7.05",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Quantitative and computational analysis of biological systems at the molecular and cellular level.  Includes models of biological processes across different time scales, from steady-state to kinetics of gene expression, circadian clock, cell growth, and evolutionary dynamics. Methods include physical, systems, and synthetic biology. Also covers second-generation sequencing technologies, and topics in computational analysis of genomes, including sequence alignment, motif finding, information theory and RNA secondary structure prediction.",
    "instructors" : "C. Burge, G. W. Li"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.41",
    "academicYear" : "2016",
    "title" : "Principles of Chemical Biology",
    "cluster" : null,
    "prerequisites" : "7.05",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Spanning the fields of biology, chemistry and engineering, class addresses the principles of chemical biology and its application of chemical and physical methods and reagents to the study and manipulation of biological systems. Topics include bioorthogonal reactions and activity-based protein profiling, small molecule inhibitors and chemical genetics, fluorescent probes for biological studies, and unnatural amino acid mutagenesis. Also covers chemical biology approaches for studying dynamic post-translational modification reactions, natural product biosynthesis and mutasynthesis, and high-throughput drug screening.",
    "instructors" : "B. Imperiali, J. K. Weng"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.30A",
    "academicYear" : "2016",
    "title" : "Fundamentals of Ecology I",
    "cluster" : "(Same subject as 1.018AJ, 12.031AJ)",
    "prerequisites" : "None",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 1.018AJ.",
    "instructors" : "S. Chisholm, M. Follows"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.30B",
    "academicYear" : "2016",
    "title" : "Fundamentals of Ecology II",
    "cluster" : "(Same subject as 1.018BJ, 12.031BJ)",
    "prerequisites" : "1.018A",
    "units" : "2-0-4",
    "optional" : null,
    "description" : "See description under subject 1.018BJ.",
    "instructors" : "S. Chisholm, M. Follows"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.S939",
    "academicYear" : "2016",
    "title" : "Special Subject in Biology",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "Units arranged",
    "optional" : "Can be repeated for credit",
    "description" : "Covers material in various fields of biology not offered by the regular subjects of instruction.",
    "instructors" : "Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.470",
    "academicYear" : "2016",
    "title" : "Biological Oceanography",
    "cluster" : null,
    "prerequisites" : "Permission of instructor",
    "units" : "3-0-9",
    "optional" : null,
    "description" : "Intended for students with advanced training in biology. Intensive overview of biological oceanography. Major paradigms discussed, and dependence of biological processes in the ocean on physical and chemical aspects of the environment examined. Surveys the diversity of marine habitats, major groups of taxa inhabiting those habitats, and the general biology of the various taxa: the production and consumption of organic material in the ocean, as well as factors controlling those processes. Species diversity, structure of marine food webs, and the flow of energy within different marine habitats are detailed and contrasted.",
    "instructors" : "WHOI Staff"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.87",
    "academicYear" : "2016",
    "title" : "Protein Folding and Misfolding in Biology",
    "cluster" : null,
    "prerequisites" : "7.51 and 7.52; or permission of instructor",
    "units" : "3-0-6",
    "optional" : "Credit cannot also be received for 7.88",
    "description" : "Covers protein folding, misfolding, aggregation, and amyloid formation in the context of biological systems. Addresses topics such as chaperone structure and function, biofilm formation by bacteria, protein-folding diseases (including but not limited to Alzheimer's, Parkinson's, and Huntington's diseases), the process of therapeutics discovery for drugs  and biologics. Features guest lectures and Skype discussions with international leaders in the field. Students present papers covering mutually agreed-upon topics of interest.",
    "instructors" : "S. Lindquist"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.85",
    "academicYear" : "2016",
    "title" : "The Hallmarks of Cancer",
    "cluster" : "(Subject meets with 7.45)",
    "prerequisites" : "7.06 or permission of instructor",
    "units" : "4-0-8",
    "optional" : null,
    "description" : "Provides a comprehensive introduction to the fundamentals of cancer biology and cancer treatment. Topics include cancer genetics, genomics, and epigenetics; familial cancer syndromes; signal transduction, cell cycle control, and apoptosis; cancer metabolism; stem cells and cancer; metastasis; cancer immunology and immunotherapy; conventional and molecularly-targeted therapies; and early detection and prevention. Students taking graduate version complete additional assignments.",
    "instructors" : "T. Jacks, M. Vander Heiden"
  }, {
    "termCode" : "2016FA",
    "subjectId" : "7.331",
    "academicYear" : "2016",
    "title" : "Infections and Inequalities: Interdisciplinary Perspectives on Global Health",
    "cluster" : "(Same subject as 21A.331J, HST.431J)",
    "prerequisites" : "None",
    "units" : "3-0-9 HASS-S",
    "optional" : null,
    "description" : "See description under subject 21A.331J.",
    "instructors" : "E. James, D. Kim, A. Chakraborty"
  } ]
}